const jdList = [
				{
								"nav": ["保险"],
								"navIds": ["001"],
								"value": "001",
								"label": "保险",
								"children": [
												{
																"isLeaf": true,
																"label": "保险公司",
																"value": "001001",
																"nav": [
																				"保险", "保险公司"
																],
																"navIds": ["001", "001001"]
												}, {
																"isLeaf": true,
																"label": "保险代理机构",
																"value": "001002",
																"nav": [
																				"保险", "保险代理机构"
																],
																"navIds": ["001", "001002"]
												}, {
																"isLeaf": true,
																"label": "保险经纪公司",
																"value": "001003",
																"nav": [
																				"保险", "保险经纪公司"
																],
																"navIds": ["001", "001003"]
												}, {
																"isLeaf": true,
																"label": "保险公估公司",
																"value": "001004",
																"nav": [
																				"保险", "保险公估公司"
																],
																"navIds": ["001", "001004"]
												}, {
																"isLeaf": true,
																"label": "保险兼业代理公司",
																"value": "001005",
																"nav": [
																				"保险", "保险兼业代理公司"
																],
																"navIds": ["001", "001005"]
												}
								]
				}, {
								"nav": ["投资/理财"],
								"navIds": ["002"],
								"value": "002",
								"label": "投资/理财",
								"children": [
												{
																"isLeaf": true,
																"label": "黄金理财",
																"value": "002001",
																"nav": [
																				"投资/理财", "黄金理财"
																],
																"navIds": ["002", "002001"]
												}, {
																"isLeaf": true,
																"label": "P2P行业",
																"value": "002002",
																"nav": [
																				"投资/理财", "P2P行业"
																],
																"navIds": ["002", "002002"]
												}, {
																"isLeaf": true,
																"label": "信托/担保/证券/票据理财/实物投资/",
																"value": "002003",
																"nav": [
																				"投资/理财", "信托/担保/证券/票据理财/实物投资/"
																],
																"navIds": ["002", "002003"]
												}, {
																"isLeaf": true,
																"label": "基金",
																"value": "002004",
																"nav": [
																				"投资/理财", "基金"
																],
																"navIds": ["002", "002004"]
												}, {
																"isLeaf": true,
																"label": "保险理财",
																"value": "002005",
																"nav": [
																				"投资/理财", "保险理财"
																],
																"navIds": ["002", "002005"]
												}, {
																"isLeaf": true,
																"label": "产品众筹",
																"value": "002006",
																"nav": [
																				"投资/理财", "产品众筹"
																],
																"navIds": ["002", "002006"]
												}
								]
				}, {
								"nav": ["互联网金融"],
								"navIds": ["003"],
								"value": "003",
								"label": "互联网金融",
								"children": [
												{
																"isLeaf": true,
																"label": "金融综合服务平台",
																"value": "003001",
																"nav": [
																				"互联网金融", "金融综合服务平台"
																],
																"navIds": ["003", "003001"]
												}, {
																"isLeaf": true,
																"label": "消费金融",
																"value": "003002",
																"nav": [
																				"互联网金融", "消费金融"
																],
																"navIds": ["003", "003002"]
												}
								]
				}, {
								"nav": ["典当"],
								"navIds": ["004"],
								"value": "004",
								"label": "典当",
								"children": [
												{
																"isLeaf": true,
																"label": "典当",
																"value": "004001",
																"nav": [
																				"典当", "典当"
																],
																"navIds": ["004", "004001"]
												}
								]
				}, {
								"nav": ["银行"],
								"navIds": ["005"],
								"value": "005",
								"label": "银行",
								"children": [
												{
																"isLeaf": true,
																"label": "银行",
																"value": "005001",
																"nav": [
																				"银行", "银行"
																],
																"navIds": ["005", "005001"]
												}
								]
				}, {
								"nav": ["公益"],
								"navIds": ["006"],
								"value": "006",
								"label": "公益",
								"children": [
												{
																"isLeaf": true,
																"label": "公益",
																"value": "006001",
																"nav": [
																				"公益", "公益"
																],
																"navIds": ["006", "006001"]
												}
								]
				}, {
								"nav": ["票务/旅游"],
								"navIds": ["007"],
								"value": "007",
								"label": "票务/旅游",
								"children": [
												{
																"isLeaf": true,
																"label": "旅行社",
																"value": "007001",
																"nav": [
																				"票务/旅游", "旅行社"
																],
																"navIds": ["007", "007001"]
												}, {
																"isLeaf": true,
																"label": "机票",
																"value": "007002",
																"nav": [
																				"票务/旅游", "机票"
																],
																"navIds": ["007", "007002"]
												}, {
																"isLeaf": true,
																"label": "OTA平台",
																"value": "007003",
																"nav": [
																				"票务/旅游", "OTA平台"
																],
																"navIds": ["007", "007003"]
												}, {
																"isLeaf": true,
																"label": "酒店/民宿预订",
																"value": "007004",
																"nav": [
																				"票务/旅游", "酒店/民宿预订"
																],
																"navIds": ["007", "007004"]
												}, {
																"isLeaf": true,
																"label": "航空公司",
																"value": "007005",
																"nav": [
																				"票务/旅游", "航空公司"
																],
																"navIds": ["007", "007005"]
												}, {
																"isLeaf": true,
																"label": "票务",
																"value": "007006",
																"nav": [
																				"票务/旅游", "票务"
																],
																"navIds": ["007", "007006"]
												}
								]
				}, {
								"nav": ["网上商城"],
								"navIds": ["008"],
								"value": "008",
								"label": "网上商城",
								"children": [
												{
																"isLeaf": true,
																"label": "综合类商城/3C/家电/消费品/居家生活/大服饰等",
																"value": "008001",
																"nav": [
																				"网上商城", "综合类商城/3C/家电/消费品/居家生活/大服饰等"
																],
																"navIds": ["008", "008001"]
												}, {
																"isLeaf": true,
																"label": "医药销售",
																"value": "008002",
																"nav": [
																				"网上商城", "医药销售"
																],
																"navIds": ["008", "008002"]
												}, {
																"isLeaf": true,
																"label": "医疗器械",
																"value": "008003",
																"nav": [
																				"网上商城", "医疗器械"
																],
																"navIds": ["008", "008003"]
												}
								]
				}, {
								"nav": ["零售业（线下实体店）"],
								"navIds": ["009"],
								"value": "009",
								"label": "零售业（线下实体店）",
								"children": [
												{
																"isLeaf": true,
																"label": "超市",
																"value": "009001",
																"nav": [
																				"零售业（线下实体店）", "超市"
																],
																"navIds": ["009", "009001"]
												}, {
																"isLeaf": true,
																"label": "便利店",
																"value": "009002",
																"nav": [
																				"零售业（线下实体店）", "便利店"
																],
																"navIds": ["009", "009002"]
												}, {
																"isLeaf": true,
																"label": "百货/商圈/购物中心",
																"value": "009003",
																"nav": [
																				"零售业（线下实体店）", "百货/商圈/购物中心"
																],
																"navIds": ["009", "009003"]
												}, {
																"isLeaf": true,
																"label": "自助售卖机",
																"value": "009004",
																"nav": [
																				"零售业（线下实体店）", "自助售卖机"
																],
																"navIds": ["009", "009004"]
												}, {
																"isLeaf": true,
																"label": "家装建材/家居家纺",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "家装建材/家居家纺"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "数码家电/办公设备",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "数码家电/办公设备"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "美妆/护肤",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "美妆/护肤"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "鲜花/盆栽/室内装饰品",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "鲜花/盆栽/室内装饰品"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "交通工具/配件/改装",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "交通工具/配件/改装"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "宠物/宠物食品/饲料",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "宠物/宠物食品/饲料"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "母婴用品/儿童玩具",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "母婴用品/儿童玩具"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "服饰/箱包/饰品",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "服饰/箱包/饰品"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "户外/运动/健身器材/安防",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "户外/运动/健身器材/安防"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "钟表/眼镜",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "钟表/眼镜"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "黄金珠宝/钻石/玉石",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "黄金珠宝/钻石/玉石"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "书籍/音像",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "书籍/音像"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "文具/乐器/3C数码",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "文具/乐器/3C数码"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "家用电器/器械配件",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "家用电器/器械配件"
																],
																"navIds": ["009", "009005"]
												}, {
																"isLeaf": true,
																"label": "户外器械/保健器械等",
																"value": "009005",
																"nav": [
																				"零售业（线下实体店）", "户外器械/保健器械等"
																],
																"navIds": ["009", "009005"]
												}
								]
				}, {
								"nav": ["运输服务"],
								"navIds": ["010"],
								"value": "010",
								"label": "运输服务",
								"children": [
												{
																"isLeaf": true,
																"label": "交通运输",
																"value": "010001",
																"nav": [
																				"运输服务", "交通运输"
																],
																"navIds": ["010", "010001"]
												}, {
																"isLeaf": true,
																"label": "物流服务",
																"value": "010002",
																"nav": [
																				"运输服务", "物流服务"
																],
																"navIds": ["010", "010002"]
												}, {
																"isLeaf": true,
																"label": "港口经营/港口理货",
																"value": "010003",
																"nav": [
																				"运输服务", "港口经营/港口理货"
																],
																"navIds": ["010", "010003"]
												}, {
																"isLeaf": true,
																"label": "航空运输",
																"value": "010004",
																"nav": [
																				"运输服务", "航空运输"
																],
																"navIds": ["010", "010004"]
												}
								]
				}, {
								"nav": ["本地生活服务"],
								"navIds": ["011"],
								"value": "011",
								"label": "本地生活服务",
								"children": [
												{
																"isLeaf": true,
																"label": "人才招聘",
																"value": "011001",
																"nav": [
																				"本地生活服务", "人才招聘"
																],
																"navIds": ["011", "011001"]
												}, {
																"isLeaf": true,
																"label": "餐饮门店",
																"value": "011002",
																"nav": [
																				"本地生活服务", "餐饮门店"
																],
																"navIds": ["011", "011002"]
												}, {
																"isLeaf": true,
																"label": "网上生活服务平台(O2O) ",
																"value": "011003",
																"nav": [
																				"本地生活服务", "网上生活服务平台(O2O) "
																],
																"navIds": ["011", "011003"]
												}, {
																"isLeaf": true,
																"label": "公共费用代缴",
																"value": "011004",
																"nav": [
																				"本地生活服务", "公共费用代缴 "
																],
																"navIds": ["011", "011004"]
												}, {
																"isLeaf": true,
																"label": "医疗服务平台",
																"value": "011005",
																"nav": [
																				"本地生活服务", "医疗服务平台 "
																],
																"navIds": ["011", "011005"]
												}, {
																"isLeaf": true,
																"label": "婚介交友/咨询服务/婚庆/汽车保养/娱乐休闲/广告设计/宠物服务/衣物保养/维修服务",
																"value": "011006",
																"nav": [
																				"本地生活服务", "婚介交友/咨询服务/婚庆/汽车保养/娱乐休闲/广告设计/宠物服务/衣物保养/维修服务 "
																],
																"navIds": ["011", "011006"]
												}
								]
				}, {
								"nav": ["缴费"],
								"navIds": ["012"],
								"value": "012",
								"label": "缴费",
								"children": [
												{
																"isLeaf": true,
																"label": "通信/宽带收费",
																"value": "012001",
																"nav": [
																				"缴费", "通信/宽带收费"
																],
																"navIds": ["012", "012001"]
												}, {
																"isLeaf": true,
																"label": "有线电视缴费",
																"value": "012002",
																"nav": [
																				"缴费", "有线电视缴费"
																],
																"navIds": ["012", "012002"]
												}, {
																"isLeaf": true,
																"label": "公共事业缴费",
																"value": "012003",
																"nav": [
																				"缴费", "公共事业缴费"
																],
																"navIds": ["012", "012003"]
												}, {
																"isLeaf": true,
																"label": "物业管理费",
																"value": "012004",
																"nav": [
																				"缴费", "物业管理费"
																],
																"navIds": ["012", "012004"]
												}
								]
				}, {
								"nav": ["互联网系统服务"],
								"navIds": ["013"],
								"value": "013",
								"label": "互联网系统服务",
								"children": [
												{
																"isLeaf": true,
																"label": "互联网系统服务",
																"value": "013001",
																"nav": [
																				"互联网系统服务", "互联网系统服务"
																],
																"navIds": ["013", "013001"]
												}
								]
				}, {
								"nav": ["医疗"],
								"navIds": ["014"],
								"value": "014",
								"label": "医疗",
								"children": [
												{
																"isLeaf": true,
																"label": "医疗机构",
																"value": "014001",
																"nav": [
																				"医疗", "医疗机构"
																],
																"navIds": ["014", "014001"]
												}
								]
				}, {
								"nav": ["房地产"],
								"navIds": ["015"],
								"value": "015",
								"label": "房地产",
								"children": [
												{
																"isLeaf": true,
																"label": "房屋中介",
																"value": "015001",
																"nav": [
																				"房地产", "房屋中介"
																],
																"navIds": ["015", "015001"]
												}, {
																"isLeaf": true,
																"label": "房产预售",
																"value": "015002",
																"nav": [
																				"房地产", "房产预售"
																],
																"navIds": ["015", "015002"]
												}
								]
				}, {
								"nav": ["文化教育"],
								"navIds": ["016"],
								"value": "016",
								"label": "文化教育",
								"children": [
												{
																"isLeaf": true,
																"label": "教育机构",
																"value": "016001",
																"nav": [
																				"文化教育", "教育机构"
																],
																"navIds": ["016", "016001"]
												}, {
																"isLeaf": true,
																"label": "公立学校",
																"value": "016002",
																"nav": [
																				"文化教育", "公立学校"
																],
																"navIds": ["016", "016002"]
												}, {
																"isLeaf": true,
																"label": "在线教育",
																"value": "016003",
																"nav": [
																				"文化教育", "在线教育"
																],
																"navIds": ["016", "016003"]
												}
								]
				}, {
								"nav": ["数字娱乐"],
								"navIds": ["017"],
								"value": "017",
								"label": "数字娱乐",
								"children": [
												{
																"isLeaf": true,
																"label": "游戏/点卡",
																"value": "017001",
																"nav": [
																				"数字娱乐", "游戏/点卡"
																],
																"navIds": ["017", "017001"]
												}, {
																"isLeaf": true,
																"label": "在线娱乐",
																"value": "017002",
																"nav": [
																				"数字娱乐", "在线娱乐"
																],
																"navIds": ["017", "017002"]
												}
								]
				}, {
								"nav": ["彩票"],
								"navIds": ["018"],
								"value": "018",
								"label": "彩票",
								"children": [
												{
																"isLeaf": true,
																"label": "彩票O2O",
																"value": "018001",
																"nav": [
																				"彩票", "彩票O2O"
																],
																"navIds": ["018", "018001"]
												}, {
																"isLeaf": true,
																"label": "彩票投注站",
																"value": "018002",
																"nav": [
																				"彩票", "彩票投注站"
																],
																"navIds": ["018", "018002"]
												}
								]
				}, {
								"nav": ["出行服务"],
								"navIds": ["019"],
								"value": "019",
								"label": "出行服务",
								"children": [
												{
																"isLeaf": true,
																"label": "网络用车",
																"value": "019001",
																"nav": [
																				"出行服务", "网络用车"
																],
																"navIds": ["019", "019001"]
												}, {
																"isLeaf": true,
																"label": "停车费",
																"value": "019002",
																"nav": [
																				"出行服务", "停车费"
																],
																"navIds": ["019", "019002"]
												}, {
																"isLeaf": true,
																"label": "交通/路桥费/加油服务",
																"value": "019003",
																"nav": [
																				"出行服务", "交通/路桥费/加油服务"
																],
																"navIds": ["019", "019003"]
												}
								]
				}
];

export default jdList;