export default[
    {
        "p" : "内蒙古",
        "code" : "1",
        "c" : [
            {
                "n": "阿拉善盟",
                "code": "34",
                "a": [
                    {
                        "n": "阿拉善盟",
                        "code": "2080"
                    }, {
                        "n": "阿拉善左旗",
                        "code": "2081"
                    }, {
                        "n": "阿拉善右旗",
                        "code": "2082"
                    }, {
                        "n": "额济纳旗",
                        "code": "2083"
                    }
                ]
            }, {
                "n": "巴彦淖尔市",
                "code": "43",
                "a": [
                    {
                        "n": "巴彦淖尔市",
                        "code": "2070"
                    }, {
                        "n": "磴口县",
                        "code": "2073"
                    }, {
                        "n": "杭锦后旗",
                        "code": "2077"
                    }, {
                        "n": "乌拉特后旗",
                        "code": "2076"
                    }, {
                        "n": "乌拉特前旗",
                        "code": "2074"
                    }, {
                        "n": "乌拉特中旗",
                        "code": "2075"
                    }, {
                        "n": "五原县",
                        "code": "2072"
                    }
                ]
            }, {
                "n": "包头市",
                "code": "51",
                "a": [
                    {
                        "n": "包头市",
                        "code": "1920"
                    }, {
                        "n": "达尔罕茂明安联合旗",
                        "code": "2045"
                    }, {
                        "n": "固阳县",
                        "code": "1922"
                    }, {
                        "n": "土默特右旗",
                        "code": "1921"
                    }
                ]
            }, {
                "n": "赤峰市",
                "code": "78",
                "a": [
                    {
                        "n": "阿鲁科尔沁旗",
                        "code": "1941"
                    }, {
                        "n": "敖汉旗",
                        "code": "1949"
                    }, {
                        "n": "巴林右旗",
                        "code": "1943"
                    }, {
                        "n": "巴林左旗",
                        "code": "1942"
                    }, {
                        "n": "赤峰市",
                        "code": "1940"
                    }, {
                        "n": "喀喇沁旗",
                        "code": "1947"
                    }, {
                        "n": "克什克腾",
                        "code": "1945"
                    }, {
                        "n": "林西县",
                        "code": "1944"
                    }, {
                        "n": "宁城县",
                        "code": "1948"
                    }, {
                        "n": "翁牛特旗",
                        "code": "1946"
                    }
                ]
            }, {
                "n": "鄂尔多斯市",
                "code": "96",
                "a": [
                    {
                        "n": "达拉特旗",
                        "code": "2052"
                    }, {
                        "n": "鄂尔多斯市",
                        "code": "2050"
                    }, {
                        "n": "鄂托克旗",
                        "code": "2055"
                    }, {
                        "n": "鄂托克前旗",
                        "code": "2054"
                    }, {
                        "n": "杭锦旗",
                        "code": "2056"
                    }, {
                        "n": "乌审旗",
                        "code": "2057"
                    }, {
                        "n": "伊金霍勒旗",
                        "code": "2058"
                    }, {
                        "n": "准格尔旗",
                        "code": "2053"
                    }
                ]
            }, {
                "n": "呼和浩特市",
                "code": "140",
                "a": [
                    {
                        "n": "和林格尔县",
                        "code": "1910"
                    }, {
                        "n": "呼和浩特市",
                        "code": "1910"
                    }, {
                        "n": "清水河县",
                        "code": "1910"
                    }, {
                        "n": "土左旗",
                        "code": "1910"
                    }, {
                        "n": "托克托县",
                        "code": "1910"
                    }, {
                        "n": "武川县",
                        "code": "1910"
                    }
                ]
            }, {
                "n": "呼伦贝尔市",
                "code": "141",
                "a": [
                    {
                        "n": "阿荣旗",
                        "code": "1965"
                    }, {
                        "n": "陈巴尔虎旗",
                        "code": "1974"
                    }, {
                        "n": "额尔古纳市",
                        "code": "1967"
                    }, {
                        "n": "鄂伦春族自治旗",
                        "code": "1969"
                    }, {
                        "n": "鄂温克族自治旗",
                        "code": "1971"
                    }, {
                        "n": "根河市",
                        "code": "1968"
                    }, {
                        "n": "呼伦贝尔市",
                        "code": "1960"
                    }, {
                        "n": "满州里市",
                        "code": "1962"
                    }, {
                        "n": "莫力达瓦达斡尔族自治旗",
                        "code": "1966"
                    }, {
                        "n": "新巴尔虎右旗",
                        "code": "1972"
                    }, {
                        "n": "新巴尔虎左旗",
                        "code": "1973"
                    }, {
                        "n": "牙克石市",
                        "code": "1964"
                    }, {
                        "n": "扎兰屯市",
                        "code": "1963"
                    }
                ]
            }, {
                "n": "通辽市",
                "code": "293",
                "a": [
                    {
                        "n": "霍林郭勒市",
                        "code": "1992"
                    }, {
                        "n": "开鲁县",
                        "code": "1995"
                    }, {
                        "n": "科尔沁左翼后旗",
                        "code": "1994"
                    }, {
                        "n": "科尔沁左翼中旗",
                        "code": "1993"
                    }, {
                        "n": "库伦旗",
                        "code": "1996"
                    }, {
                        "n": "奈曼旗",
                        "code": "1997"
                    }, {
                        "n": "通辽市",
                        "code": "1990"
                    }, {
                        "n": "扎鲁特旗",
                        "code": "1998"
                    }
                ]
            }, {
                "n": "乌海市",
                "code": "304",
                "a": [
                    {
                        "n": "乌海市",
                        "code": "1930"
                    }
                ]
            }, {
                "n": "乌兰察布市",
                "code": "305",
                "a": [
                    {
                        "n": "察哈尔右翼后旗",
                        "code": "2044"
                    }, {
                        "n": "察哈尔右翼前旗",
                        "code": "2042"
                    }, {
                        "n": "察哈尔右翼中旗",
                        "code": "2043"
                    }, {
                        "n": "丰镇市",
                        "code": "2039"
                    }, {
                        "n": "化德县",
                        "code": "2036"
                    }, {
                        "n": "凉城县",
                        "code": "2041"
                    }, {
                        "n": "商都县",
                        "code": "2037"
                    }, {
                        "n": "四子王旗",
                        "code": "2046"
                    }, {
                        "n": "乌兰察布市",
                        "code": "2030"
                    }, {
                        "n": "兴和县",
                        "code": "2038"
                    }, {
                        "n": "卓资县",
                        "code": "2035"
                    }
                ]
            }, {
                "n": "锡林郭勒盟",
                "code": "316",
                "a": [
                    {
                        "n": "锡林郭勒盟",
                        "code": "2010"
                    },
                    {
                        "n": "阿巴嘎旗",
                        "code": "2013"
                    }, {
                        "n": "东乌珠穆沁旗",
                        "code": "2016"
                    }, {
                        "n": "多伦县",
                        "code": "2023"
                    }, {
                        "n": "二连浩特市",
                        "code": "2011"
                    }, {
                        "n": "苏尼特右旗",
                        "code": "2015"
                    }, {
                        "n": "苏尼特左旗",
                        "code": "2014"
                    }, {
                        "n": "太仆寺旗",
                        "code": "2018"
                    }, {
                        "n": "西乌珠穆沁旗",
                        "code": "2017"
                    }, {
                        "n": "镶黄旗",
                        "code": "2019"
                    }, {
                        "n": "正蓝旗",
                        "code": "2022"
                    }, {
                        "n": "正镶白旗",
                        "code": "2021"
                    }
                ]
            }, {
                "n": "兴安盟",
                "code": "327",
                "a": [
                    {
                        "n": "阿尔山市",
                        "code": "1986"
                    }, {
                        "n": "科尔沁右翼中旗",
                        "code": "1983"
                    }, {
                        "n": "突泉县",
                        "code": "1985"
                    }, {
                        "n": "兴安盟",
                        "code": "1980"
                    }, {
                        "n": "扎赉特旗",
                        "code": "1984"
                    }
                ]
            }
        ]
    }, {
        "p" : "云南省",
        "code" : "2",
        "c" : [
            {
                "n": "保山市",
                "code": "54",
                "a": [
                    {
                        "n": "保山市",
                        "code": "7530"
                    }, {
                        "n": "昌宁县",
                        "code": "7535"
                    }, {
                        "n": "龙陵县",
                        "code": "7534"
                    }, {
                        "n": "施甸县",
                        "code": "7532"
                    }, {
                        "n": "腾冲县",
                        "code": "7533"
                    }
                ]
            }, {
                "n": "楚雄彝族自治州",
                "code": "81",
                "a": [
                    {
                        "n": "楚雄彝族自治州",
                        "code": "7381"
                    },
                    {
                        "n": "楚雄市",
                        "code": "7380"
                    }, {
                        "n": "大姚县",
                        "code": "7386"
                    }, {
                        "n": "禄丰县",
                        "code": "7391"
                    }, {
                        "n": "牟定县",
                        "code": "7383"
                    }, {
                        "n": "南华县",
                        "code": "7384"
                    }, {
                        "n": "双柏县",
                        "code": "7382"
                    }, {
                        "n": "武定县",
                        "code": "7389"
                    }, {
                        "n": "姚安县",
                        "code": "7385"
                    }, {
                        "n": "永仁县",
                        "code": "7387"
                    }, {
                        "n": "元谋县",
                        "code": "7388"
                    }
                ]
            }, {
                "n": "大理白族自治州",
                "code": "83",
                "a": [
                    {
                        "n": "大理白族自治州",
                        "code": "7511"
                    }, 
                    {
                        "n": "宾川县",
                        "code": "7514"
                    }, {
                        "n": "大理市",
                        "code": "7510"
                    }, {
                        "n": "洱源县",
                        "code": "7521"
                    }, {
                        "n": "鹤庆县",
                        "code": "7523"
                    }, {
                        "n": "剑川县",
                        "code": "7522"
                    }, {
                        "n": "弥渡县",
                        "code": "7515"
                    }, {
                        "n": "南涧县",
                        "code": "7516"
                    }, {
                        "n": "巍山县",
                        "code": "7517"
                    }, {
                        "n": "祥云县",
                        "code": "7513"
                    }, {
                        "n": "漾濞县",
                        "code": "7512"
                    }, {
                        "n": "永平县",
                        "code": "7518"
                    }, {
                        "n": "云龙县",
                        "code": "7519"
                    }
                ]
            }, {
                "n": "德宏傣族景颇族自治州",
                "code": "89",
                "a": [
                    {
                        "n": "德宏傣族景颇族自治州",
                        "code": "7541"
                    },
                    {
                        "n": "梁河县",
                        "code": "7543"
                    }, {
                        "n": "陇川县",
                        "code": "7545"
                    }, {
                        "n": "潞西市",
                        "code": "7540"
                    }, {
                        "n": "瑞丽市",
                        "code": "7546"
                    }, {
                        "n": "盈江县",
                        "code": "7544"
                    }
                ]
            }, {
                "n": "迪庆藏族自治州",
                "code": "92",
                "a": [
                    {
                        "n": "迪庆藏族自治州",
                        "code": "7571"
                    }, 
                    {
                        "n": "德钦县",
                        "code": "7572"
                    }, {
                        "n": "维西县",
                        "code": "7573"
                    }, {
                        "n": "香格里拉县",
                        "code": "7570"
                    }
                ]
            }, {
                "n": "红河哈尼族彝族自治州",
                "code": "139",
                "a": [
                    {
                        "n": "红河哈尼族彝族自治州",
                        "code": "7431"
                    }, 
                    {
                        "n": "个旧市",
                        "code": "7430"
                    }, {
                        "n": "河口县",
                        "code": "7444"
                    }, {
                        "n": "红河县",
                        "code": "7441"
                    }, {
                        "n": "建水县",
                        "code": "7435"
                    }, {
                        "n": "金平县",
                        "code": "7442"
                    }, {
                        "n": "开远市",
                        "code": "7432"
                    }, {
                        "n": "泸西县",
                        "code": "7438"
                    }, {
                        "n": "绿春县",
                        "code": "7443"
                    }, {
                        "n": "蒙自县",
                        "code": "7433"
                    }, {
                        "n": "弥勒县",
                        "code": "7437"
                    }, {
                        "n": "屏边县",
                        "code": "7434"
                    }, {
                        "n": "石屏县",
                        "code": "7436"
                    }, {
                        "n": "元阳县",
                        "code": "7439"
                    }
                ]
            }, {
                "n": "昆明市",
                "code": "179",
                "a": [
                    {
                        "n": "安宁市",
                        "code": "7310"
                    }, {
                        "n": "呈贡县",
                        "code": "7311"
                    }, {
                        "n": "富民县",
                        "code": "7312"
                    }, {
                        "n": "晋宁县",
                        "code": "7313"
                    }, {
                        "n": "昆明市",
                        "code": "7314"
                    }, {
                        "n": "禄劝县",
                        "code": "7315"
                    }, {
                        "n": "石林县",
                        "code": "7316"
                    }, {
                        "n": "嵩明县",
                        "code": "7317"
                    }, {
                        "n": "寻甸县",
                        "code": "7318"
                    }, {
                        "n": "宜良县",
                        "code": "7319"
                    }
                ]
            }, {
                "n": "丽江市",
                "code": "186",
                "a": [
                    {
                        "n": "华坪县",
                        "code": "7553"
                    }, {
                        "n": "丽江市",
                        "code": "7550"
                    }, {
                        "n": "宁蒗县",
                        "code": "7554"
                    }, {
                        "n": "永胜县",
                        "code": "7552"
                    }
                ]
            }, {
                "n": "临沧市",
                "code": "195",
                "a": [
                    {
                        "n": "沧源县",
                        "code": "7588"
                    }, {
                        "n": "凤庆县",
                        "code": "7582"
                    }, {
                        "n": "耿马县",
                        "code": "7587"
                    }, {
                        "n": "临沧市",
                        "code": "7580"
                    }, {
                        "n": "双江县",
                        "code": "7586"
                    }, {
                        "n": "永德县",
                        "code": "7584"
                    }, {
                        "n": "云县",
                        "code": "7583"
                    }, {
                        "n": "镇康县",
                        "code": "7585"
                    }
                ]
            }, {
                "n": "怒江傈僳族自治州",
                "code": "227",
                "a": [
                    {
                        "n": "怒江傈僳族自治州",
                        "code": "7561"
                    }, 
                    {
                        "n": "福贡县",
                        "code": "7562"
                    }, {
                        "n": "贡山县",
                        "code": "7563"
                    }, {
                        "n": "兰坪县",
                        "code": "7564"
                    }, {
                        "n": "泸水县",
                        "code": "7560"
                    }
                ]
            }, {
                "n": "曲靖市",
                "code": "246",
                "a": [
                    {
                        "n": "富源县",
                        "code": "7364"
                    }, {
                        "n": "会泽县",
                        "code": "7369"
                    }, {
                        "n": "陆良县",
                        "code": "7367"
                    }, {
                        "n": "罗平县",
                        "code": "7365"
                    }, {
                        "n": "马龙县",
                        "code": "7362"
                    }, {
                        "n": "曲靖市",
                        "code": "7360"
                    }, {
                        "n": "师宗县",
                        "code": "7366"
                    }, {
                        "n": "宣威市",
                        "code": "7363"
                    }, {
                        "n": "沾益县",
                        "code": "7371"
                    }
                ]
            }, {
                "n": "思茅市",
                "code": "274",
                "a": [
                    {
                        "n": "江城县",
                        "code": "7477"
                    }, {
                        "n": "景东县",
                        "code": "7474"
                    }, {
                        "n": "景谷县",
                        "code": "7475"
                    }, {
                        "n": "澜沧县",
                        "code": "7479"
                    }, {
                        "n": "孟连县",
                        "code": "7478"
                    }, {
                        "n": "墨江县",
                        "code": "7473"
                    }, {
                        "n": "普洱县",
                        "code": "7472"
                    }, {
                        "n": "思茅市",
                        "code": "7470"
                    }, {
                        "n": "西盟县",
                        "code": "7481"
                    }, {
                        "n": "镇沅县",
                        "code": "7476"
                    }
                ]
            }, {
                "n": "文山壮族苗族自治州",
                "code": "303",
                "a": [
                    {
                        "n": "文山壮族苗族自治州",
                        "code": "7451"
                    }, 
                    {
                        "n": "富宁县",
                        "code": "7458"
                    }, {
                        "n": "广南县",
                        "code": "7457"
                    }, {
                        "n": "麻栗坡县",
                        "code": "7454"
                    }, {
                        "n": "马关县",
                        "code": "7455"
                    }, {
                        "n": "邱北县",
                        "code": "7456"
                    }, {
                        "n": "文山县",
                        "code": "7450"
                    }, {
                        "n": "西畴县",
                        "code": "7453"
                    }, {
                        "n": "砚山县",
                        "code": "7452"
                    }
                ]
            }, {
                "n": "西双版纳傣族自治州",
                "code": "315",
                "a": [
                    {
                        "n": "西双版纳傣族自治州",
                        "code": "7491"
                    }, 
                    {
                        "n": "景洪市",
                        "code": "7490"
                    }, {
                        "n": "勐海县",
                        "code": "7492"
                    }, {
                        "n": "勐腊县",
                        "code": "7493"
                    }
                ]
            }, {
                "n": "玉溪市",
                "code": "353",
                "a": [
                    {
                        "n": "澄江县",
                        "code": "7413"
                    }, {
                        "n": "峨山县",
                        "code": "7417"
                    }, {
                        "n": "华宁县",
                        "code": "7415"
                    }, {
                        "n": "江川县",
                        "code": "7412"
                    }, {
                        "n": "通海县",
                        "code": "7414"
                    }, {
                        "n": "新平县",
                        "code": "7418"
                    }, {
                        "n": "易门县",
                        "code": "7416"
                    }, {
                        "n": "玉溪市",
                        "code": "7410"
                    }, {
                        "n": "元江县",
                        "code": "7419"
                    }
                ]
            }, {
                "n": "昭通市",
                "code": "364",
                "a": [
                    {
                        "n": "大关县",
                        "code": "7345"
                    }, {
                        "n": "鲁甸县",
                        "code": "7342"
                    }, {
                        "n": "巧家县",
                        "code": "7343"
                    }, {
                        "n": "水富县",
                        "code": "7352"
                    }, {
                        "n": "绥江县",
                        "code": "7347"
                    }, {
                        "n": "威信县",
                        "code": "7351"
                    }, {
                        "n": "盐津县",
                        "code": "7344"
                    }, {
                        "n": "彝良县",
                        "code": "7349"
                    }, {
                        "n": "永善县",
                        "code": "7346"
                    }, {
                        "n": "昭通市",
                        "code": "7340"
                    }, {
                        "n": "镇雄县",
                        "code": "7348"
                    }
                ]
            }
        ]
    }, {
        "p" : "河南省",
        "code" : "3",
        "c" : [
            {
                "n": "安阳市",
                "code": "41",
                "a": [
                    {
                        "n": "安阳市",
                        "code": "4960"
                    }, {
                        "n": "安阳县",
                        "code": "4962"
                    }, {
                        "n": "滑县",
                        "code": "4964"
                    }, {
                        "n": "林州市",
                        "code": "4961"
                    }, {
                        "n": "内黄县",
                        "code": "4965"
                    }, {
                        "n": "汤阴县",
                        "code": "4963"
                    }
                ]
            }, {
                "n": "鹤壁市",
                "code": "134",
                "a": [
                    {
                        "n": "鹤壁市",
                        "code": "4970"
                    }, {
                        "n": "浚县",
                        "code": "4971"
                    }, {
                        "n": "淇县",
                        "code": "4972"
                    }
                ]
            }, {
                "n": "焦作市",
                "code": "163",
                "a": [
                    {
                        "n": "博爱县",
                        "code": "5012"
                    }, {
                        "n": "焦作市",
                        "code": "5010"
                    }, {
                        "n": "孟州市",
                        "code": "5016"
                    }, {
                        "n": "沁阳市",
                        "code": "5014"
                    }, {
                        "n": "温县",
                        "code": "5015"
                    }, {
                        "n": "武陟县",
                        "code": "5013"
                    }, {
                        "n": "修武县",
                        "code": "5011"
                    }
                ]
            }, {
                "n": "开封市",
                "code": "176",
                "a": [
                    {
                        "n": "开封市",
                        "code": "4920"
                    }, {
                        "n": "开封县",
                        "code": "4924"
                    }, {
                        "n": "兰考县",
                        "code": "4925"
                    }, {
                        "n": "杞县",
                        "code": "4921"
                    }, {
                        "n": "通许县",
                        "code": "4922"
                    }, {
                        "n": "尉氏县",
                        "code": "4923"
                    }
                ]
            }, {
                "n": "洛阳市",
                "code": "207",
                "a": [
                    {
                        "n": "栾川县",
                        "code": "4934"
                    }, {
                        "n": "洛宁县",
                        "code": "4938"
                    }, {
                        "n": "洛阳市",
                        "code": "4930"
                    }, {
                        "n": "孟津县",
                        "code": "4932"
                    }, {
                        "n": "汝阳县",
                        "code": "4936"
                    }, {
                        "n": "嵩县",
                        "code": "4935"
                    }, {
                        "n": "新安县",
                        "code": "4933"
                    }, {
                        "n": "偃师市",
                        "code": "4931"
                    }, {
                        "n": "伊川县",
                        "code": "4939"
                    }, {
                        "n": "宜阳县",
                        "code": "4937"
                    }
                ]
            }, {
                "n": "漯河市",
                "code": "208",
                "a": [
                    {
                        "n": "临颍县",
                        "code": "5042"
                    }, {
                        "n": "漯河市",
                        "code": "5040"
                    }, {
                        "n": "舞阳县",
                        "code": "5041"
                    }, {
                        "n": "郾城县",
                        "code": "5043"
                    }
                ]
            }, {
                "n": "南阳市",
                "code": "224",
                "a": [
                    {
                        "n": "邓州市",
                        "code": "5132"
                    }, {
                        "n": "方城县",
                        "code": "5134"
                    }, {
                        "n": "内乡县",
                        "code": "5138"
                    }, {
                        "n": "南阳市",
                        "code": "5130"
                    }, {
                        "n": "南召县",
                        "code": "5133"
                    }, {
                        "n": "社旗县",
                        "code": "5141"
                    }, {
                        "n": "唐河县",
                        "code": "5142"
                    }, {
                        "n": "桐柏县",
                        "code": "5144"
                    }, {
                        "n": "西峡县",
                        "code": "5135"
                    }, {
                        "n": "淅川县",
                        "code": "5139"
                    }, {
                        "n": "新野县",
                        "code": "5143"
                    }, {
                        "n": "镇平县",
                        "code": "5137"
                    }
                ]
            }, {
                "n": "平顶山市",
                "code": "230",
                "a": [
                    {
                        "n": "宝丰县",
                        "code": "4951"
                    }, {
                        "n": "郏县",
                        "code": "4954"
                    }, {
                        "n": "鲁山县",
                        "code": "4953"
                    }, {
                        "n": "平顶山市",
                        "code": "4950"
                    }, {
                        "n": "汝州市",
                        "code": "4956"
                    }, {
                        "n": "舞钢市",
                        "code": "5044"
                    }, {
                        "n": "叶县",
                        "code": "4952"
                    }
                ]
            }, {
                "n": "濮阳市",
                "code": "234",
                "a": [
                    {
                        "n": "范县",
                        "code": "5023"
                    }, {
                        "n": "南乐县",
                        "code": "5022"
                    }, {
                        "n": "濮阳市",
                        "code": "5020"
                    }, {
                        "n": "濮阳县",
                        "code": "5025"
                    }, {
                        "n": "清丰县",
                        "code": "5021"
                    }, {
                        "n": "台前县",
                        "code": "5024"
                    }
                ]
            }, {
                "n": "三门峡市",
                "code": "252",
                "a": [
                    {
                        "n": "灵宝市",
                        "code": "5053"
                    }, {
                        "n": "卢氏县",
                        "code": "5054"
                    }, {
                        "n": "三门峡市",
                        "code": "5050"
                    }, {
                        "n": "陕县",
                        "code": "5052"
                    }, {
                        "n": "渑池县",
                        "code": "5051"
                    }, {
                        "n": "义马市",
                        "code": "5055"
                    }
                ]
            }, {
                "n": "商丘市",
                "code": "260",
                "a": [
                    {
                        "n": "民权县",
                        "code": "5064"
                    }, {
                        "n": "宁陵县",
                        "code": "5065"
                    }, {
                        "n": "商丘市",
                        "code": "5060"
                    }, {
                        "n": "睢县",
                        "code": "5066"
                    }, {
                        "n": "夏邑县",
                        "code": "5067"
                    }, {
                        "n": "永城市",
                        "code": "5069"
                    }, {
                        "n": "虞城县",
                        "code": "5062"
                    }, {
                        "n": "柘城县",
                        "code": "5068"
                    }
                ]
            }, {
                "n": "新乡市",
                "code": "324",
                "a": [
                    {
                        "n": "长垣县",
                        "code": "4986"
                    }, {
                        "n": "封丘县",
                        "code": "4985"
                    }, {
                        "n": "辉县市",
                        "code": "4988"
                    }, {
                        "n": "获嘉县",
                        "code": "4982"
                    }, {
                        "n": "卫辉市",
                        "code": "4987"
                    }, {
                        "n": "新乡市",
                        "code": "4980"
                    }, {
                        "n": "新乡县",
                        "code": "4981"
                    }, {
                        "n": "延津县",
                        "code": "4984"
                    }, {
                        "n": "原阳县",
                        "code": "4983"
                    }
                ]
            }, {
                "n": "信阳市",
                "code": "326",
                "a": [
                    {
                        "n": "固始县",
                        "code": "5157"
                    }, {
                        "n": "光山县",
                        "code": "5156"
                    }, {
                        "n": "淮滨县",
                        "code": "5153"
                    }, {
                        "n": "潢川县",
                        "code": "5155"
                    }, {
                        "n": "罗山县",
                        "code": "5159"
                    }, {
                        "n": "商城县",
                        "code": "5158"
                    }, {
                        "n": "息县",
                        "code": "5152"
                    }, {
                        "n": "新县",
                        "code": "5161"
                    }, {
                        "n": "信阳市",
                        "code": "5150"
                    }
                ]
            }, {
                "n": "许昌市",
                "code": "330",
                "a": [
                    {
                        "n": "长葛市",
                        "code": "5031"
                    }, {
                        "n": "襄城县",
                        "code": "4955"
                    }, {
                        "n": "许昌市",
                        "code": "5030"
                    }, {
                        "n": "许昌县",
                        "code": "5032"
                    }, {
                        "n": "鄢陵县",
                        "code": "5033"
                    }, {
                        "n": "禹州市",
                        "code": "5034"
                    }
                ]
            }, {
                "n": "郑州市",
                "code": "367",
                "a": [
                    {
                        "n": "登封市",
                        "code": "4910"
                    }, {
                        "n": "巩义市",
                        "code": "4910"
                    }, {
                        "n": "济源市",
                        "code": "4910"
                    }, {
                        "n": "新密市",
                        "code": "4910"
                    }, {
                        "n": "新郑市",
                        "code": "4910"
                    }, {
                        "n": "荥阳市",
                        "code": "4910"
                    }, {
                        "n": "郑州市",
                        "code": "4910"
                    }, {
                        "n": "中牟县",
                        "code": "4910"
                    }
                ]
            }, {
                "n": "周口市",
                "code": "372",
                "a": [
                    {
                        "n": "郸城县",
                        "code": "5087"
                    }, {
                        "n": "扶沟县",
                        "code": "5082"
                    }, {
                        "n": "淮阳县",
                        "code": "5088"
                    }, {
                        "n": "鹿邑县",
                        "code": "5086"
                    }, {
                        "n": "商水县",
                        "code": "5084"
                    }, {
                        "n": "沈丘县",
                        "code": "5089"
                    }, {
                        "n": "太康县",
                        "code": "5085"
                    }, {
                        "n": "西华县",
                        "code": "5083"
                    }, {
                        "n": "项城市",
                        "code": "5091"
                    }, {
                        "n": "周口市",
                        "code": "5080"
                    }
                ]
            }, {
                "n": "驻马店市",
                "code": "375",
                "a": [
                    {
                        "n": "泌阳县",
                        "code": "5113"
                    }, {
                        "n": "平舆县",
                        "code": "5118"
                    }, {
                        "n": "确山县",
                        "code": "5112"
                    }, {
                        "n": "汝南县",
                        "code": "5117"
                    }, {
                        "n": "上蔡县",
                        "code": "5116"
                    }, {
                        "n": "遂平县",
                        "code": "5114"
                    }, {
                        "n": "西平县",
                        "code": "5115"
                    }, {
                        "n": "新蔡县",
                        "code": "5119"
                    }, {
                        "n": "正阳县",
                        "code": "5121"
                    }, {
                        "n": "驻马店市",
                        "code": "5110"
                    }
                ]
            }
        ]
    }, {
        "p" : "贵州省",
        "code" : "4",
        "c" : [
            {
                "n": "安顺市",
                "code": "40",
                "a": [
                    {
                        "n": "安顺市",
                        "code": "7110"
                    }, {
                        "n": "关岭县",
                        "code": "7119"
                    }, {
                        "n": "平坝县",
                        "code": "7117"
                    }, {
                        "n": "普定县",
                        "code": "7118"
                    }, {
                        "n": "镇宁县",
                        "code": "7121"
                    }, {
                        "n": "紫云县",
                        "code": "7122"
                    }
                ]
            }, {
                "n": "毕节市",
                "code": "58",
                "a": [
                    {
                        "n": "毕节市",
                        "code": "7090"
                    }, {
                        "n": "大方县",
                        "code": "7092"
                    }, {
                        "n": "赫章县",
                        "code": "7098"
                    }, {
                        "n": "金沙县",
                        "code": "7094"
                    }, {
                        "n": "纳雍县",
                        "code": "7096"
                    }, {
                        "n": "黔西县",
                        "code": "7093"
                    }, {
                        "n": "威宁县",
                        "code": "7097"
                    }, {
                        "n": "织金县",
                        "code": "7095"
                    }
                ]
            }, {
                "n": "贵阳市",
                "code": "115",
                "a": [
                    {
                        "n": "贵阳市",
                        "code": "7010"
                    }, {
                        "n": "开阳县",
                        "code": "7010"
                    }, {
                        "n": "清镇市",
                        "code": "7010"
                    }, {
                        "n": "息烽县",
                        "code": "7010"
                    }, {
                        "n": "修文县",
                        "code": "7010"
                    }
                ]
            }, {
                "n": "六盘水市",
                "code": "201",
                "a": [
                    {
                        "n": "六盘水市",
                        "code": "7020"
                    }, {
                        "n": "六枝特区",
                        "code": "7021"
                    }, {
                        "n": "盘县",
                        "code": "7022"
                    }
                ]
            }, {
                "n": "黔东南苗族侗族自治州",
                "code": "237",
                "a": [
                    {
                        "n": "黔东南苗族侗族自治州",
                        "code": "7131"
                    }, 
                    {
                        "n": "岑巩县",
                        "code": "7136"
                    }, {
                        "n": "从江县",
                        "code": "7144"
                    }, {
                        "n": "丹寨县",
                        "code": "7147"
                    }, {
                        "n": "黄平县",
                        "code": "7132"
                    }, {
                        "n": "剑河县",
                        "code": "7139"
                    }, {
                        "n": "锦屏县",
                        "code": "7138"
                    }, {
                        "n": "凯里市",
                        "code": "7130"
                    }, {
                        "n": "雷山县",
                        "code": "7145"
                    }, {
                        "n": "黎平县",
                        "code": "7142"
                    }, {
                        "n": "麻江县",
                        "code": "7146"
                    }, {
                        "n": "榕江县",
                        "code": "7143"
                    }, {
                        "n": "三穗县",
                        "code": "7134"
                    }, {
                        "n": "施秉县",
                        "code": "7133"
                    }, {
                        "n": "台江县",
                        "code": "7141"
                    }, {
                        "n": "天柱县",
                        "code": "7137"
                    }, {
                        "n": "镇远县",
                        "code": "7135"
                    }
                ]
            }, {
                "n": "黔南布依族苗族自治州",
                "code": "239",
                "a": [
                    {
                        "n": "黔南布依族苗族自治州",
                        "code": "7151"
                    }, 
                    {
                        "n": "长顺县",
                        "code": "7159"
                    }, {
                        "n": "都匀市",
                        "code": "7150"
                    }, {
                        "n": "独山县",
                        "code": "7156"
                    }, {
                        "n": "福泉市",
                        "code": "7154"
                    }, {
                        "n": "贵定县",
                        "code": "7153"
                    }, {
                        "n": "惠水县",
                        "code": "7162"
                    }, {
                        "n": "荔波县",
                        "code": "7152"
                    }, {
                        "n": "龙里县",
                        "code": "7161"
                    }, {
                        "n": "罗甸县",
                        "code": "7158"
                    }, {
                        "n": "平塘县",
                        "code": "7157"
                    }, {
                        "n": "三都县",
                        "code": "7163"
                    }, {
                        "n": "瓮安县",
                        "code": "7155"
                    }
                ]
            }, {
                "n": "黔西南布依族苗族自治州",
                "code": "240",
                "a": [
                    {
                        "n": "黔西南布依族苗族自治州",
                        "code": "7071"
                    }, 
                    {
                        "n": "安龙县",
                        "code": "7078"
                    }, {
                        "n": "册亨县",
                        "code": "7077"
                    }, {
                        "n": "普安县",
                        "code": "7073"
                    }, {
                        "n": "晴隆县",
                        "code": "7074"
                    }, {
                        "n": "望漠县",
                        "code": "7076"
                    }, {
                        "n": "兴仁县",
                        "code": "7072"
                    }, {
                        "n": "兴义市",
                        "code": "7070"
                    }, {
                        "n": "贞丰县",
                        "code": "7075"
                    }
                ]
            }, {
                "n": "铜仁市",
                "code": "296",
                "a": [
                    {
                        "n": "德江县",
                        "code": "7057"
                    }, {
                        "n": "江口县",
                        "code": "7052"
                    }, {
                        "n": "石阡县",
                        "code": "7054"
                    }, {
                        "n": "思南县",
                        "code": "7055"
                    }, {
                        "n": "松桃县",
                        "code": "7059"
                    }, {
                        "n": "铜仁市",
                        "code": "7050"
                    }, {
                        "n": "万山特区",
                        "code": "7061"
                    }, {
                        "n": "沿河县",
                        "code": "7058"
                    }, {
                        "n": "印江县",
                        "code": "7056"
                    }, {
                        "n": "玉屏县",
                        "code": "7053"
                    }
                ]
            }, {
                "n": "遵义市",
                "code": "379",
                "a": [
                    {
                        "n": "赤水市",
                        "code": "7043"
                    }, {
                        "n": "道真县",
                        "code": "7036"
                    }, {
                        "n": "凤冈县",
                        "code": "7038"
                    }, {
                        "n": "湄潭县",
                        "code": "7039"
                    }, {
                        "n": "仁怀市",
                        "code": "7042"
                    }, {
                        "n": "绥阳县",
                        "code": "7034"
                    }, {
                        "n": "桐梓县",
                        "code": "7033"
                    }, {
                        "n": "务川县",
                        "code": "7037"
                    }, {
                        "n": "习水县",
                        "code": "7044"
                    }, {
                        "n": "余庆县",
                        "code": "7041"
                    }, {
                        "n": "正安县",
                        "code": "7035"
                    }, {
                        "n": "遵义市",
                        "code": "7030"
                    }, {
                        "n": "遵义县",
                        "code": "7032"
                    }
                ]
            }
        ]
    }, {
        "p" : "海南省",
        "code" : "5",
        "c" : [
            {
                "n": "海口市",
                "code": "122",
                "a": [
                    {
                        "n": "白沙黎族自治县",
                        "code": "6410"
                    }, {
                        "n": "保亭黎族苗族自治县",
                        "code": "6410"
                    }, {
                        "n": "昌江黎族自治县",
                        "code": "6410"
                    }, {
                        "n": "澄迈县",
                        "code": "6410"
                    }, {
                        "n": "儋州市",
                        "code": "6410"
                    }, {
                        "n": "定安县",
                        "code": "6410"
                    }, {
                        "n": "东方市",
                        "code": "6410"
                    }, {
                        "n": "海口市",
                        "code": "6410"
                    }, {
                        "n": "乐东黎族自治县",
                        "code": "6410"
                    }, {
                        "n": "临高县",
                        "code": "6410"
                    }, {
                        "n": "陵水黎族自治县",
                        "code": "6410"
                    }, {
                        "n": "琼海市",
                        "code": "6410"
                    }, {
                        "n": "琼山市",
                        "code": "6410"
                    }, {
                        "n": "琼中黎族苗族自治县",
                        "code": "6410"
                    }, {
                        "n": "屯昌县",
                        "code": "6410"
                    }, {
                        "n": "万宁市",
                        "code": "6410"
                    }, {
                        "n": "文昌市",
                        "code": "6410"
                    }, {
                        "n": "五指山市",
                        "code": "6410"
                    }
                ]
            }, {
                "n": "三亚市",
                "code": "254",
                "a": [
                    {
                        "n": "三亚市",
                        "code": "6420"
                    }
                ]
            }
        ]
    }, {
        "p" : "广西",
        "code" : "6",
        "c" : [
            {
                "n": "百色市",
                "code": "49",
                "a": [
                    {
                        "n": "百色市",
                        "code": "6261"
                    }, {
                        "n": "德保县",
                        "code": "6275"
                    }, {
                        "n": "靖西县",
                        "code": "6266"
                    }, {
                        "n": "乐业县",
                        "code": "6269"
                    }, {
                        "n": "凌云县",
                        "code": "6268"
                    }, {
                        "n": "隆林县",
                        "code": "6272"
                    }, {
                        "n": "那坡县",
                        "code": "6267"
                    }, {
                        "n": "平果县",
                        "code": "6264"
                    }, {
                        "n": "田东县",
                        "code": "6263"
                    }, {
                        "n": "田林县",
                        "code": "6271"
                    }, {
                        "n": "田阳县",
                        "code": "6262"
                    }, {
                        "n": "西林县",
                        "code": "6273"
                    }
                ]
            }, {
                "n": "北海市",
                "code": "55",
                "a": [
                    {
                        "n": "北海市",
                        "code": "6230"
                    }, {
                        "n": "合浦县",
                        "code": "6231"
                    }
                ]
            }, {
                "n": "崇左市",
                "code": "79",
                "a": [
                    {
                        "n": "崇左市",
                        "code": "6128"
                    }, {
                        "n": "大新县",
                        "code": "6129"
                    }, {
                        "n": "扶绥县",
                        "code": "6127"
                    }, {
                        "n": "龙州县",
                        "code": "6133"
                    }, {
                        "n": "宁明县",
                        "code": "6132"
                    }, {
                        "n": "凭祥市",
                        "code": "6121"
                    }, {
                        "n": "天等县",
                        "code": "6131"
                    }
                ]
            }, {
                "n": "防城港市",
                "code": "99",
                "a": [
                    {
                        "n": "东兴市",
                        "code": "6331"
                    }, {
                        "n": "防城港市",
                        "code": "6330"
                    }, {
                        "n": "上思县",
                        "code": "6312"
                    }
                ]
            }, {
                "n": "贵港市",
                "code": "114",
                "a": [
                    {
                        "n": "贵港市",
                        "code": "6242"
                    }, {
                        "n": "桂平市",
                        "code": "6243"
                    }, {
                        "n": "平南县",
                        "code": "6244"
                    }
                ]
            }, {
                "n": "桂林市",
                "code": "116",
                "a": [
                    {
                        "n": "恭城县",
                        "code": "6191"
                    }, {
                        "n": "灌阳县",
                        "code": "6185"
                    }, {
                        "n": "桂林市",
                        "code": "6170"
                    }, {
                        "n": "荔浦县",
                        "code": "6189"
                    }, {
                        "n": "临桂县",
                        "code": "6172"
                    }, {
                        "n": "灵川县",
                        "code": "6181"
                    }, {
                        "n": "龙胜县",
                        "code": "6186"
                    }, {
                        "n": "平乐县",
                        "code": "6188"
                    }, {
                        "n": "全州县",
                        "code": "6182"
                    }, {
                        "n": "兴安县",
                        "code": "6183"
                    }, {
                        "n": "阳朔县",
                        "code": "6171"
                    }, {
                        "n": "永福县",
                        "code": "6184"
                    }, {
                        "n": "资源县",
                        "code": "6187"
                    }
                ]
            }, {
                "n": "河池市",
                "code": "130",
                "a": [
                    {
                        "n": "巴马县",
                        "code": "6289"
                    }, {
                        "n": "大化县",
                        "code": "6292"
                    }, {
                        "n": "东兰县",
                        "code": "6288"
                    }, {
                        "n": "都安县",
                        "code": "6291"
                    }, {
                        "n": "凤山县",
                        "code": "6287"
                    }, {
                        "n": "河池市",
                        "code": "6281"
                    }, {
                        "n": "环江县",
                        "code": "6284"
                    }, {
                        "n": "罗城县",
                        "code": "6283"
                    }, {
                        "n": "南丹县",
                        "code": "6285"
                    }, {
                        "n": "天峨县",
                        "code": "6286"
                    }, {
                        "n": "宜州市",
                        "code": "6282"
                    }
                ]
            }, {
                "n": "贺州市",
                "code": "133",
                "a": [
                    {
                        "n": "富川县",
                        "code": "6227"
                    }, {
                        "n": "贺州市",
                        "code": "6225"
                    }, {
                        "n": "昭平县",
                        "code": "6223"
                    }, {
                        "n": "钟山县",
                        "code": "6226"
                    }
                ]
            }, {
                "n": "来宾市",
                "code": "181",
                "a": [
                    {
                        "n": "合山市",
                        "code": "6151"
                    }, {
                        "n": "金秀县",
                        "code": "6159"
                    }, {
                        "n": "来宾市",
                        "code": "6155"
                    }, {
                        "n": "武宣县",
                        "code": "6154"
                    }, {
                        "n": "象州县",
                        "code": "6153"
                    }, {
                        "n": "忻城县",
                        "code": "6161"
                    }
                ]
            }, {
                "n": "柳州市",
                "code": "199",
                "a": [
                    {
                        "n": "柳城县",
                        "code": "6142"
                    }, {
                        "n": "柳江县",
                        "code": "6141"
                    }, {
                        "n": "柳州市",
                        "code": "6140"
                    }, {
                        "n": "鹿寨县",
                        "code": "6152"
                    }, {
                        "n": "融安县",
                        "code": "6156"
                    }, {
                        "n": "融水县",
                        "code": "6158"
                    }, {
                        "n": "三江县",
                        "code": "6157"
                    }
                ]
            }, {
                "n": "南宁市",
                "code": "221",
                "a": [
                    {
                        "n": "宾阳县",
                        "code": "6110"
                    }, {
                        "n": "横县",
                        "code": "6110"
                    }, {
                        "n": "隆安县",
                        "code": "6110"
                    }, {
                        "n": "马山县",
                        "code": "6110"
                    }, {
                        "n": "南宁市",
                        "code": "6110"
                    }, {
                        "n": "上林县",
                        "code": "6110"
                    }, {
                        "n": "武鸣县",
                        "code": "6110"
                    }
                ]
            }, {
                "n": "钦州市",
                "code": "241",
                "a": [
                    {
                        "n": "灵山县",
                        "code": "6314"
                    }, {
                        "n": "浦北县",
                        "code": "6315"
                    }, {
                        "n": "钦州市",
                        "code": "6311"
                    }
                ]
            }, {
                "n": "梧州市",
                "code": "310",
                "a": [
                    {
                        "n": "苍梧县",
                        "code": "6211"
                    }, {
                        "n": "岑溪市",
                        "code": "6221"
                    }, {
                        "n": "蒙山县",
                        "code": "6224"
                    }, {
                        "n": "藤县",
                        "code": "6222"
                    }, {
                        "n": "梧州市",
                        "code": "6210"
                    }
                ]
            }, {
                "n": "玉林市",
                "code": "351",
                "a": [
                    {
                        "n": "北流市",
                        "code": "6246"
                    }, {
                        "n": "博白县",
                        "code": "6248"
                    }, {
                        "n": "陆川县",
                        "code": "6247"
                    }, {
                        "n": "容县",
                        "code": "6245"
                    }, {
                        "n": "兴业县",
                        "code": "6249"
                    }, {
                        "n": "玉林市",
                        "code": "6240"
                    }
                ]
            }
        ]
    }, {
        "p" : "黑龙江省",
        "code" : "7",
        "c" : [
            {
                "n": "大庆市",
                "code": "85",
                "a": [
                    {
                        "n": "大庆市",
                        "code": "2650"
                    }, {
                        "n": "杜蒙县",
                        "code": "2646"
                    }, {
                        "n": "林甸县",
                        "code": "2648"
                    }, {
                        "n": "肇源县",
                        "code": "2768"
                    }, {
                        "n": "肇州县",
                        "code": "2769"
                    }
                ]
            }, {
                "n": "大兴安岭地区",
                "code": "87",
                "a": [
                    {
                        "n": "大兴安岭地区",
                        "code": "2790"
                    }, {
                        "n": "呼玛县",
                        "code": "2791"
                    }, {
                        "n": "漠河县",
                        "code": "2793"
                    }, {
                        "n": "塔河县",
                        "code": "2792"
                    }
                ]
            }, {
                "n": "哈尔滨市",
                "code": "118",
                "a": [
                    {
                        "n": "阿城市",
                        "code": "2610"
                    }, {
                        "n": "巴彦县",
                        "code": "2610"
                    }, {
                        "n": "宾县",
                        "code": "2610"
                    }, {
                        "n": "方正县",
                        "code": "2610"
                    }, {
                        "n": "哈尔滨市",
                        "code": "2610"
                    }, {
                        "n": "呼兰县",
                        "code": "2610"
                    }, {
                        "n": "木兰县",
                        "code": "2610"
                    }, {
                        "n": "尚志市",
                        "code": "2610"
                    }, {
                        "n": "双城市",
                        "code": "2610"
                    }, {
                        "n": "通河县",
                        "code": "2610"
                    }, {
                        "n": "五常市",
                        "code": "2610"
                    }, {
                        "n": "延寿县",
                        "code": "2610"
                    }, {
                        "n": "依兰县",
                        "code": "2610"
                    }
                ]
            }, {
                "n": "鹤岗市",
                "code": "135",
                "a": [
                    {
                        "n": "鹤岗市",
                        "code": "2670"
                    }, {
                        "n": "萝北县",
                        "code": "2671"
                    }, {
                        "n": "绥滨县",
                        "code": "2672"
                    }
                ]
            }, {
                "n": "黑河市",
                "code": "136",
                "a": [
                    {
                        "n": "北安市",
                        "code": "2782"
                    }, {
                        "n": "黑河市",
                        "code": "2780"
                    }, {
                        "n": "嫩江县",
                        "code": "2784"
                    }, {
                        "n": "孙吴县",
                        "code": "2787"
                    }, {
                        "n": "五大连池市",
                        "code": "2783"
                    }, {
                        "n": "逊克县",
                        "code": "2786"
                    }
                ]
            }, {
                "n": "鸡西市",
                "code": "153",
                "a": [
                    {
                        "n": "虎林市",
                        "code": "2756"
                    }, {
                        "n": "鸡东县",
                        "code": "2661"
                    }, {
                        "n": "鸡西市",
                        "code": "2660"
                    }, {
                        "n": "密山市",
                        "code": "2758"
                    }
                ]
            }, {
                "n": "佳木斯市",
                "code": "159",
                "a": [
                    {
                        "n": "抚远县",
                        "code": "2727"
                    }, {
                        "n": "富锦市",
                        "code": "2731"
                    }, {
                        "n": "桦川县",
                        "code": "2723"
                    }, {
                        "n": "桦南县",
                        "code": "2721"
                    }, {
                        "n": "佳木斯市",
                        "code": "2690"
                    }, {
                        "n": "汤原县",
                        "code": "2725"
                    }, {
                        "n": "同江市",
                        "code": "2729"
                    }
                ]
            }, {
                "n": "牡丹江市",
                "code": "214",
                "a": [
                    {
                        "n": "东宁县",
                        "code": "2754"
                    }, {
                        "n": "海林市",
                        "code": "2752"
                    }, {
                        "n": "林口县",
                        "code": "2755"
                    }, {
                        "n": "牡丹江市",
                        "code": "2720"
                    }, {
                        "n": "穆棱市",
                        "code": "2753"
                    }, {
                        "n": "宁安市",
                        "code": "2751"
                    }, {
                        "n": "绥芬河市",
                        "code": "2757"
                    }
                ]
            }, {
                "n": "七台河市",
                "code": "235",
                "a": [
                    {
                        "n": "勃利县",
                        "code": "2741"
                    }, {
                        "n": "七台河市",
                        "code": "2740"
                    }
                ]
            }, {
                "n": "齐齐哈尔市",
                "code": "236",
                "a": [
                    {
                        "n": "拜泉县",
                        "code": "2652"
                    }, {
                        "n": "富裕县",
                        "code": "2647"
                    }, {
                        "n": "甘南县",
                        "code": "2645"
                    }, {
                        "n": "克东县",
                        "code": "2651"
                    }, {
                        "n": "克山县",
                        "code": "2649"
                    }, {
                        "n": "龙江县",
                        "code": "2641"
                    }, {
                        "n": "讷河市",
                        "code": "2642"
                    }, {
                        "n": "齐齐哈尔市",
                        "code": "2640"
                    }, {
                        "n": "泰来县",
                        "code": "2644"
                    }, {
                        "n": "依安县",
                        "code": "2643"
                    }
                ]
            }, {
                "n": "双鸭山市",
                "code": "272",
                "a": [
                    {
                        "n": "宝清县",
                        "code": "2724"
                    }, {
                        "n": "集贤县",
                        "code": "2681"
                    }, {
                        "n": "饶河县",
                        "code": "2726"
                    }, {
                        "n": "双鸭山市",
                        "code": "2680"
                    }, {
                        "n": "友谊县",
                        "code": "2728"
                    }
                ]
            }, {
                "n": "绥化市",
                "code": "280",
                "a": [
                    {
                        "n": "安达市",
                        "code": "2762"
                    }, {
                        "n": "海伦市",
                        "code": "2764"
                    }, {
                        "n": "兰西县",
                        "code": "2766"
                    }, {
                        "n": "明水县",
                        "code": "2772"
                    }, {
                        "n": "青冈县",
                        "code": "2767"
                    }, {
                        "n": "庆安县",
                        "code": "2771"
                    }, {
                        "n": "绥化市",
                        "code": "2760"
                    }, {
                        "n": "绥棱县",
                        "code": "2773"
                    }, {
                        "n": "望奎县",
                        "code": "2765"
                    }, {
                        "n": "肇东市",
                        "code": "2763"
                    }
                ]
            }, {
                "n": "伊春市",
                "code": "340",
                "a": [
                    {
                        "n": "嘉荫县",
                        "code": "2711"
                    }, {
                        "n": "铁力市",
                        "code": "2712"
                    }, {
                        "n": "伊春市",
                        "code": "2710"
                    }
                ]
            }
        ]
    }, {
        "p" : "江西省",
        "code" : "8",
        "c" : [
            {
                "n": "抚州市",
                "code": "104",
                "a": [
                    {
                        "n": "崇仁县",
                        "code": "4375"
                    }, {
                        "n": "东乡县",
                        "code": "4381"
                    }, {
                        "n": "抚州市",
                        "code": "4370"
                    }, {
                        "n": "广昌县",
                        "code": "4382"
                    }, {
                        "n": "金溪县",
                        "code": "4378"
                    }, {
                        "n": "乐安县",
                        "code": "4376"
                    }, {
                        "n": "黎川县",
                        "code": "4373"
                    }, {
                        "n": "南城县",
                        "code": "4372"
                    }, {
                        "n": "南丰县",
                        "code": "4374"
                    }, {
                        "n": "宜黄县",
                        "code": "4377"
                    }, {
                        "n": "资溪县",
                        "code": "4379"
                    }
                ]
            }, {
                "n": "赣州市",
                "code": "109",
                "a": [
                    {
                        "n": "安远县",
                        "code": "4288"
                    }, {
                        "n": "崇义县",
                        "code": "4287"
                    }, {
                        "n": "大余县",
                        "code": "4285"
                    }, {
                        "n": "定南县",
                        "code": "4291"
                    }, {
                        "n": "赣县",
                        "code": "4282"
                    }, {
                        "n": "赣州市",
                        "code": "4280"
                    }, {
                        "n": "会昌县",
                        "code": "4297"
                    }, {
                        "n": "龙南县",
                        "code": "4289"
                    }, {
                        "n": "南康市",
                        "code": "4283"
                    }, {
                        "n": "宁都县",
                        "code": "4293"
                    }, {
                        "n": "全南县",
                        "code": "4292"
                    }, {
                        "n": "瑞金市",
                        "code": "4296"
                    }, {
                        "n": "上犹县",
                        "code": "4286"
                    }, {
                        "n": "石城县",
                        "code": "4299"
                    }, {
                        "n": "信丰县",
                        "code": "4284"
                    }, {
                        "n": "兴国县",
                        "code": "4295"
                    }, {
                        "n": "寻乌县",
                        "code": "4298"
                    }, {
                        "n": "于都县",
                        "code": "4294"
                    }
                ]
            }, {
                "n": "吉安市",
                "code": "154",
                "a": [
                    {
                        "n": "安福县",
                        "code": "4362"
                    }, {
                        "n": "吉安市",
                        "code": "4350"
                    }, {
                        "n": "吉安县",
                        "code": "4353"
                    }, {
                        "n": "吉水县",
                        "code": "4354"
                    }, {
                        "n": "井冈山市",
                        "code": "4352"
                    }, {
                        "n": "遂川县",
                        "code": "4359"
                    }, {
                        "n": "泰和县",
                        "code": "4358"
                    }, {
                        "n": "万安县",
                        "code": "4361"
                    }, {
                        "n": "峡江县",
                        "code": "4355"
                    }, {
                        "n": "新干县",
                        "code": "4356"
                    }, {
                        "n": "永丰县",
                        "code": "4357"
                    }, {
                        "n": "永新县",
                        "code": "4363"
                    }
                ]
            }, {
                "n": "景德镇市",
                "code": "172",
                "a": [
                    {
                        "n": "浮梁县",
                        "code": "4222"
                    }, {
                        "n": "景德镇市",
                        "code": "4220"
                    }, {
                        "n": "乐平市",
                        "code": "4221"
                    }
                ]
            }, {
                "n": "九江市",
                "code": "173",
                "a": [
                    {
                        "n": "德安县",
                        "code": "4246"
                    }, {
                        "n": "都昌县",
                        "code": "4248"
                    }, {
                        "n": "湖口县",
                        "code": "4249"
                    }, {
                        "n": "九江市",
                        "code": "4240"
                    }, {
                        "n": "九江县",
                        "code": "4241"
                    }, {
                        "n": "庐山",
                        "code": "4240"
                    }, {
                        "n": "彭泽县",
                        "code": "4251"
                    }, {
                        "n": "瑞昌市",
                        "code": "4242"
                    }, {
                        "n": "武宁县",
                        "code": "4243"
                    }, {
                        "n": "星子县",
                        "code": "4247"
                    }, {
                        "n": "修水县",
                        "code": "4244"
                    }, {
                        "n": "永修县",
                        "code": "4245"
                    }
                ]
            }, {
                "n": "南昌市",
                "code": "218",
                "a": [
                    {
                        "n": "安义县",
                        "code": "4210"
                    }, {
                        "n": "进贤县",
                        "code": "4210"
                    }, {
                        "n": "南昌市",
                        "code": "4210"
                    }, {
                        "n": "南昌县",
                        "code": "4210"
                    }, {
                        "n": "湾里",
                        "code": "4210"
                    }, {
                        "n": "新建县",
                        "code": "4210"
                    }
                ]
            }, {
                "n": "萍乡市",
                "code": "232",
                "a": [
                    {
                        "n": "莲花县",
                        "code": "4364"
                    }, {
                        "n": "芦溪县",
                        "code": "4232"
                    }, {
                        "n": "萍乡市",
                        "code": "4230"
                    }, {
                        "n": "上栗县",
                        "code": "4231"
                    }
                ]
            }, {
                "n": "上饶市",
                "code": "262",
                "a": [
                    {
                        "n": "德兴市",
                        "code": "4342"
                    }, {
                        "n": "广丰县",
                        "code": "4333"
                    }, {
                        "n": "横峰县",
                        "code": "4336"
                    }, {
                        "n": "鄱阳县",
                        "code": "4339"
                    }, {
                        "n": "铅山县",
                        "code": "4335"
                    }, {
                        "n": "上饶市",
                        "code": "4330"
                    }, {
                        "n": "上饶县",
                        "code": "4332"
                    }, {
                        "n": "万年县",
                        "code": "4341"
                    }, {
                        "n": "婺源县",
                        "code": "4343"
                    }, {
                        "n": "弋阳县",
                        "code": "4337"
                    }, {
                        "n": "余干县",
                        "code": "4338"
                    }, {
                        "n": "玉山县",
                        "code": "4334"
                    }
                ]
            }, {
                "n": "新余市",
                "code": "325",
                "a": [
                    {
                        "n": "分宜县",
                        "code": "4261"
                    }, {
                        "n": "新余市",
                        "code": "4260"
                    }
                ]
            }, {
                "n": "宜春市",
                "code": "344",
                "a": [
                    {
                        "n": "丰城市",
                        "code": "4312"
                    }, {
                        "n": "奉新县",
                        "code": "4315"
                    }, {
                        "n": "高安市",
                        "code": "4314"
                    }, {
                        "n": "靖安县",
                        "code": "4319"
                    }, {
                        "n": "上高县",
                        "code": "4317"
                    }, {
                        "n": "铜鼓县",
                        "code": "4321"
                    }, {
                        "n": "万载县",
                        "code": "4316"
                    }, {
                        "n": "宜春市",
                        "code": "4310"
                    }, {
                        "n": "宜丰县",
                        "code": "4318"
                    }, {
                        "n": "樟树市",
                        "code": "4313"
                    }
                ]
            }, {
                "n": "鹰谭市",
                "code": "347",
                "a": [
                    {
                        "n": "贵溪市",
                        "code": "4271"
                    }, {
                        "n": "鹰潭市",
                        "code": "4270"
                    }, {
                        "n": "余江县",
                        "code": "4272"
                    }
                ]
            }
        ]
    }, {
        "p" : "西藏",
        "code" : "9",
        "c" : [
            {
                "n": "阿里地区",
                "code": "36",
                "a": [
                    {
                        "n": "措勤县",
                        "code": "7816"
                    }, {
                        "n": "改则县",
                        "code": "7815"
                    }, {
                        "n": "革吉县",
                        "code": "7814"
                    }, {
                        "n": "普兰县",
                        "code": "7811"
                    }, {
                        "n": "日土县",
                        "code": "7813"
                    }, {
                        "n": "札达县",
                        "code": "7812"
                    }
                ]
            }, {
                "n": "阿里地区(地区所在地)",
                "code": "37",
                "a": [
                    {
                        "n": "噶尔县",
                        "code": "7810"
                    }
                ]
            }, {
                "n": "昌都地区",
                "code": "63",
                "a": [
                    {
                        "n": "八宿县",
                        "code": "7726"
                    }, {
                        "n": "边坝县",
                        "code": "7730"
                    }, {
                        "n": "察雅县",
                        "code": "7725"
                    }, {
                        "n": "丁青县",
                        "code": "7724"
                    }, {
                        "n": "贡觉县",
                        "code": "7722"
                    }, {
                        "n": "江达县",
                        "code": "7721"
                    }, {
                        "n": "类乌齐县",
                        "code": "7723"
                    }, {
                        "n": "洛隆县",
                        "code": "7729"
                    }, {
                        "n": "芒康县",
                        "code": "7728"
                    }, {
                        "n": "左贡县",
                        "code": "7727"
                    }
                ]
            }, {
                "n": "昌都地区(地区所在地)",
                "code": "64",
                "a": [
                    {
                        "n": "昌都县",
                        "code": "7720"
                    }
                ]
            }, {
                "n": "拉萨市",
                "code": "180",
                "a": [
                    {
                        "n": "达孜县",
                        "code": "7700"
                    }, {
                        "n": "当雄县",
                        "code": "7700"
                    }, {
                        "n": "堆龙德庆县",
                        "code": "7700"
                    }, {
                        "n": "拉萨市",
                        "code": "7700"
                    }, {
                        "n": "林周县",
                        "code": "7700"
                    }, {
                        "n": "墨竹工卡县",
                        "code": "7700"
                    }, {
                        "n": "尼木县",
                        "code": "7700"
                    }, {
                        "n": "曲水县",
                        "code": "7700"
                    }
                ]
            }, {
                "n": "林芝地区",
                "code": "193",
                "a": [
                    {
                        "n": "波密县",
                        "code": "7834"
                    }, {
                        "n": "察隅县",
                        "code": "7835"
                    }, {
                        "n": "工布江达县",
                        "code": "7831"
                    }, {
                        "n": "朗县",
                        "code": "7836"
                    }, {
                        "n": "米林县",
                        "code": "7832"
                    }, {
                        "n": "墨脱县",
                        "code": "7833"
                    }
                ]
            }, {
                "n": "林芝地区(地区所在地)",
                "code": "194",
                "a": [
                    {
                        "n": "林芝县",
                        "code": "7830"
                    }
                ]
            }, {
                "n": "那曲地区",
                "code": "216",
                "a": [
                    {
                        "n": "安多县",
                        "code": "7794"
                    }, {
                        "n": "巴青县",
                        "code": "7798"
                    }, {
                        "n": "班戈县",
                        "code": "7797"
                    }, {
                        "n": "比如县",
                        "code": "7792"
                    }, {
                        "n": "嘉黎县",
                        "code": "7791"
                    }, {
                        "n": "尼玛县",
                        "code": "7799"
                    }, {
                        "n": "聂荣县",
                        "code": "7793"
                    }, {
                        "n": "申扎县",
                        "code": "7795"
                    }, {
                        "n": "双湖特别行政区",
                        "code": "7800"
                    }, {
                        "n": "索县",
                        "code": "7796"
                    }
                ]
            }, {
                "n": "那曲地区（地区所在地）",
                "code": "217",
                "a": [
                    {
                        "n": "那曲县",
                        "code": "7790"
                    }
                ]
            }, {
                "n": "日喀则地区",
                "code": "249",
                "a": [
                    {
                        "n": "昂仁县",
                        "code": "7766"
                    }, {
                        "n": "白朗县",
                        "code": "7768"
                    }, {
                        "n": "定结县",
                        "code": "7771"
                    }, {
                        "n": "定日县",
                        "code": "7763"
                    }, {
                        "n": "岗巴县",
                        "code": "7777"
                    }, {
                        "n": "吉隆县",
                        "code": "7774"
                    }, {
                        "n": "江孜县",
                        "code": "7762"
                    }, {
                        "n": "康马县",
                        "code": "7770"
                    }, {
                        "n": "拉孜县",
                        "code": "7765"
                    }, {
                        "n": "南木林县",
                        "code": "7761"
                    }, {
                        "n": "聂拉木县",
                        "code": "7775"
                    }, {
                        "n": "仁布县",
                        "code": "7769"
                    }, {
                        "n": "萨嘎县",
                        "code": "7776"
                    }, {
                        "n": "萨迦县",
                        "code": "7764"
                    }, {
                        "n": "谢通门县",
                        "code": "7767"
                    }, {
                        "n": "亚东县",
                        "code": "7773"
                    }, {
                        "n": "仲巴县",
                        "code": "7772"
                    }
                ]
            }, {
                "n": "日喀则地区(地区所在地)",
                "code": "250",
                "a": [
                    {
                        "n": "日喀则市",
                        "code": "7760"
                    }
                ]
            }, {
                "n": "山南地区",
                "code": "255",
                "a": [
                    {
                        "n": "措美县",
                        "code": "7746"
                    }, {
                        "n": "错那县",
                        "code": "7750"
                    }, {
                        "n": "贡嘎县",
                        "code": "7742"
                    }, {
                        "n": "加查县",
                        "code": "7748"
                    }, {
                        "n": "浪卡子县",
                        "code": "7751"
                    }, {
                        "n": "隆子县",
                        "code": "7749"
                    }, {
                        "n": "洛扎县",
                        "code": "7747"
                    }, {
                        "n": "琼结县",
                        "code": "7744"
                    }, {
                        "n": "曲松县",
                        "code": "7745"
                    }, {
                        "n": "桑日县",
                        "code": "7743"
                    }, {
                        "n": "扎囊县",
                        "code": "7741"
                    }
                ]
            }, {
                "n": "山南地区（地区所在地）",
                "code": "256",
                "a": [
                    {
                        "n": "乃东县",
                        "code": "7740"
                    }
                ]
            }, {
                "n": "樟木口岸镇",
                "code": "363",
                "a": [
                    {
                        "n": "樟木口岸镇",
                        "code": "7711"
                    }
                ]
            }
        ]
    }, {
        "p" : "四川省",
        "code" : "10",
        "c" : [
            {
                "n": "阿坝州",
                "code": "32",
                "a": [
                    {
                        "n": "阿坝县",
                        "code": "6802"
                    }, {
                        "n": "黑水县",
                        "code": "6798"
                    }, {
                        "n": "红原县",
                        "code": "6804"
                    }, {
                        "n": "金川县",
                        "code": "6805"
                    }, {
                        "n": "九寨沟县",
                        "code": "6795"
                    }, {
                        "n": "理县",
                        "code": "6792"
                    }, {
                        "n": "马尔康县",
                        "code": "6790"
                    }, {
                        "n": "茂县",
                        "code": "6793"
                    }, {
                        "n": "壤塘县",
                        "code": "6801"
                    }, {
                        "n": "若尔盖县",
                        "code": "6803"
                    }, {
                        "n": "松潘县",
                        "code": "6794"
                    }, {
                        "n": "汶川县",
                        "code": "6791"
                    }, {
                        "n": "小金县",
                        "code": "6797"
                    }
                ]
            }, {
                "n": "巴中市",
                "code": "45",
                "a": [
                    {
                        "n": "巴中市",
                        "code": "6758"
                    }, {
                        "n": "南江县",
                        "code": "6757"
                    }, {
                        "n": "平昌县",
                        "code": "6759"
                    }, {
                        "n": "通江县",
                        "code": "6756"
                    }
                ]
            }, {
                "n": "成都市",
                "code": "75",
                "a": [
                    {
                        "n": "成都市",
                        "code": "6510"
                    }, {
                        "n": "崇州市",
                        "code": "6510"
                    }, {
                        "n": "大邑县",
                        "code": "6510"
                    }, {
                        "n": "都江堰市",
                        "code": "6510"
                    }, {
                        "n": "金堂县",
                        "code": "6510"
                    }, {
                        "n": "彭州市",
                        "code": "6510"
                    }, {
                        "n": "郫县",
                        "code": "6510"
                    }, {
                        "n": "蒲江县",
                        "code": "6510"
                    }, {
                        "n": "邛崃市",
                        "code": "6510"
                    }, {
                        "n": "双流县",
                        "code": "6510"
                    }, {
                        "n": "温江区",
                        "code": "6510"
                    }, {
                        "n": "新都区",
                        "code": "6510"
                    }, {
                        "n": "新津县",
                        "code": "6510"
                    }
                ]
            }, {
                "n": "达州市",
                "code": "82",
                "a": [
                    {
                        "n": "达县",
                        "code": "6752"
                    }, {
                        "n": "达州市",
                        "code": "6750"
                    }, {
                        "n": "大竹县",
                        "code": "6761"
                    }, {
                        "n": "开江县",
                        "code": "6754"
                    }, {
                        "n": "渠县",
                        "code": "6762"
                    }, {
                        "n": "万源市",
                        "code": "6755"
                    }, {
                        "n": "宣汉县",
                        "code": "6753"
                    }
                ]
            }, {
                "n": "德阳市",
                "code": "90",
                "a": [
                    {
                        "n": "德阳市",
                        "code": "6580"
                    }, {
                        "n": "广汉市",
                        "code": "6584"
                    }, {
                        "n": "罗江县",
                        "code": "6585"
                    }, {
                        "n": "绵竹市",
                        "code": "6581"
                    }, {
                        "n": "什邡市",
                        "code": "6583"
                    }, {
                        "n": "中江县",
                        "code": "6582"
                    }
                ]
            }, {
                "n": "甘孜州",
                "code": "108",
                "a": [
                    {
                        "n": "巴塘县",
                        "code": "6826"
                    }, {
                        "n": "白玉县",
                        "code": "6822"
                    }, {
                        "n": "丹巴县",
                        "code": "6813"
                    }, {
                        "n": "道孚县",
                        "code": "6816"
                    }, {
                        "n": "稻城县",
                        "code": "6828"
                    }, {
                        "n": "得荣县",
                        "code": "6829"
                    }, {
                        "n": "德格县",
                        "code": "6821"
                    }, {
                        "n": "甘孜县",
                        "code": "6818"
                    }, {
                        "n": "九龙县",
                        "code": "6814"
                    }, {
                        "n": "康定县",
                        "code": "6810"
                    }, {
                        "n": "理塘县",
                        "code": "6825"
                    }, {
                        "n": "泸定县",
                        "code": "6812"
                    }, {
                        "n": "炉霍县",
                        "code": "6817"
                    }, {
                        "n": "色达县",
                        "code": "6824"
                    }, {
                        "n": "石渠县",
                        "code": "6823"
                    }, {
                        "n": "乡城县",
                        "code": "6827"
                    }, {
                        "n": "新龙县",
                        "code": "6819"
                    }, {
                        "n": "雅江县",
                        "code": "6815"
                    }
                ]
            }, {
                "n": "广安市",
                "code": "111",
                "a": [
                    {
                        "n": "广安市",
                        "code": "6737"
                    }, {
                        "n": "华蓥市",
                        "code": "6732"
                    }, {
                        "n": "邻水县",
                        "code": "6763"
                    }, {
                        "n": "武胜县",
                        "code": "6741"
                    }, {
                        "n": "岳池县",
                        "code": "6735"
                    }
                ]
            }, {
                "n": "广元市",
                "code": "112",
                "a": [
                    {
                        "n": "苍溪县",
                        "code": "6614"
                    }, {
                        "n": "广元市",
                        "code": "6610"
                    }, {
                        "n": "剑阁县",
                        "code": "6613"
                    }, {
                        "n": "青川县",
                        "code": "6612"
                    }, {
                        "n": "旺苍县",
                        "code": "6611"
                    }
                ]
            }, {
                "n": "乐山市",
                "code": "185",
                "a": [
                    {
                        "n": "峨边县",
                        "code": "6662"
                    }, {
                        "n": "峨眉山市",
                        "code": "6664"
                    }, {
                        "n": "夹江县",
                        "code": "6655"
                    }, {
                        "n": "犍为县",
                        "code": "6653"
                    }, {
                        "n": "井研县",
                        "code": "6654"
                    }, {
                        "n": "乐山市",
                        "code": "6650"
                    }, {
                        "n": "马边县",
                        "code": "6663"
                    }, {
                        "n": "沐川县",
                        "code": "6658"
                    }
                ]
            }, {
                "n": "凉山州",
                "code": "189",
                "a": [
                    {
                        "n": "布拖县",
                        "code": "6849"
                    }, {
                        "n": "德昌县",
                        "code": "6859"
                    }, {
                        "n": "甘洛县",
                        "code": "6856"
                    }, {
                        "n": "会东县",
                        "code": "6846"
                    }, {
                        "n": "会理县",
                        "code": "6845"
                    }, {
                        "n": "金阳县",
                        "code": "6851"
                    }, {
                        "n": "雷波县",
                        "code": "6858"
                    }, {
                        "n": "美姑县",
                        "code": "6857"
                    }, {
                        "n": "冕宁县",
                        "code": "6854"
                    }, {
                        "n": "木里县",
                        "code": "6842"
                    }, {
                        "n": "宁南县",
                        "code": "6847"
                    }, {
                        "n": "普格县",
                        "code": "6848"
                    }, {
                        "n": "西昌市",
                        "code": "6840"
                    }, {
                        "n": "喜德县",
                        "code": "6853"
                    }, {
                        "n": "盐源县",
                        "code": "6843"
                    }, {
                        "n": "越西县",
                        "code": "6855"
                    }, {
                        "n": "昭觉县",
                        "code": "6852"
                    }
                ]
            }, {
                "n": "泸州市",
                "code": "205",
                "a": [
                    {
                        "n": "古蔺县",
                        "code": "6575"
                    }, {
                        "n": "合江县",
                        "code": "6572"
                    }, {
                        "n": "泸县",
                        "code": "6571"
                    }, {
                        "n": "泸州市",
                        "code": "6570"
                    }, {
                        "n": "纳溪区",
                        "code": "6573"
                    }, {
                        "n": "叙永县",
                        "code": "6574"
                    }
                ]
            }, {
                "n": "眉山市",
                "code": "211",
                "a": [
                    {
                        "n": "丹棱县",
                        "code": "6665"
                    }, {
                        "n": "洪雅县",
                        "code": "6656"
                    }, {
                        "n": "眉山市",
                        "code": "6652"
                    }, {
                        "n": "彭山县",
                        "code": "6657"
                    }, {
                        "n": "青神县",
                        "code": "6659"
                    }, {
                        "n": "仁寿县",
                        "code": "6651"
                    }
                ]
            }, {
                "n": "绵阳市",
                "code": "213",
                "a": [
                    {
                        "n": "安县",
                        "code": "6593"
                    }, {
                        "n": "北川县",
                        "code": "6595"
                    }, {
                        "n": "江油市",
                        "code": "6597"
                    }, {
                        "n": "绵阳市",
                        "code": "6590"
                    }, {
                        "n": "平武县",
                        "code": "6596"
                    }, {
                        "n": "三台县",
                        "code": "6591"
                    }, {
                        "n": "盐亭县",
                        "code": "6592"
                    }, {
                        "n": "梓潼县",
                        "code": "6594"
                    }
                ]
            }, {
                "n": "内江市",
                "code": "215",
                "a": [
                    {
                        "n": "隆昌县",
                        "code": "6638"
                    }, {
                        "n": "内江市",
                        "code": "6630"
                    }, {
                        "n": "威远县",
                        "code": "6634"
                    }, {
                        "n": "资中县",
                        "code": "6635"
                    }
                ]
            }, {
                "n": "南充市",
                "code": "219",
                "a": [
                    {
                        "n": "阆中市",
                        "code": "6743"
                    }, {
                        "n": "南部县",
                        "code": "6734"
                    }, {
                        "n": "南充市",
                        "code": "6730"
                    }, {
                        "n": "蓬安县",
                        "code": "6738"
                    }, {
                        "n": "西充县",
                        "code": "6742"
                    }, {
                        "n": "仪陇县",
                        "code": "6739"
                    }, {
                        "n": "营山县",
                        "code": "6736"
                    }
                ]
            }, {
                "n": "攀枝花市",
                "code": "228",
                "a": [
                    {
                        "n": "米易县",
                        "code": "6561"
                    }, {
                        "n": "攀枝花市",
                        "code": "6560"
                    }, {
                        "n": "盐边县",
                        "code": "6562"
                    }
                ]
            }, {
                "n": "遂宁市",
                "code": "282",
                "a": [
                    {
                        "n": "大英县",
                        "code": "6623"
                    }, {
                        "n": "蓬溪县",
                        "code": "6621"
                    }, {
                        "n": "射洪县",
                        "code": "6622"
                    }, {
                        "n": "遂宁市",
                        "code": "6620"
                    }
                ]
            }, {
                "n": "雅安市",
                "code": "332",
                "a": [
                    {
                        "n": "宝兴县",
                        "code": "6778"
                    }, {
                        "n": "汉源县",
                        "code": "6774"
                    }, {
                        "n": "芦山县",
                        "code": "6777"
                    }, {
                        "n": "名山县",
                        "code": "6772"
                    }, {
                        "n": "石棉县",
                        "code": "6775"
                    }, {
                        "n": "天全县",
                        "code": "6776"
                    }, {
                        "n": "雅安市",
                        "code": "6770"
                    }, {
                        "n": "荥经县",
                        "code": "6773"
                    }
                ]
            }, {
                "n": "宜宾市",
                "code": "342",
                "a": [
                    {
                        "n": "长宁县",
                        "code": "6715"
                    }, {
                        "n": "高县",
                        "code": "6716"
                    }, {
                        "n": "珙县",
                        "code": "6718"
                    }, {
                        "n": "江安县",
                        "code": "6714"
                    }, {
                        "n": "筠连县",
                        "code": "6717"
                    }, {
                        "n": "南溪县",
                        "code": "6713"
                    }, {
                        "n": "屏山县",
                        "code": "6721"
                    }, {
                        "n": "兴文县",
                        "code": "6719"
                    }, {
                        "n": "宜宾市",
                        "code": "6710"
                    }, {
                        "n": "宜宾县",
                        "code": "6712"
                    }
                ]
            }, {
                "n": "资阳市",
                "code": "376",
                "a": [
                    {
                        "n": "安岳县",
                        "code": "6633"
                    }, {
                        "n": "简阳市",
                        "code": "6637"
                    }, {
                        "n": "乐至县",
                        "code": "6632"
                    }, {
                        "n": "资阳市",
                        "code": "6636"
                    }
                ]
            }, {
                "n": "自贡市",
                "code": "378",
                "a": [
                    {
                        "n": "富顺县",
                        "code": "6552"
                    }, {
                        "n": "荣县",
                        "code": "6551"
                    }, {
                        "n": "自贡市",
                        "code": "6550"
                    }
                ]
            }
        ]
    }, {
        "p" : "湖南省",
        "code" : "11",
        "c" : [
            {
                "n": "长沙市",
                "code": "67",
                "a": [
                    {
                        "n": "长沙市",
                        "code": "5510"
                    }, {
                        "n": "浏阳市",
                        "code": "5510"
                    }, {
                        "n": "宁乡县",
                        "code": "5510"
                    }, {
                        "n": "望城县",
                        "code": "5510"
                    }
                ]
            }, {
                "n": "常德市",
                "code": "69",
                "a": [
                    {
                        "n": "安乡县",
                        "code": "5581"
                    }, {
                        "n": "常德市",
                        "code": "5580"
                    }, {
                        "n": "汉寿县",
                        "code": "5582"
                    }, {
                        "n": "津市市",
                        "code": "5587"
                    }, {
                        "n": "澧县",
                        "code": "5583"
                    }, {
                        "n": "临澧县",
                        "code": "5584"
                    }, {
                        "n": "石门县",
                        "code": "5586"
                    }, {
                        "n": "桃源县",
                        "code": "5585"
                    }
                ]
            }, {
                "n": "郴州市",
                "code": "74",
                "a": [
                    {
                        "n": "安仁县",
                        "code": "5642"
                    }, {
                        "n": "郴州市",
                        "code": "5630"
                    }, {
                        "n": "桂东县",
                        "code": "5641"
                    }, {
                        "n": "桂阳县",
                        "code": "5634"
                    }, {
                        "n": "嘉禾县",
                        "code": "5637"
                    }, {
                        "n": "临武县",
                        "code": "5638"
                    }, {
                        "n": "汝城县",
                        "code": "5639"
                    }, {
                        "n": "宜章县",
                        "code": "5636"
                    }, {
                        "n": "永兴县",
                        "code": "5635"
                    }, {
                        "n": "资兴市",
                        "code": "5632"
                    }
                ]
            }, {
                "n": "衡阳市",
                "code": "138",
                "a": [
                    {
                        "n": "常宁市",
                        "code": "5545"
                    }, {
                        "n": "衡东县",
                        "code": "5544"
                    }, {
                        "n": "衡南县",
                        "code": "5542"
                    }, {
                        "n": "衡山县",
                        "code": "5543"
                    }, {
                        "n": "衡阳市",
                        "code": "5540"
                    }, {
                        "n": "衡阳县",
                        "code": "5541"
                    }, {
                        "n": "耒阳市",
                        "code": "5547"
                    }, {
                        "n": "祁东县",
                        "code": "5546"
                    }
                ]
            }, {
                "n": "怀化市",
                "code": "144",
                "a": [
                    {
                        "n": "辰溪县",
                        "code": "5675"
                    }, {
                        "n": "洪江市",
                        "code": "5672"
                    }, {
                        "n": "怀化市",
                        "code": "5670"
                    }, {
                        "n": "会同县",
                        "code": "5681"
                    }, {
                        "n": "靖州县",
                        "code": "5682"
                    }, {
                        "n": "麻阳县",
                        "code": "5677"
                    }, {
                        "n": "通道县",
                        "code": "5683"
                    }, {
                        "n": "新晃县",
                        "code": "5678"
                    }, {
                        "n": "溆浦县",
                        "code": "5676"
                    }, {
                        "n": "沅陵县",
                        "code": "5674"
                    }, {
                        "n": "芷江县",
                        "code": "5679"
                    }
                ]
            }, {
                "n": "吉首市",
                "code": "156",
                "a": [
                    {
                        "n": "保靖县",
                        "code": "5695"
                    }, {
                        "n": "凤凰县",
                        "code": "5693"
                    }, {
                        "n": "古丈县",
                        "code": "5696"
                    }, {
                        "n": "花垣县",
                        "code": "5694"
                    }, {
                        "n": "吉首市",
                        "code": "5690"
                    }, {
                        "n": "龙山县",
                        "code": "5698"
                    }, {
                        "n": "泸溪县",
                        "code": "5692"
                    }, {
                        "n": "永顺县",
                        "code": "5697"
                    }
                ]
            }, {
                "n": "娄底市",
                "code": "204",
                "a": [
                    {
                        "n": "冷水江市",
                        "code": "5622"
                    }, {
                        "n": "涟源市",
                        "code": "5623"
                    }, {
                        "n": "娄底市",
                        "code": "5620"
                    }, {
                        "n": "双峰县",
                        "code": "5624"
                    }, {
                        "n": "新化县",
                        "code": "5625"
                    }
                ]
            }, {
                "n": "邵阳市",
                "code": "264",
                "a": [
                    {
                        "n": "城步县",
                        "code": "5559"
                    }, {
                        "n": "洞口县",
                        "code": "5555"
                    }, {
                        "n": "隆回县",
                        "code": "5554"
                    }, {
                        "n": "邵东县",
                        "code": "5551"
                    }, {
                        "n": "邵阳市",
                        "code": "5550"
                    }, {
                        "n": "邵阳县",
                        "code": "5553"
                    }, {
                        "n": "绥宁县",
                        "code": "5557"
                    }, {
                        "n": "武冈市",
                        "code": "5556"
                    }, {
                        "n": "新宁县",
                        "code": "5558"
                    }, {
                        "n": "新邵县",
                        "code": "5552"
                    }
                ]
            }, {
                "n": "湘潭市",
                "code": "320",
                "a": [
                    {
                        "n": "韶山市",
                        "code": "5533"
                    }, {
                        "n": "湘潭市",
                        "code": "5530"
                    }, {
                        "n": "湘乡市",
                        "code": "5532"
                    }
                ]
            }, {
                "n": "益阳市",
                "code": "345",
                "a": [
                    {
                        "n": "安化县",
                        "code": "5616"
                    }, {
                        "n": "南县",
                        "code": "5614"
                    }, {
                        "n": "桃江县",
                        "code": "5615"
                    }, {
                        "n": "益阳市",
                        "code": "5610"
                    }, {
                        "n": "沅江市",
                        "code": "5612"
                    }
                ]
            }, {
                "n": "永州市",
                "code": "349",
                "a": [
                    {
                        "n": "道县",
                        "code": "5654"
                    }, {
                        "n": "东安县",
                        "code": "5653"
                    }, {
                        "n": "江华县",
                        "code": "5657"
                    }, {
                        "n": "江永县",
                        "code": "5656"
                    }, {
                        "n": "蓝山县",
                        "code": "5658"
                    }, {
                        "n": "宁远县",
                        "code": "5655"
                    }, {
                        "n": "祁阳县",
                        "code": "5662"
                    }, {
                        "n": "双牌县",
                        "code": "5661"
                    }, {
                        "n": "新田县",
                        "code": "5659"
                    }, {
                        "n": "永州市",
                        "code": "5650"
                    }
                ]
            }, {
                "n": "岳阳市",
                "code": "354",
                "a": [
                    {
                        "n": "汩罗市",
                        "code": "5576"
                    }, {
                        "n": "华容县",
                        "code": "5573"
                    }, {
                        "n": "临湘市",
                        "code": "5572"
                    }, {
                        "n": "平江县",
                        "code": "5575"
                    }, {
                        "n": "湘阴县",
                        "code": "5574"
                    }, {
                        "n": "岳阳市",
                        "code": "5570"
                    }, {
                        "n": "岳阳县",
                        "code": "5571"
                    }
                ]
            }, {
                "n": "张家界市",
                "code": "359",
                "a": [
                    {
                        "n": "慈利县",
                        "code": "5591"
                    }, {
                        "n": "桑植县",
                        "code": "5592"
                    }, {
                        "n": "张家界市",
                        "code": "5590"
                    }
                ]
            }, {
                "n": "株洲市",
                "code": "373",
                "a": [
                    {
                        "n": "茶陵县",
                        "code": "5523"
                    }, {
                        "n": "醴陵市",
                        "code": "5525"
                    }, {
                        "n": "炎陵县",
                        "code": "5526"
                    }, {
                        "n": "攸县",
                        "code": "5522"
                    }, {
                        "n": "株洲市",
                        "code": "5520"
                    }, {
                        "n": "株洲县",
                        "code": "5521"
                    }
                ]
            }
        ]
    }, {
        "p" : "安徽省",
        "code" : "12",
        "c" : [
            {
                "n": "安庆市",
                "code": "39",
                "a": [
                    {
                        "n": "安庆市",
                        "code": "3680"
                    }, {
                        "n": "枞阳县",
                        "code": "3683"
                    }, {
                        "n": "怀宁县",
                        "code": "3682"
                    }, {
                        "n": "潜山县",
                        "code": "3684"
                    }, {
                        "n": "宿松县",
                        "code": "3686"
                    }, {
                        "n": "太湖县",
                        "code": "3685"
                    }, {
                        "n": "桐城市",
                        "code": "3681"
                    }, {
                        "n": "望江县",
                        "code": "3687"
                    }, {
                        "n": "岳西县",
                        "code": "3688"
                    }
                ]
            }, {
                "n": "蚌埠市",
                "code": "50",
                "a": [
                    {
                        "n": "蚌埠市",
                        "code": "3630"
                    }, {
                        "n": "固镇县",
                        "code": "3633"
                    }, {
                        "n": "怀远县",
                        "code": "3631"
                    }, {
                        "n": "五河县",
                        "code": "3632"
                    }
                ]
            }, {
                "n": "亳州市",
                "code": "60",
                "a": [
                    {
                        "n": "亳州市",
                        "code": "3722"
                    }, {
                        "n": "利辛县",
                        "code": "3732"
                    }, {
                        "n": "蒙城县",
                        "code": "3727"
                    }, {
                        "n": "涡阳县",
                        "code": "3726"
                    }
                ]
            }, {
                "n": "巢湖市",
                "code": "71",
                "a": [
                    {
                        "n": "巢湖市",
                        "code": "3781"
                    }, {
                        "n": "含山县",
                        "code": "3784"
                    }, {
                        "n": "和县",
                        "code": "3785"
                    }, {
                        "n": "庐江县",
                        "code": "3782"
                    }, {
                        "n": "无为县",
                        "code": "3783"
                    }
                ]
            }, {
                "n": "池州市",
                "code": "77",
                "a": [
                    {
                        "n": "池州市",
                        "code": "3790"
                    }, {
                        "n": "东至县",
                        "code": "3792"
                    }, {
                        "n": "青阳县",
                        "code": "3794"
                    }, {
                        "n": "石台县",
                        "code": "3793"
                    }
                ]
            }, {
                "n": "滁州市",
                "code": "80",
                "a": [
                    {
                        "n": "滁州市",
                        "code": "3750"
                    }, {
                        "n": "定远县",
                        "code": "3755"
                    }, {
                        "n": "凤阳县",
                        "code": "3756"
                    }, {
                        "n": "来安县",
                        "code": "3753"
                    }, {
                        "n": "明光市",
                        "code": "3757"
                    }, {
                        "n": "全椒县",
                        "code": "3754"
                    }, {
                        "n": "天长市",
                        "code": "3752"
                    }
                ]
            }, {
                "n": "阜阳市",
                "code": "106",
                "a": [
                    {
                        "n": "阜南县",
                        "code": "3728"
                    }, {
                        "n": "阜阳市",
                        "code": "3720"
                    }, {
                        "n": "界首市",
                        "code": "3731"
                    }, {
                        "n": "临泉县",
                        "code": "3724"
                    }, {
                        "n": "太和县",
                        "code": "3725"
                    }, {
                        "n": "颍上县",
                        "code": "3729"
                    }
                ]
            }, {
                "n": "合肥市",
                "code": "128",
                "a": [
                    {
                        "n": "长丰县",
                        "code": "3610"
                    }, {
                        "n": "肥东县",
                        "code": "3610"
                    }, {
                        "n": "肥西县",
                        "code": "3610"
                    }, {
                        "n": "合肥市",
                        "code": "3610"
                    }
                ]
            }, {
                "n": "淮北市",
                "code": "146",
                "a": [
                    {
                        "n": "淮北市",
                        "code": "3660"
                    }, {
                        "n": "濉溪县",
                        "code": "3661"
                    }
                ]
            }, {
                "n": "淮南市",
                "code": "147",
                "a": [
                    {
                        "n": "凤台县",
                        "code": "3641"
                    }, {
                        "n": "淮南市",
                        "code": "3640"
                    }
                ]
            }, {
                "n": "黄山市",
                "code": "150",
                "a": [
                    {
                        "n": "黄山市",
                        "code": "3710"
                    }, {
                        "n": "祁门县",
                        "code": "3714"
                    }, {
                        "n": "歙县",
                        "code": "3711"
                    }, {
                        "n": "休宁县",
                        "code": "3712"
                    }, {
                        "n": "黟县",
                        "code": "3713"
                    }
                ]
            }, {
                "n": "六安市",
                "code": "200",
                "a": [
                    {
                        "n": "霍邱县",
                        "code": "3764"
                    }, {
                        "n": "霍山县",
                        "code": "3767"
                    }, {
                        "n": "金寨县",
                        "code": "3766"
                    }, {
                        "n": "六安市",
                        "code": "3760"
                    }, {
                        "n": "寿县",
                        "code": "3763"
                    }, {
                        "n": "舒城县",
                        "code": "3765"
                    }
                ]
            }, {
                "n": "马鞍山市",
                "code": "209",
                "a": [
                    {
                        "n": "当涂县",
                        "code": "3651"
                    }, {
                        "n": "马鞍山市",
                        "code": "3650"
                    }
                ]
            }, {
                "n": "宿州市",
                "code": "279",
                "a": [
                    {
                        "n": "砀山县",
                        "code": "3742"
                    }, {
                        "n": "灵璧县",
                        "code": "3745"
                    }, {
                        "n": "泗县",
                        "code": "3746"
                    }, {
                        "n": "宿州市",
                        "code": "3740"
                    }, {
                        "n": "萧县",
                        "code": "3743"
                    }
                ]
            }, {
                "n": "铜陵市",
                "code": "295",
                "a": [
                    {
                        "n": "铜陵市",
                        "code": "3670"
                    }, {
                        "n": "铜陵县",
                        "code": "3671"
                    }
                ]
            }, {
                "n": "芜湖市",
                "code": "309",
                "a": [
                    {
                        "n": "繁昌县",
                        "code": "3622"
                    }, {
                        "n": "南陵县",
                        "code": "3623"
                    }, {
                        "n": "芜湖市",
                        "code": "3620"
                    }, {
                        "n": "芜湖县",
                        "code": "3621"
                    }
                ]
            }, {
                "n": "宣城市",
                "code": "331",
                "a": [
                    {
                        "n": "广德县",
                        "code": "3773"
                    }, {
                        "n": "绩溪县",
                        "code": "3777"
                    }, {
                        "n": "泾县",
                        "code": "3775"
                    }, {
                        "n": "旌德县",
                        "code": "3776"
                    }, {
                        "n": "郎溪县",
                        "code": "3772"
                    }, {
                        "n": "宁国市",
                        "code": "3774"
                    }, {
                        "n": "宣城市",
                        "code": "3771"
                    }
                ]
            }
        ]
    }, {
        "p" : "天津市",
        "code" : "13",
        "c" : [
            {
                "n": "天津市",
                "code": "289",
                "a": [
                    {
                        "n": "天津市",
                        "code": "1100"
                    }
                ]
            }
        ]
    }, {
        "p" : "陕西省",
        "code" : "14",
        "c" : [
            {
                "n": "安康市",
                "code": "38",
                "a": [
                    {
                        "n": "安康市",
                        "code": "8010"
                    }, {
                        "n": "白河县",
                        "code": "8021"
                    }, {
                        "n": "汉阴县",
                        "code": "8012"
                    }, {
                        "n": "岚皋县",
                        "code": "8016"
                    }, {
                        "n": "宁陕县",
                        "code": "8014"
                    }, {
                        "n": "平利县",
                        "code": "8017"
                    }, {
                        "n": "石泉县",
                        "code": "8013"
                    }, {
                        "n": "旬阳县",
                        "code": "8019"
                    }, {
                        "n": "镇坪县",
                        "code": "8018"
                    }, {
                        "n": "紫阳县",
                        "code": "8015"
                    }
                ]
            }, {
                "n": "宝鸡市",
                "code": "52",
                "a": [
                    {
                        "n": "宝鸡市",
                        "code": "7930"
                    }, {
                        "n": "凤县",
                        "code": "7939"
                    }, {
                        "n": "凤翔县",
                        "code": "7932"
                    }, {
                        "n": "扶风县",
                        "code": "7934"
                    }, {
                        "n": "麟游县",
                        "code": "7938"
                    }, {
                        "n": "陇县",
                        "code": "7936"
                    }, {
                        "n": "眉县",
                        "code": "7935"
                    }, {
                        "n": "岐山县",
                        "code": "7933"
                    }, {
                        "n": "千阳县",
                        "code": "7937"
                    }, {
                        "n": "太白县",
                        "code": "7941"
                    }
                ]
            }, {
                "n": "汉中市",
                "code": "126",
                "a": [
                    {
                        "n": "城固县",
                        "code": "7993"
                    }, {
                        "n": "佛坪县",
                        "code": "8002"
                    }, {
                        "n": "汉中市",
                        "code": "7990"
                    }, {
                        "n": "留坝县",
                        "code": "8001"
                    }, {
                        "n": "略阳县",
                        "code": "7998"
                    }, {
                        "n": "勉县",
                        "code": "7996"
                    }, {
                        "n": "南郑县",
                        "code": "7992"
                    }, {
                        "n": "宁强县",
                        "code": "7997"
                    }, {
                        "n": "西乡县",
                        "code": "7995"
                    }, {
                        "n": "洋县",
                        "code": "7994"
                    }, {
                        "n": "镇巴县",
                        "code": "7999"
                    }
                ]
            }, {
                "n": "商洛市",
                "code": "259",
                "a": [
                    {
                        "n": "丹凤县",
                        "code": "8033"
                    }, {
                        "n": "洛南县",
                        "code": "8032"
                    }, {
                        "n": "山阳县",
                        "code": "8035"
                    }, {
                        "n": "商洛市",
                        "code": "8030"
                    }, {
                        "n": "商南县",
                        "code": "8034"
                    }, {
                        "n": "镇安县",
                        "code": "8036"
                    }, {
                        "n": "柞水县",
                        "code": "8037"
                    }
                ]
            }, {
                "n": "铜川市",
                "code": "294",
                "a": [
                    {
                        "n": "铜川市",
                        "code": "7920"
                    }, {
                        "n": "耀县",
                        "code": "7921"
                    }, {
                        "n": "宜君县",
                        "code": "7922"
                    }
                ]
            }, {
                "n": "渭南市",
                "code": "301",
                "a": [
                    {
                        "n": "白水县",
                        "code": "7979"
                    }, {
                        "n": "澄城县",
                        "code": "7978"
                    }, {
                        "n": "大荔县",
                        "code": "7976"
                    }, {
                        "n": "富平县",
                        "code": "7982"
                    }, {
                        "n": "韩城市",
                        "code": "7972"
                    }, {
                        "n": "合阳县",
                        "code": "7981"
                    }, {
                        "n": "华县",
                        "code": "7973"
                    }, {
                        "n": "华阴市",
                        "code": "7974"
                    }, {
                        "n": "蒲城县",
                        "code": "7977"
                    }, {
                        "n": "潼关县",
                        "code": "7975"
                    }, {
                        "n": "渭南市",
                        "code": "7970"
                    }
                ]
            }, {
                "n": "西安市",
                "code": "313",
                "a": [
                    {
                        "n": "高陵县",
                        "code": "7910"
                    }, {
                        "n": "户县",
                        "code": "7910"
                    }, {
                        "n": "蓝田县",
                        "code": "7910"
                    }, {
                        "n": "西安市",
                        "code": "7910"
                    }, {
                        "n": "周至县",
                        "code": "7910"
                    }
                ]
            }, {
                "n": "咸阳市",
                "code": "319",
                "a": [
                    {
                        "n": "彬县",
                        "code": "7957"
                    }, {
                        "n": "长武县",
                        "code": "7958"
                    }, {
                        "n": "淳化县",
                        "code": "7961"
                    }, {
                        "n": "泾阳县",
                        "code": "7953"
                    }, {
                        "n": "礼泉县",
                        "code": "7955"
                    }, {
                        "n": "乾县",
                        "code": "7954"
                    }, {
                        "n": "三原县",
                        "code": "7952"
                    }, {
                        "n": "武功县",
                        "code": "7962"
                    }, {
                        "n": "咸阳市",
                        "code": "7950"
                    }, {
                        "n": "兴平市",
                        "code": "7951"
                    }, {
                        "n": "旬邑县",
                        "code": "7959"
                    }, {
                        "n": "永寿县",
                        "code": "7956"
                    }
                ]
            }, {
                "n": "延安市",
                "code": "334",
                "a": [
                    {
                        "n": "安塞县",
                        "code": "8045"
                    }, {
                        "n": "富县",
                        "code": "8049"
                    }, {
                        "n": "甘泉县",
                        "code": "8048"
                    }, {
                        "n": "黄陵县",
                        "code": "8054"
                    }, {
                        "n": "黄龙县",
                        "code": "8053"
                    }, {
                        "n": "洛川县",
                        "code": "8051"
                    }, {
                        "n": "吴旗县",
                        "code": "8047"
                    }, {
                        "n": "延安市",
                        "code": "8040"
                    }, {
                        "n": "延长县",
                        "code": "8042"
                    }, {
                        "n": "延川县",
                        "code": "8043"
                    }, {
                        "n": "宜川县",
                        "code": "8052"
                    }, {
                        "n": "志丹县",
                        "code": "8046"
                    }, {
                        "n": "子长县",
                        "code": "8044"
                    }
                ]
            }, {
                "n": "榆林市",
                "code": "350",
                "a": [
                    {
                        "n": "定边县",
                        "code": "8066"
                    }, {
                        "n": "府谷县",
                        "code": "8063"
                    }, {
                        "n": "横山县",
                        "code": "8064"
                    }, {
                        "n": "佳县",
                        "code": "8069"
                    }, {
                        "n": "靖边县",
                        "code": "8065"
                    }, {
                        "n": "米脂县",
                        "code": "8068"
                    }, {
                        "n": "清涧县",
                        "code": "8072"
                    }, {
                        "n": "神木县",
                        "code": "8062"
                    }, {
                        "n": "绥德县",
                        "code": "8067"
                    }, {
                        "n": "吴堡县",
                        "code": "8071"
                    }, {
                        "n": "榆林市",
                        "code": "8060"
                    }, {
                        "n": "子洲县",
                        "code": "8073"
                    }
                ]
            }
        ]
    }, {
        "p" : "北京市",
        "code" : "15",
        "c" : [
            {
                "n": "北京市",
                "code": "56",
                "a": [
                    {
                        "n": "北京市",
                        "code": "1000"
                    }
                ]
            }
        ]
    }, {
        "p" : "山东省",
        "code" : "16",
        "c" : [
            {
                "n": "滨州市",
                "code": "59",
                "a": [
                    {
                        "n": "滨州市",
                        "code": "4660"
                    }, {
                        "n": "博兴县",
                        "code": "4666"
                    }, {
                        "n": "惠民县",
                        "code": "4662"
                    }, {
                        "n": "无棣县",
                        "code": "4664"
                    }, {
                        "n": "阳信县",
                        "code": "4663"
                    }, {
                        "n": "沾化县",
                        "code": "4665"
                    }, {
                        "n": "邹平县",
                        "code": "4667"
                    }
                ]
            }, {
                "n": "德州市",
                "code": "91",
                "a": [
                    {
                        "n": "德州市",
                        "code": "4680"
                    }, {
                        "n": "乐陵市",
                        "code": "4682"
                    }, {
                        "n": "临邑县",
                        "code": "4689"
                    }, {
                        "n": "陵县",
                        "code": "4683"
                    }, {
                        "n": "宁津县",
                        "code": "4693"
                    }, {
                        "n": "平原县",
                        "code": "4684"
                    }, {
                        "n": "齐河县",
                        "code": "4687"
                    }, {
                        "n": "庆云县",
                        "code": "4694"
                    }, {
                        "n": "武城县",
                        "code": "4686"
                    }, {
                        "n": "夏津县",
                        "code": "4685"
                    }, {
                        "n": "禹城市",
                        "code": "4688"
                    }
                ]
            }, {
                "n": "东营市",
                "code": "95",
                "a": [
                    {
                        "n": "东营市",
                        "code": "4550"
                    }, {
                        "n": "广饶县",
                        "code": "4553"
                    }, {
                        "n": "垦利县",
                        "code": "4551"
                    }, {
                        "n": "利津县",
                        "code": "4552"
                    }
                ]
            }, {
                "n": "菏泽市",
                "code": "132",
                "a": [
                    {
                        "n": "曹县",
                        "code": "4752"
                    }, {
                        "n": "成武县",
                        "code": "4754"
                    }, {
                        "n": "单县",
                        "code": "4755"
                    }, {
                        "n": "定陶县",
                        "code": "4753"
                    }, {
                        "n": "东明县",
                        "code": "4761"
                    }, {
                        "n": "菏泽市",
                        "code": "4750"
                    }, {
                        "n": "巨野县",
                        "code": "4756"
                    }, {
                        "n": "鄄城县",
                        "code": "4759"
                    }, {
                        "n": "郓城县",
                        "code": "4758"
                    }
                ]
            }, {
                "n": "济南市",
                "code": "157",
                "a": [
                    {
                        "n": "济南市",
                        "code": "4510"
                    }, {
                        "n": "济阳县",
                        "code": "4510"
                    }, {
                        "n": "平阴县",
                        "code": "4510"
                    }, {
                        "n": "商河县",
                        "code": "4510"
                    }, {
                        "n": "章丘市",
                        "code": "4510"
                    }
                ]
            }, {
                "n": "济宁市",
                "code": "158",
                "a": [
                    {
                        "n": "衮州市",
                        "code": "4611"
                    }, {
                        "n": "济宁市",
                        "code": "4610"
                    }, {
                        "n": "嘉祥县",
                        "code": "4616"
                    }, {
                        "n": "金乡县",
                        "code": "4615"
                    }, {
                        "n": "梁山县",
                        "code": "4757"
                    }, {
                        "n": "曲阜市",
                        "code": "4619"
                    }, {
                        "n": "泗水县",
                        "code": "4618"
                    }, {
                        "n": "微山县",
                        "code": "4613"
                    }, {
                        "n": "汶上县",
                        "code": "4617"
                    }, {
                        "n": "鱼台县",
                        "code": "4614"
                    }, {
                        "n": "邹城市",
                        "code": "4612"
                    }
                ]
            }, {
                "n": "莱芜市",
                "code": "182",
                "a": [
                    {
                        "n": "莱芜市",
                        "code": "4634"
                    }
                ]
            }, {
                "n": "聊城市",
                "code": "192",
                "a": [
                    {
                        "n": "茌平县",
                        "code": "4715"
                    }, {
                        "n": "东阿县",
                        "code": "4716"
                    }, {
                        "n": "高唐县",
                        "code": "4718"
                    }, {
                        "n": "冠县",
                        "code": "4717"
                    }, {
                        "n": "聊城市",
                        "code": "4710"
                    }, {
                        "n": "临清市",
                        "code": "4712"
                    }, {
                        "n": "莘县",
                        "code": "4714"
                    }, {
                        "n": "阳谷县",
                        "code": "4713"
                    }
                ]
            }, {
                "n": "临沂市",
                "code": "198",
                "a": [
                    {
                        "n": "苍山县",
                        "code": "4734"
                    }, {
                        "n": "费县",
                        "code": "4742"
                    }, {
                        "n": "莒南县",
                        "code": "4735"
                    }, {
                        "n": "临沭县",
                        "code": "4744"
                    }, {
                        "n": "临沂市",
                        "code": "4730"
                    }, {
                        "n": "蒙阴县",
                        "code": "4739"
                    }, {
                        "n": "平邑县",
                        "code": "4741"
                    }, {
                        "n": "郯城县",
                        "code": "4733"
                    }, {
                        "n": "沂南县",
                        "code": "4743"
                    }, {
                        "n": "沂水县",
                        "code": "4737"
                    }
                ]
            }, {
                "n": "青岛市",
                "code": "243",
                "a": [
                    {
                        "n": "即墨市",
                        "code": "4521"
                    }, {
                        "n": "胶南市",
                        "code": "4522"
                    }, {
                        "n": "胶州市",
                        "code": "4525"
                    }, {
                        "n": "莱西市",
                        "code": "4523"
                    }, {
                        "n": "平度市",
                        "code": "4524"
                    }, {
                        "n": "青岛市",
                        "code": "4520"
                    }
                ]
            }, {
                "n": "日照市",
                "code": "251",
                "a": [
                    {
                        "n": "莒县",
                        "code": "4736"
                    }, {
                        "n": "日照市",
                        "code": "4732"
                    }, {
                        "n": "五莲县",
                        "code": "4587"
                    }
                ]
            }, {
                "n": "泰安市",
                "code": "286",
                "a": [
                    {
                        "n": "东平县",
                        "code": "4633"
                    }, {
                        "n": "肥城市",
                        "code": "4632"
                    }, {
                        "n": "宁阳县",
                        "code": "4631"
                    }, {
                        "n": "泰安市",
                        "code": "4630"
                    }, {
                        "n": "新泰市",
                        "code": "4635"
                    }
                ]
            }, {
                "n": "威海市",
                "code": "299",
                "a": [
                    {
                        "n": "荣成市",
                        "code": "4653"
                    }, {
                        "n": "乳山市",
                        "code": "4651"
                    }, {
                        "n": "威海市",
                        "code": "4650"
                    }, {
                        "n": "文登市",
                        "code": "4652"
                    }
                ]
            }, {
                "n": "潍坊市",
                "code": "300",
                "a": [
                    {
                        "n": "安丘市",
                        "code": "4581"
                    }, {
                        "n": "昌乐县",
                        "code": "4584"
                    }, {
                        "n": "昌邑市",
                        "code": "4585"
                    }, {
                        "n": "高密市",
                        "code": "4586"
                    }, {
                        "n": "临朐县",
                        "code": "4583"
                    }, {
                        "n": "青州市",
                        "code": "4588"
                    }, {
                        "n": "寿光市",
                        "code": "4582"
                    }, {
                        "n": "潍坊市",
                        "code": "4580"
                    }, {
                        "n": "诸城市",
                        "code": "4589"
                    }
                ]
            }, {
                "n": "烟台市",
                "code": "333",
                "a": [
                    {
                        "n": "长岛县",
                        "code": "4566"
                    }, {
                        "n": "海阳市",
                        "code": "4564"
                    }, {
                        "n": "莱阳市",
                        "code": "4568"
                    }, {
                        "n": "莱州市",
                        "code": "4569"
                    }, {
                        "n": "龙口市",
                        "code": "4567"
                    }, {
                        "n": "蓬莱市",
                        "code": "4561"
                    }, {
                        "n": "栖霞市",
                        "code": "4563"
                    }, {
                        "n": "烟台市",
                        "code": "4560"
                    }, {
                        "n": "招远市",
                        "code": "4562"
                    }
                ]
            }, {
                "n": "枣庄市",
                "code": "357",
                "a": [
                    {
                        "n": "滕州市",
                        "code": "4541"
                    }, {
                        "n": "枣庄市",
                        "code": "4540"
                    }
                ]
            }, {
                "n": "淄博市",
                "code": "377",
                "a": [
                    {
                        "n": "高青县",
                        "code": "4535"
                    }, {
                        "n": "桓台县",
                        "code": "4531"
                    }, {
                        "n": "沂源县",
                        "code": "4536"
                    }, {
                        "n": "淄博市",
                        "code": "4530"
                    }
                ]
            }
        ]
    }, {
        "p" : "湖北省",
        "code" : "17",
        "c" : [
            {
                "n": "鄂州市",
                "code": "97",
                "a": [
                    {
                        "n": "鄂州市",
                        "code": "5310"
                    }
                ]
            }, {
                "n": "恩施土家族苗族自治州",
                "code": "98",
                "a": [
                    {
                        "n": "巴东县",
                        "code": "5414"
                    }, {
                        "n": "恩施土家族苗族自治州",
                        "code": "5410"
                    }, {
                        "n": "鹤峰县",
                        "code": "5418"
                    }, {
                        "n": "建始县",
                        "code": "5413"
                    }, {
                        "n": "来凤县",
                        "code": "5417"
                    }, {
                        "n": "利川市",
                        "code": "5412"
                    }, {
                        "n": "咸丰县",
                        "code": "5416"
                    }, {
                        "n": "宣恩县",
                        "code": "5415"
                    }
                ]
            }, {
                "n": "黄冈市",
                "code": "148",
                "a": [
                    {
                        "n": "红安县",
                        "code": "5334"
                    }, {
                        "n": "黄冈市",
                        "code": "5330"
                    }, {
                        "n": "黄梅县",
                        "code": "5339"
                    }, {
                        "n": "罗田县",
                        "code": "5335"
                    }, {
                        "n": "麻城市",
                        "code": "5331"
                    }, {
                        "n": "蕲春县",
                        "code": "5338"
                    }, {
                        "n": "团风县",
                        "code": "5333"
                    }, {
                        "n": "武穴市",
                        "code": "5332"
                    }, {
                        "n": "浠水县",
                        "code": "5337"
                    }, {
                        "n": "英山县",
                        "code": "5336"
                    }
                ]
            }, {
                "n": "黄石市",
                "code": "151",
                "a": [
                    {
                        "n": "大冶市",
                        "code": "5221"
                    }, {
                        "n": "黄石市",
                        "code": "5220"
                    }, {
                        "n": "阳新县",
                        "code": "5367"
                    }
                ]
            }, {
                "n": "荆门市",
                "code": "170",
                "a": [
                    {
                        "n": "京山县",
                        "code": "5382"
                    }, {
                        "n": "荆门市",
                        "code": "5320"
                    }, {
                        "n": "沙洋县",
                        "code": "5383"
                    }, {
                        "n": "钟祥市",
                        "code": "5381"
                    }
                ]
            }, {
                "n": "荆州市",
                "code": "171",
                "a": [
                    {
                        "n": "公安县",
                        "code": "5378"
                    }, {
                        "n": "洪湖市",
                        "code": "5373"
                    }, {
                        "n": "监利县",
                        "code": "5379"
                    }, {
                        "n": "荆州市",
                        "code": "5370"
                    }, {
                        "n": "潜江市",
                        "code": "5375"
                    }, {
                        "n": "石首市",
                        "code": "5372"
                    }, {
                        "n": "松滋市",
                        "code": "5377"
                    }, {
                        "n": "天门市",
                        "code": "5374"
                    }, {
                        "n": "仙桃市",
                        "code": "5371"
                    }
                ]
            }, {
                "n": "十堰市",
                "code": "268",
                "a": [
                    {
                        "n": "丹江口市",
                        "code": "5391"
                    }, {
                        "n": "房县",
                        "code": "5396"
                    }, {
                        "n": "神农架林区",
                        "code": "5311"
                    }, {
                        "n": "十堰市",
                        "code": "5230"
                    }, {
                        "n": "郧西县",
                        "code": "5393"
                    }, {
                        "n": "郧县",
                        "code": "5392"
                    }, {
                        "n": "竹山县",
                        "code": "5394"
                    }, {
                        "n": "竹溪县",
                        "code": "5395"
                    }
                ]
            }, {
                "n": "随州市",
                "code": "281",
                "a": [
                    {
                        "n": "广水市",
                        "code": "5354"
                    }, {
                        "n": "随州市",
                        "code": "5286"
                    }
                ]
            }, {
                "n": "武汉市",
                "code": "311",
                "a": [
                    {
                        "n": "武汉市",
                        "code": "5210"
                    }
                ]
            }, {
                "n": "咸宁市",
                "code": "318",
                "a": [
                    {
                        "n": "赤壁市",
                        "code": "5362"
                    }, {
                        "n": "崇阳县",
                        "code": "5365"
                    }, {
                        "n": "嘉鱼县",
                        "code": "5363"
                    }, {
                        "n": "通城县",
                        "code": "5364"
                    }, {
                        "n": "通山县",
                        "code": "5366"
                    }, {
                        "n": "咸宁市",
                        "code": "5360"
                    }
                ]
            }, {
                "n": "襄阳市",
                "code": "321",
                "a": [
                    {
                        "n": "保康县",
                        "code": "5285"
                    }, {
                        "n": "谷城县",
                        "code": "5284"
                    }, {
                        "n": "老河口市",
                        "code": "5287"
                    }, {
                        "n": "南漳县",
                        "code": "5283"
                    }, {
                        "n": "襄阳市",
                        "code": "5280"
                    }, {
                        "n": "宜城县",
                        "code": "5282"
                    }, {
                        "n": "枣阳市",
                        "code": "5288"
                    }
                ]
            }, {
                "n": "孝感市",
                "code": "322",
                "a": [
                    {
                        "n": "安陆市",
                        "code": "5353"
                    }, {
                        "n": "大悟县",
                        "code": "5355"
                    }, {
                        "n": "汉川县",
                        "code": "5357"
                    }, {
                        "n": "孝昌县",
                        "code": "5351"
                    }, {
                        "n": "孝感市",
                        "code": "5350"
                    }, {
                        "n": "应城市",
                        "code": "5352"
                    }, {
                        "n": "云梦县",
                        "code": "5356"
                    }
                ]
            }, {
                "n": "宜昌市",
                "code": "343",
                "a": [
                    {
                        "n": "长阳县",
                        "code": "5268"
                    }, {
                        "n": "当阳市",
                        "code": "5262"
                    }, {
                        "n": "五峰县",
                        "code": "5269"
                    }, {
                        "n": "兴山县",
                        "code": "5266"
                    }, {
                        "n": "宜昌市",
                        "code": "5260"
                    }, {
                        "n": "宜昌县",
                        "code": "5263"
                    }, {
                        "n": "宜都市",
                        "code": "5261"
                    }, {
                        "n": "远安县",
                        "code": "5265"
                    }, {
                        "n": "枝江市",
                        "code": "5264"
                    }, {
                        "n": "秭归县",
                        "code": "5267"
                    }
                ]
            }
        ]
    }, {
        "p" : "吉林省",
        "code" : "18",
        "c" : [
            {
                "n": "白城市",
                "code": "46",
                "a": [
                    {
                        "n": "白城市",
                        "code": "2470"
                    }, {
                        "n": "大安市",
                        "code": "2474"
                    }, {
                        "n": "洮南市",
                        "code": "2472"
                    }, {
                        "n": "通榆县",
                        "code": "2478"
                    }, {
                        "n": "镇赉县",
                        "code": "2477"
                    }
                ]
            }, {
                "n": "白山市",
                "code": "47",
                "a": [
                    {
                        "n": "白山市",
                        "code": "2460"
                    }, {
                        "n": "长白县",
                        "code": "2463"
                    }, {
                        "n": "抚松县",
                        "code": "2461"
                    }, {
                        "n": "江源县",
                        "code": "2464"
                    }, {
                        "n": "靖宇县",
                        "code": "2462"
                    }, {
                        "n": "临江市",
                        "code": "2422"
                    }
                ]
            }, {
                "n": "长春市",
                "code": "66",
                "a": [
                    {
                        "n": "长春市",
                        "code": "2410"
                    }, {
                        "n": "德惠市",
                        "code": "2410"
                    }, {
                        "n": "九台市",
                        "code": "2410"
                    }, {
                        "n": "农安县",
                        "code": "2410"
                    }, {
                        "n": "榆树市",
                        "code": "2410"
                    }
                ]
            }, {
                "n": "吉林市",
                "code": "155",
                "a": [
                    {
                        "n": "桦甸市",
                        "code": "2425"
                    }, {
                        "n": "吉林市",
                        "code": "2420"
                    }, {
                        "n": "蛟河市",
                        "code": "2424"
                    }, {
                        "n": "磐石市",
                        "code": "2423"
                    }, {
                        "n": "舒兰市",
                        "code": "2426"
                    }, {
                        "n": "永吉县",
                        "code": "2421"
                    }
                ]
            }, {
                "n": "辽源市",
                "code": "191",
                "a": [
                    {
                        "n": "东丰县",
                        "code": "2441"
                    }, {
                        "n": "东辽县",
                        "code": "2442"
                    }, {
                        "n": "辽源市",
                        "code": "2440"
                    }
                ]
            }, {
                "n": "四平市",
                "code": "275",
                "a": [
                    {
                        "n": "公主岭市",
                        "code": "2434"
                    }, {
                        "n": "梨树县",
                        "code": "2431"
                    }, {
                        "n": "双辽市",
                        "code": "2433"
                    }, {
                        "n": "四平市",
                        "code": "2430"
                    }, {
                        "n": "伊通县",
                        "code": "2432"
                    }
                ]
            }, {
                "n": "松原市",
                "code": "276",
                "a": [
                    {
                        "n": "长岭县",
                        "code": "2475"
                    }, {
                        "n": "扶余县",
                        "code": "2473"
                    }, {
                        "n": "前郭县",
                        "code": "2476"
                    }, {
                        "n": "乾安县",
                        "code": "2479"
                    }, {
                        "n": "松原市",
                        "code": "2520"
                    }
                ]
            }, {
                "n": "通化市",
                "code": "292",
                "a": [
                    {
                        "n": "辉南县",
                        "code": "2452"
                    }, {
                        "n": "集安市",
                        "code": "2455"
                    }, {
                        "n": "柳河县",
                        "code": "2453"
                    }, {
                        "n": "梅河口市",
                        "code": "2454"
                    }, {
                        "n": "通化市",
                        "code": "2450"
                    }, {
                        "n": "通化县",
                        "code": "2451"
                    }
                ]
            }, {
                "n": "延边州",
                "code": "335",
                "a": [
                    {
                        "n": "安图县",
                        "code": "2498"
                    }, {
                        "n": "敦化市",
                        "code": "2493"
                    }, {
                        "n": "和龙市",
                        "code": "2496"
                    }, {
                        "n": "珲春市",
                        "code": "2494"
                    }, {
                        "n": "龙井市",
                        "code": "2495"
                    }, {
                        "n": "图们市",
                        "code": "2492"
                    }, {
                        "n": "汪清县",
                        "code": "2497"
                    }, {
                        "n": "延吉市",
                        "code": "2490"
                    }
                ]
            }
        ]
    }, {
        "p" : "上海市",
        "code" : "19",
        "c" : [
            {
                "n": "上海市",
                "code": "261",
                "a": [
                    {
                        "n": "上海市",
                        "code": "2900"
                    }
                ]
            }
        ]
    }, {
        "p" : "江苏省",
        "code" : "20",
        "c" : [
            {
                "n": "常州市",
                "code": "70",
                "a": [
                    {
                        "n": "常州市",
                        "code": "3040"
                    }, {
                        "n": "金坛市",
                        "code": "3042"
                    }, {
                        "n": "溧阳市",
                        "code": "3043"
                    }
                ]
            }, {
                "n": "淮安市",
                "code": "145",
                "a": [
                    {
                        "n": "洪泽县",
                        "code": "3087"
                    }, {
                        "n": "淮安市",
                        "code": "3080"
                    }, {
                        "n": "金湖县",
                        "code": "3089"
                    }, {
                        "n": "涟水县",
                        "code": "3085"
                    }, {
                        "n": "盱眙县",
                        "code": "3088"
                    }
                ]
            }, {
                "n": "连云港市",
                "code": "188",
                "a": [
                    {
                        "n": "东海县",
                        "code": "3072"
                    }, {
                        "n": "赣榆县",
                        "code": "3071"
                    }, {
                        "n": "灌南县",
                        "code": "3082"
                    }, {
                        "n": "灌云县",
                        "code": "3073"
                    }, {
                        "n": "连云港市",
                        "code": "3070"
                    }
                ]
            }, {
                "n": "南京市",
                "code": "220",
                "a": [
                    {
                        "n": "高淳县",
                        "code": "3010"
                    }, {
                        "n": "溧水县",
                        "code": "3010"
                    }, {
                        "n": "南京市",
                        "code": "3010"
                    }
                ]
            }, {
                "n": "南通市",
                "code": "223",
                "a": [
                    {
                        "n": "海安县",
                        "code": "3061"
                    }, {
                        "n": "海门市",
                        "code": "3065"
                    }, {
                        "n": "南通市",
                        "code": "3060"
                    }, {
                        "n": "启东市",
                        "code": "3066"
                    }, {
                        "n": "如东县",
                        "code": "3063"
                    }, {
                        "n": "如皋市",
                        "code": "3062"
                    }, {
                        "n": "通州市",
                        "code": "3084"
                    }
                ]
            }, {
                "n": "苏州市",
                "code": "277",
                "a": [
                    {
                        "n": "常熟市",
                        "code": "3055"
                    }, {
                        "n": "昆山市",
                        "code": "3052"
                    }, {
                        "n": "苏州市",
                        "code": "3050"
                    }, {
                        "n": "太仓市",
                        "code": "3051"
                    }, {
                        "n": "吴江市",
                        "code": "3054"
                    }, {
                        "n": "张家港市",
                        "code": "3056"
                    }
                ]
            }, {
                "n": "宿迁市",
                "code": "278",
                "a": [
                    {
                        "n": "沭阳县",
                        "code": "3083"
                    }, {
                        "n": "泗洪县",
                        "code": "3086"
                    }, {
                        "n": "泗阳县",
                        "code": "3093"
                    }, {
                        "n": "宿迁市",
                        "code": "3090"
                    }, {
                        "n": "宿豫县",
                        "code": "3094"
                    }
                ]
            }, {
                "n": "泰州市",
                "code": "287",
                "a": [
                    {
                        "n": "姜堰市",
                        "code": "3132"
                    }, {
                        "n": "靖江市",
                        "code": "3123"
                    }, {
                        "n": "泰兴市",
                        "code": "3124"
                    }, {
                        "n": "泰州市",
                        "code": "3128"
                    }, {
                        "n": "兴化市",
                        "code": "3131"
                    }
                ]
            }, {
                "n": "无锡市",
                "code": "307",
                "a": [
                    {
                        "n": "江阴市",
                        "code": "3022"
                    }, {
                        "n": "无锡市",
                        "code": "3020"
                    }, {
                        "n": "宜兴市",
                        "code": "3023"
                    }
                ]
            }, {
                "n": "徐州市",
                "code": "329",
                "a": [
                    {
                        "n": "丰县",
                        "code": "3031"
                    }, {
                        "n": "沛县",
                        "code": "3032"
                    }, {
                        "n": "邳州市",
                        "code": "3035"
                    }, {
                        "n": "睢宁县",
                        "code": "3034"
                    }, {
                        "n": "铜山县",
                        "code": "3033"
                    }, {
                        "n": "新沂市",
                        "code": "3036"
                    }, {
                        "n": "徐州市",
                        "code": "3030"
                    }
                ]
            }, {
                "n": "盐城市",
                "code": "336",
                "a": [
                    {
                        "n": "滨海县",
                        "code": "3112"
                    }, {
                        "n": "大丰市",
                        "code": "3116"
                    }, {
                        "n": "东台市",
                        "code": "3117"
                    }, {
                        "n": "阜宁县",
                        "code": "3113"
                    }, {
                        "n": "建湖县",
                        "code": "3115"
                    }, {
                        "n": "射阳县",
                        "code": "3114"
                    }, {
                        "n": "响水县",
                        "code": "3111"
                    }, {
                        "n": "盐城市",
                        "code": "3110"
                    }, {
                        "n": "盐都县",
                        "code": "3118"
                    }
                ]
            }, {
                "n": "扬州市",
                "code": "337",
                "a": [
                    {
                        "n": "宝应县",
                        "code": "3122"
                    }, {
                        "n": "高邮市",
                        "code": "3121"
                    }, {
                        "n": "江都市",
                        "code": "3125"
                    }, {
                        "n": "扬州市",
                        "code": "3120"
                    }, {
                        "n": "仪征市",
                        "code": "3129"
                    }
                ]
            }, {
                "n": "镇江市",
                "code": "366",
                "a": [
                    {
                        "n": "丹阳市",
                        "code": "3141"
                    }, {
                        "n": "句容市",
                        "code": "3142"
                    }, {
                        "n": "扬中市",
                        "code": "3143"
                    }, {
                        "n": "镇江市",
                        "code": "3140"
                    }
                ]
            }
        ]
    }, {
        "p" : "辽宁省",
        "code" : "21",
        "c" : [
            {
                "n": "鞍山市",
                "code": "42",
                "a": [
                    {
                        "n": "鞍山市",
                        "code": "2230"
                    }, {
                        "n": "海城市",
                        "code": "2232"
                    }, {
                        "n": "台安县",
                        "code": "2231"
                    }, {
                        "n": "岫岩县",
                        "code": "2265"
                    }
                ]
            }, {
                "n": "本溪市",
                "code": "57",
                "a": [
                    {
                        "n": "本溪市",
                        "code": "2250"
                    }, {
                        "n": "本溪县",
                        "code": "2251"
                    }, {
                        "n": "桓仁县",
                        "code": "2252"
                    }
                ]
            }, {
                "n": "朝阳市",
                "code": "72",
                "a": [
                    {
                        "n": "北票市",
                        "code": "2346"
                    }, {
                        "n": "朝阳市",
                        "code": "2340"
                    }, {
                        "n": "建平县",
                        "code": "2342"
                    }, {
                        "n": "喀左县",
                        "code": "2243"
                    }, {
                        "n": "凌源市",
                        "code": "2343"
                    }
                ]
            }, {
                "n": "大连市",
                "code": "84",
                "a": [
                    {
                        "n": "长海县",
                        "code": "2225"
                    }, {
                        "n": "大连市",
                        "code": "2220"
                    }, {
                        "n": "普兰店市",
                        "code": "2222"
                    }, {
                        "n": "瓦房店市",
                        "code": "2224"
                    }, {
                        "n": "庄河市",
                        "code": "2223"
                    }
                ]
            }, {
                "n": "丹东市",
                "code": "88",
                "a": [
                    {
                        "n": "丹东市",
                        "code": "2260"
                    }, {
                        "n": "东港市",
                        "code": "2263"
                    }, {
                        "n": "凤城市",
                        "code": "2261"
                    }, {
                        "n": "宽甸县",
                        "code": "2264"
                    }
                ]
            }, {
                "n": "抚顺市",
                "code": "103",
                "a": [
                    {
                        "n": "抚顺市",
                        "code": "2240"
                    }, {
                        "n": "抚顺县",
                        "code": "2241"
                    }, {
                        "n": "清原县",
                        "code": "2344"
                    }, {
                        "n": "新宾县",
                        "code": "2242"
                    }
                ]
            }, {
                "n": "阜新市",
                "code": "105",
                "a": [
                    {
                        "n": "阜新市",
                        "code": "2290"
                    }, {
                        "n": "阜新县",
                        "code": "2291"
                    }, {
                        "n": "彰武县",
                        "code": "2292"
                    }
                ]
            }, {
                "n": "葫芦岛市",
                "code": "143",
                "a": [
                    {
                        "n": "葫芦岛市",
                        "code": "2276"
                    }, {
                        "n": "建昌县",
                        "code": "2345"
                    }, {
                        "n": "绥中县",
                        "code": "2271"
                    }, {
                        "n": "兴城市",
                        "code": "2277"
                    }
                ]
            }, {
                "n": "锦州市",
                "code": "167",
                "a": [
                    {
                        "n": "北宁市",
                        "code": "2273"
                    }, {
                        "n": "黑山县",
                        "code": "2274"
                    }, {
                        "n": "锦州市",
                        "code": "2270"
                    }, {
                        "n": "凌海市",
                        "code": "2272"
                    }, {
                        "n": "义县",
                        "code": "2275"
                    }
                ]
            }, {
                "n": "辽阳市",
                "code": "190",
                "a": [
                    {
                        "n": "灯塔市",
                        "code": "2312"
                    }, {
                        "n": "辽阳市",
                        "code": "2310"
                    }, {
                        "n": "辽阳县",
                        "code": "2311"
                    }
                ]
            }, {
                "n": "盘锦市",
                "code": "229",
                "a": [
                    {
                        "n": "大洼县",
                        "code": "2321"
                    }, {
                        "n": "盘锦市",
                        "code": "2320"
                    }, {
                        "n": "盘山县",
                        "code": "2322"
                    }
                ]
            }, {
                "n": "沈阳市",
                "code": "267",
                "a": [
                    {
                        "n": "法库县",
                        "code": "2210"
                    }, {
                        "n": "康平县",
                        "code": "2210"
                    }, {
                        "n": "辽中县",
                        "code": "2210"
                    }, {
                        "n": "沈阳市",
                        "code": "2210"
                    }, {
                        "n": "新民市",
                        "code": "2210"
                    }
                ]
            }, {
                "n": "铁岭市",
                "code": "291",
                "a": [
                    {
                        "n": "昌图县",
                        "code": "2333"
                    }, {
                        "n": "调兵山市",
                        "code": "2336"
                    }, {
                        "n": "开原市",
                        "code": "2337"
                    }, {
                        "n": "铁岭市",
                        "code": "2330"
                    }, {
                        "n": "西丰县",
                        "code": "2332"
                    }
                ]
            }, {
                "n": "营口市",
                "code": "348",
                "a": [
                    {
                        "n": "大石桥市",
                        "code": "2262"
                    }, {
                        "n": "盖州市",
                        "code": "2282"
                    }, {
                        "n": "营口市",
                        "code": "2280"
                    }
                ]
            }
        ]
    }, {
        "p" : "山西省",
        "code" : "22",
        "c" : [
            {
                "n": "长治市",
                "code": "68",
                "a": [
                    {
                        "n": "长治市",
                        "code": "1640"
                    }, {
                        "n": "长治县",
                        "code": "1661"
                    }, {
                        "n": "长子县",
                        "code": "1668"
                    }, {
                        "n": "壶关县",
                        "code": "1667"
                    }, {
                        "n": "黎城县",
                        "code": "1666"
                    }, {
                        "n": "潞城市",
                        "code": "1662"
                    }, {
                        "n": "平顺县",
                        "code": "1665"
                    }, {
                        "n": "沁县",
                        "code": "1671"
                    }, {
                        "n": "沁源县",
                        "code": "1672"
                    }, {
                        "n": "屯留县",
                        "code": "1664"
                    }, {
                        "n": "武乡县",
                        "code": "1669"
                    }, {
                        "n": "襄垣县",
                        "code": "1663"
                    }
                ]
            }, {
                "n": "大同市",
                "code": "86",
                "a": [
                    {
                        "n": "大同市",
                        "code": "1620"
                    }, {
                        "n": "大同县",
                        "code": "1639"
                    }, {
                        "n": "广灵县",
                        "code": "1633"
                    }, {
                        "n": "浑源县",
                        "code": "1635"
                    }, {
                        "n": "灵邱县",
                        "code": "1634"
                    }, {
                        "n": "天镇县",
                        "code": "1632"
                    }, {
                        "n": "阳高县",
                        "code": "1631"
                    }, {
                        "n": "左云县",
                        "code": "1637"
                    }
                ]
            }, {
                "n": "晋城市",
                "code": "168",
                "a": [
                    {
                        "n": "高平市",
                        "code": "1683"
                    }, {
                        "n": "晋城市",
                        "code": "1680"
                    }, {
                        "n": "陵川县",
                        "code": "1684"
                    }, {
                        "n": "沁水县",
                        "code": "1681"
                    }, {
                        "n": "阳城县",
                        "code": "1682"
                    }
                ]
            }, {
                "n": "晋中市",
                "code": "169",
                "a": [
                    {
                        "n": "和顺县",
                        "code": "1754"
                    }, {
                        "n": "介休市",
                        "code": "1761"
                    }, {
                        "n": "晋中市",
                        "code": "1750"
                    }, {
                        "n": "灵石县",
                        "code": "1762"
                    }, {
                        "n": "平遥县",
                        "code": "1759"
                    }, {
                        "n": "祁县",
                        "code": "1758"
                    }, {
                        "n": "寿阳县",
                        "code": "1756"
                    }, {
                        "n": "太谷县",
                        "code": "1757"
                    }, {
                        "n": "昔阳县",
                        "code": "1755"
                    }, {
                        "n": "榆社县",
                        "code": "1752"
                    }, {
                        "n": "左权县",
                        "code": "1753"
                    }
                ]
            }, {
                "n": "临汾市",
                "code": "196",
                "a": [
                    {
                        "n": "安泽县",
                        "code": "1779"
                    }, {
                        "n": "大宁县",
                        "code": "1785"
                    }, {
                        "n": "汾西县",
                        "code": "1788"
                    }, {
                        "n": "浮山县",
                        "code": "1781"
                    }, {
                        "n": "古县",
                        "code": "1778"
                    }, {
                        "n": "洪洞县",
                        "code": "1776"
                    }, {
                        "n": "侯马市",
                        "code": "1772"
                    }, {
                        "n": "霍州市",
                        "code": "1777"
                    }, {
                        "n": "吉县",
                        "code": "1782"
                    }, {
                        "n": "临汾市",
                        "code": "1770"
                    }, {
                        "n": "蒲县",
                        "code": "1784"
                    }, {
                        "n": "曲沃县",
                        "code": "1773"
                    }, {
                        "n": "隰县",
                        "code": "1787"
                    }, {
                        "n": "乡宁县",
                        "code": "1783"
                    }, {
                        "n": "襄汾县",
                        "code": "1775"
                    }, {
                        "n": "翼城县",
                        "code": "1774"
                    }, {
                        "n": "永和县",
                        "code": "1786"
                    }
                ]
            }, {
                "n": "吕梁市",
                "code": "206",
                "a": [
                    {
                        "n": "方山县",
                        "code": "1741"
                    }, {
                        "n": "汾阳市",
                        "code": "1731"
                    }, {
                        "n": "交城县",
                        "code": "1733"
                    }, {
                        "n": "交口县",
                        "code": "1744"
                    }, {
                        "n": "岚县",
                        "code": "1739"
                    }, {
                        "n": "临县",
                        "code": "1736"
                    }, {
                        "n": "柳林县",
                        "code": "1737"
                    }, {
                        "n": "吕梁市",
                        "code": "1730"
                    }, {
                        "n": "石楼县",
                        "code": "1738"
                    }, {
                        "n": "文水县",
                        "code": "1732"
                    }, {
                        "n": "孝义市",
                        "code": "1734"
                    }, {
                        "n": "兴县",
                        "code": "1735"
                    }, {
                        "n": "中阳县",
                        "code": "1743"
                    }
                ]
            }, {
                "n": "朔州市",
                "code": "273",
                "a": [
                    {
                        "n": "怀仁县",
                        "code": "1641"
                    }, {
                        "n": "山阴县",
                        "code": "1691"
                    }, {
                        "n": "朔州市",
                        "code": "1690"
                    }, {
                        "n": "应县",
                        "code": "1636"
                    }, {
                        "n": "右玉县",
                        "code": "1638"
                    }
                ]
            }, {
                "n": "太原市",
                "code": "285",
                "a": [
                    {
                        "n": "古交市",
                        "code": "1610"
                    }, {
                        "n": "娄烦县",
                        "code": "1610"
                    }, {
                        "n": "清徐县",
                        "code": "1610"
                    }, {
                        "n": "太原市",
                        "code": "1610"
                    }, {
                        "n": "阳曲县",
                        "code": "1610"
                    }
                ]
            }, {
                "n": "忻州市",
                "code": "323",
                "a": [
                    {
                        "n": "保德县",
                        "code": "1724"
                    }, {
                        "n": "代县",
                        "code": "1715"
                    }, {
                        "n": "定襄县",
                        "code": "1712"
                    }, {
                        "n": "繁峙县",
                        "code": "1716"
                    }, {
                        "n": "河曲县",
                        "code": "1723"
                    }, {
                        "n": "静乐县",
                        "code": "1718"
                    }, {
                        "n": "岢岚县",
                        "code": "1722"
                    }, {
                        "n": "宁武县",
                        "code": "1717"
                    }, {
                        "n": "偏关县",
                        "code": "1725"
                    }, {
                        "n": "神池县",
                        "code": "1719"
                    }, {
                        "n": "五台县",
                        "code": "1713"
                    }, {
                        "n": "五寨县",
                        "code": "1721"
                    }, {
                        "n": "忻州市",
                        "code": "1710"
                    }, {
                        "n": "原平市",
                        "code": "1714"
                    }
                ]
            }, {
                "n": "阳泉市",
                "code": "339",
                "a": [
                    {
                        "n": "平定县",
                        "code": "1651"
                    }, {
                        "n": "阳泉市",
                        "code": "1630"
                    }, {
                        "n": "盂县",
                        "code": "1652"
                    }
                ]
            }, {
                "n": "运城市",
                "code": "356",
                "a": [
                    {
                        "n": "河津市",
                        "code": "1818"
                    }, {
                        "n": "稷山县",
                        "code": "1817"
                    }, {
                        "n": "绛县",
                        "code": "1822"
                    }, {
                        "n": "临猗县",
                        "code": "1814"
                    }, {
                        "n": "平陆县",
                        "code": "1823"
                    }, {
                        "n": "芮城县",
                        "code": "1813"
                    }, {
                        "n": "万荣县",
                        "code": "1815"
                    }, {
                        "n": "闻喜县",
                        "code": "1819"
                    }, {
                        "n": "夏县",
                        "code": "1821"
                    }, {
                        "n": "新绛县",
                        "code": "1816"
                    }, {
                        "n": "永济市",
                        "code": "1812"
                    }, {
                        "n": "垣曲县",
                        "code": "1824"
                    }, {
                        "n": "运城市",
                        "code": "1810"
                    }
                ]
            }
        ]
    }, {
        "p" : "新疆",
        "code" : "23",
        "c" : [
            {
                "n": "阿克苏地区",
                "code": "33",
                "a": [
                    {
                        "n": "阿克苏市",
                        "code": "8910"
                    }, {
                        "n": "阿拉尔市",
                        "code": "9031"
                    }, {
                        "n": "阿瓦提县",
                        "code": "8918"
                    }, {
                        "n": "拜城县",
                        "code": "8916"
                    }, {
                        "n": "柯坪县",
                        "code": "8919"
                    }, {
                        "n": "库车县",
                        "code": "8913"
                    }, {
                        "n": "沙雅县",
                        "code": "8914"
                    }, {
                        "n": "温宿县",
                        "code": "8912"
                    }, {
                        "n": "乌什县",
                        "code": "8917"
                    }, {
                        "n": "新和县",
                        "code": "8915"
                    }
                ]
            }, {
                "n": "阿勒泰地区",
                "code": "35",
                "a": [
                    {
                        "n": "阿勒泰市",
                        "code": "9020"
                    }, {
                        "n": "北屯镇",
                        "code": "8844"
                    }, {
                        "n": "布尔津县",
                        "code": "9022"
                    }, {
                        "n": "福海县",
                        "code": "9024"
                    }, {
                        "n": "富蕴县",
                        "code": "9023"
                    }, {
                        "n": "哈巴河县",
                        "code": "9025"
                    }, {
                        "n": "吉木乃县",
                        "code": "9027"
                    }, {
                        "n": "青河县",
                        "code": "9026"
                    }
                ]
            }, {
                "n": "巴音郭楞蒙古自治州",
                "code": "44",
                "a": [
                    {
                        "n": "博湖县",
                        "code": "8889"
                    }, {
                        "n": "和静县",
                        "code": "8887"
                    }, {
                        "n": "和硕县",
                        "code": "8888"
                    }, {
                        "n": "库尔勒市",
                        "code": "8880"
                    }, {
                        "n": "轮台县",
                        "code": "8882"
                    }, {
                        "n": "且末县",
                        "code": "8885"
                    }, {
                        "n": "若羌县",
                        "code": "8884"
                    }, {
                        "n": "尉犁县",
                        "code": "8883"
                    }, {
                        "n": "焉耆回族自治县",
                        "code": "8886"
                    }
                ]
            }, {
                "n": "博尔塔拉蒙古自治州",
                "code": "61",
                "a": [
                    {
                        "n": "阿拉山口口岸",
                        "code": "8847"
                    }, {
                        "n": "博乐市",
                        "code": "8870"
                    }, {
                        "n": "精河县",
                        "code": "8872"
                    }, {
                        "n": "温泉县",
                        "code": "8873"
                    }
                ]
            }, {
                "n": "昌吉回族自治州",
                "code": "65",
                "a": [
                    {
                        "n": "昌吉市",
                        "code": "8850"
                    }, {
                        "n": "阜康市",
                        "code": "8856"
                    }, {
                        "n": "呼图壁县",
                        "code": "8853"
                    }, {
                        "n": "吉木萨尔县",
                        "code": "8857"
                    }, {
                        "n": "玛纳斯县",
                        "code": "8854"
                    }, {
                        "n": "米泉市",
                        "code": "8852"
                    }, {
                        "n": "木垒哈萨克自治县",
                        "code": "8859"
                    }, {
                        "n": "奇台县",
                        "code": "8855"
                    }, {
                        "n": "五家渠市",
                        "code": "8858"
                    }
                ]
            }, {
                "n": "哈密地区",
                "code": "119",
                "a": [
                    {
                        "n": "巴里坤哈萨克自治县",
                        "code": "8842"
                    }, {
                        "n": "哈密市",
                        "code": "8840"
                    }, {
                        "n": "三道岭地区",
                        "code": "9029"
                    }, {
                        "n": "伊吾县",
                        "code": "8843"
                    }
                ]
            }, {
                "n": "和田地区",
                "code": "129",
                "a": [
                    {
                        "n": "策勒县",
                        "code": "8966"
                    }, {
                        "n": "和田市",
                        "code": "8960"
                    }, {
                        "n": "洛浦县",
                        "code": "8965"
                    }, {
                        "n": "民丰县",
                        "code": "8968"
                    }, {
                        "n": "墨玉县",
                        "code": "8963"
                    }, {
                        "n": "皮山县",
                        "code": "8964"
                    }, {
                        "n": "于田县",
                        "code": "8967"
                    }
                ]
            }, {
                "n": "喀什地区",
                "code": "175",
                "a": [
                    {
                        "n": "巴楚县",
                        "code": "8952"
                    }, {
                        "n": "伽师县",
                        "code": "8951"
                    }, {
                        "n": "喀什市",
                        "code": "8940"
                    }, {
                        "n": "麦盖提县",
                        "code": "8948"
                    }, {
                        "n": "莎车县",
                        "code": "8946"
                    }, {
                        "n": "疏附县",
                        "code": "8942"
                    }, {
                        "n": "疏勒县",
                        "code": "8943"
                    }, {
                        "n": "塔什库尔干塔吉克自治县",
                        "code": "8953"
                    }, {
                        "n": "图木舒克市",
                        "code": "9032"
                    }, {
                        "n": "叶城县",
                        "code": "8947"
                    }, {
                        "n": "英吉沙县",
                        "code": "8944"
                    }, {
                        "n": "岳普湖县",
                        "code": "8949"
                    }, {
                        "n": "泽普县",
                        "code": "8945"
                    }
                ]
            }, {
                "n": "克拉玛依市",
                "code": "177",
                "a": [
                    {
                        "n": "克拉玛依市",
                        "code": "8820"
                    }
                ]
            }, {
                "n": "克孜勒苏柯尔克孜自治州",
                "code": "178",
                "a": [
                    {
                        "n": "阿合奇县",
                        "code": "8933"
                    }, {
                        "n": "阿克陶县",
                        "code": "8932"
                    }, {
                        "n": "阿图什市",
                        "code": "8930"
                    }, {
                        "n": "乌恰县",
                        "code": "8934"
                    }
                ]
            }, {
                "n": "石河子市",
                "code": "269",
                "a": [
                    {
                        "n": "石河子市",
                        "code": "9028"
                    }
                ]
            }, {
                "n": "塔城地区",
                "code": "283",
                "a": [
                    {
                        "n": "额敏县",
                        "code": "9012"
                    }, {
                        "n": "和布克赛尔蒙古自治县",
                        "code": "9017"
                    }, {
                        "n": "沙湾县",
                        "code": "9014"
                    }, {
                        "n": "塔城市",
                        "code": "9010"
                    }, {
                        "n": "托里县",
                        "code": "9015"
                    }, {
                        "n": "乌苏市",
                        "code": "9013"
                    }, {
                        "n": "裕民县",
                        "code": "9016"
                    }
                ]
            }, {
                "n": "吐鲁番地区",
                "code": "297",
                "a": [
                    {
                        "n": "鄯善县",
                        "code": "8832"
                    }, {
                        "n": "吐鲁番市",
                        "code": "8830"
                    }, {
                        "n": "托克逊县",
                        "code": "8833"
                    }
                ]
            }, {
                "n": "乌鲁木齐市",
                "code": "306",
                "a": [
                    {
                        "n": "乌鲁木齐市",
                        "code": "8810"
                    }, {
                        "n": "乌鲁木齐县",
                        "code": "8810"
                    }
                ]
            }, {
                "n": "伊犁哈萨克自治州",
                "code": "341",
                "a": [
                    {
                        "n": "察布查尔锡伯自治县",
                        "code": "8993"
                    }, {
                        "n": "巩留县",
                        "code": "8995"
                    }, {
                        "n": "霍城县",
                        "code": "8994"
                    }, {
                        "n": "奎屯市",
                        "code": "8981"
                    }, {
                        "n": "尼勒克县",
                        "code": "8999"
                    }, {
                        "n": "特克斯县",
                        "code": "8998"
                    }, {
                        "n": "新源县",
                        "code": "8996"
                    }, {
                        "n": "伊宁市",
                        "code": "8980"
                    }, {
                        "n": "伊宁县",
                        "code": "8992"
                    }, {
                        "n": "昭苏县",
                        "code": "8997"
                    }
                ]
            }
        ]
    }, {
        "p" : "河北省",
        "code" : "24",
        "c" : [
            {
                "n": "保定市",
                "code": "53",
                "a": [
                    {
                        "n": "安国市",
                        "code": "1369"
                    }, {
                        "n": "安新县",
                        "code": "1363"
                    }, {
                        "n": "保定市",
                        "code": "1340"
                    }, {
                        "n": "博野县",
                        "code": "1371"
                    }, {
                        "n": "定兴县",
                        "code": "1356"
                    }, {
                        "n": "定州市",
                        "code": "1351"
                    }, {
                        "n": "阜平县",
                        "code": "1368"
                    }, {
                        "n": "高碑店市",
                        "code": "1366"
                    }, {
                        "n": "高阳县",
                        "code": "1362"
                    }, {
                        "n": "涞水县",
                        "code": "1361"
                    }, {
                        "n": "涞源县",
                        "code": "1355"
                    }, {
                        "n": "蠡县",
                        "code": "1372"
                    }, {
                        "n": "满城县",
                        "code": "1341"
                    }, {
                        "n": "清苑县",
                        "code": "1342"
                    }, {
                        "n": "曲阳县",
                        "code": "1367"
                    }, {
                        "n": "容城县",
                        "code": "1365"
                    }, {
                        "n": "顺平县",
                        "code": "1357"
                    }, {
                        "n": "唐县",
                        "code": "1358"
                    }, {
                        "n": "望都县",
                        "code": "1359"
                    }, {
                        "n": "雄县",
                        "code": "1364"
                    }, {
                        "n": "徐水县",
                        "code": "1354"
                    }, {
                        "n": "易县",
                        "code": "1353"
                    }, {
                        "n": "涿州市",
                        "code": "1352"
                    }
                ]
            }, {
                "n": "沧州市",
                "code": "62",
                "a": [
                    {
                        "n": "泊头市",
                        "code": "1441"
                    }, {
                        "n": "沧县",
                        "code": "1431"
                    }, {
                        "n": "沧州市",
                        "code": "1430"
                    }, {
                        "n": "东光县",
                        "code": "1447"
                    }, {
                        "n": "海兴县",
                        "code": "1453"
                    }, {
                        "n": "河间市",
                        "code": "1443"
                    }, {
                        "n": "黄骅市",
                        "code": "1451"
                    }, {
                        "n": "孟村县",
                        "code": "1452"
                    }, {
                        "n": "南皮县",
                        "code": "1448"
                    }, {
                        "n": "青县",
                        "code": "1432"
                    }, {
                        "n": "任丘市",
                        "code": "1442"
                    }, {
                        "n": "肃宁县",
                        "code": "1444"
                    }, {
                        "n": "吴桥县",
                        "code": "1446"
                    }, {
                        "n": "献县",
                        "code": "1445"
                    }, {
                        "n": "盐山县",
                        "code": "1449"
                    }
                ]
            }, {
                "n": "承德市",
                "code": "76",
                "a": [
                    {
                        "n": "承德市",
                        "code": "1410"
                    }, {
                        "n": "承德县",
                        "code": "1411"
                    }, {
                        "n": "丰宁县",
                        "code": "1425"
                    }, {
                        "n": "宽城县",
                        "code": "1421"
                    }, {
                        "n": "隆化县",
                        "code": "1426"
                    }, {
                        "n": "滦平县",
                        "code": "1424"
                    }, {
                        "n": "平泉县",
                        "code": "1423"
                    }, {
                        "n": "围场县",
                        "code": "1427"
                    }, {
                        "n": "兴隆县",
                        "code": "1422"
                    }
                ]
            }, {
                "n": "邯郸市",
                "code": "125",
                "a": [
                    {
                        "n": "成安县",
                        "code": "1288"
                    }, {
                        "n": "磁县",
                        "code": "1291"
                    }, {
                        "n": "大名县",
                        "code": "1281"
                    }, {
                        "n": "肥乡县",
                        "code": "1286"
                    }, {
                        "n": "馆陶县",
                        "code": "1294"
                    }, {
                        "n": "广平县",
                        "code": "1287"
                    }, {
                        "n": "邯郸市",
                        "code": "1270"
                    }, {
                        "n": "邯郸县",
                        "code": "1271"
                    }, {
                        "n": "鸡泽县",
                        "code": "1285"
                    }, {
                        "n": "临漳县",
                        "code": "1289"
                    }, {
                        "n": "邱县",
                        "code": "1284"
                    }, {
                        "n": "曲周县",
                        "code": "1283"
                    }, {
                        "n": "涉县",
                        "code": "1292"
                    }, {
                        "n": "魏县",
                        "code": "1282"
                    }, {
                        "n": "武安市",
                        "code": "1295"
                    }, {
                        "n": "永年县",
                        "code": "1293"
                    }
                ]
            }, {
                "n": "衡水市",
                "code": "137",
                "a": [
                    {
                        "n": "安平县",
                        "code": "1488"
                    }, {
                        "n": "阜城县",
                        "code": "1492"
                    }, {
                        "n": "故城县",
                        "code": "1489"
                    }, {
                        "n": "衡水市",
                        "code": "1480"
                    }, {
                        "n": "冀州市",
                        "code": "1482"
                    }, {
                        "n": "景县",
                        "code": "1491"
                    }, {
                        "n": "饶阳县",
                        "code": "1487"
                    }, {
                        "n": "深州市",
                        "code": "1485"
                    }, {
                        "n": "武强县",
                        "code": "1486"
                    }, {
                        "n": "武邑县",
                        "code": "1484"
                    }, {
                        "n": "枣强县",
                        "code": "1483"
                    }
                ]
            }, {
                "n": "廊坊市",
                "code": "184",
                "a": [
                    {
                        "n": "霸州市",
                        "code": "1467"
                    }, {
                        "n": "大厂县",
                        "code": "1468"
                    }, {
                        "n": "大城县",
                        "code": "1465"
                    }, {
                        "n": "固安县",
                        "code": "1462"
                    }, {
                        "n": "廊坊市",
                        "code": "1460"
                    }, {
                        "n": "三河市",
                        "code": "1461"
                    }, {
                        "n": "文安县",
                        "code": "1466"
                    }, {
                        "n": "香河县",
                        "code": "1464"
                    }, {
                        "n": "永清县",
                        "code": "1463"
                    }
                ]
            }, {
                "n": "秦皇岛市",
                "code": "242",
                "a": [
                    {
                        "n": "昌黎县",
                        "code": "1262"
                    }, {
                        "n": "抚宁县",
                        "code": "1263"
                    }, {
                        "n": "卢龙县",
                        "code": "1264"
                    }, {
                        "n": "秦皇岛市",
                        "code": "1260"
                    }, {
                        "n": "青龙县",
                        "code": "1261"
                    }
                ]
            }, {
                "n": "石家庄市",
                "code": "270",
                "a": [
                    {
                        "n": "高邑县",
                        "code": "1210"
                    }, {
                        "n": "藁城市",
                        "code": "1210"
                    }, {
                        "n": "晋州市",
                        "code": "1210"
                    }, {
                        "n": "井陉县",
                        "code": "1210"
                    }, {
                        "n": "灵寿县",
                        "code": "1210"
                    }, {
                        "n": "鹿泉市",
                        "code": "1210"
                    }, {
                        "n": "栾城县",
                        "code": "1210"
                    }, {
                        "n": "平山县",
                        "code": "1210"
                    }, {
                        "n": "深泽县",
                        "code": "1210"
                    }, {
                        "n": "石家庄市",
                        "code": "1210"
                    }, {
                        "n": "无极县",
                        "code": "1210"
                    }, {
                        "n": "辛集市",
                        "code": "1210"
                    }, {
                        "n": "新乐市",
                        "code": "1210"
                    }, {
                        "n": "行唐县",
                        "code": "1210"
                    }, {
                        "n": "元氏县",
                        "code": "1210"
                    }, {
                        "n": "赞皇县",
                        "code": "1210"
                    }, {
                        "n": "赵县",
                        "code": "1210"
                    }, {
                        "n": "正定县",
                        "code": "1210"
                    }
                ]
            }, {
                "n": "唐山市",
                "code": "288",
                "a": [
                    {
                        "n": "乐亭县",
                        "code": "1245"
                    }, {
                        "n": "滦南县",
                        "code": "1244"
                    }, {
                        "n": "滦县",
                        "code": "1243"
                    }, {
                        "n": "迁安市",
                        "code": "1246"
                    }, {
                        "n": "迁西县",
                        "code": "1247"
                    }, {
                        "n": "唐海县",
                        "code": "1251"
                    }, {
                        "n": "唐山市",
                        "code": "1240"
                    }, {
                        "n": "玉田县",
                        "code": "1249"
                    }, {
                        "n": "遵化市",
                        "code": "1248"
                    }
                ]
            }, {
                "n": "邢台市",
                "code": "328",
                "a": [
                    {
                        "n": "柏乡县",
                        "code": "1325"
                    }, {
                        "n": "广宗县",
                        "code": "1333"
                    }, {
                        "n": "巨鹿县",
                        "code": "1331"
                    }, {
                        "n": "临城县",
                        "code": "1323"
                    }, {
                        "n": "临西县",
                        "code": "1337"
                    }, {
                        "n": "隆尧县",
                        "code": "1326"
                    }, {
                        "n": "内邱县",
                        "code": "1324"
                    }, {
                        "n": "南宫市",
                        "code": "1321"
                    }, {
                        "n": "南和县",
                        "code": "1328"
                    }, {
                        "n": "宁晋县",
                        "code": "1329"
                    }, {
                        "n": "平乡县",
                        "code": "1334"
                    }, {
                        "n": "清河县",
                        "code": "1336"
                    }, {
                        "n": "任县",
                        "code": "1327"
                    }, {
                        "n": "沙河市",
                        "code": "1322"
                    }, {
                        "n": "威县",
                        "code": "1335"
                    }, {
                        "n": "新河县",
                        "code": "1332"
                    }, {
                        "n": "邢台市",
                        "code": "1310"
                    }, {
                        "n": "邢台县",
                        "code": "1311"
                    }
                ]
            }, {
                "n": "张家口市",
                "code": "360",
                "a": [
                    {
                        "n": "赤城县",
                        "code": "1402"
                    }, {
                        "n": "崇礼县",
                        "code": "1403"
                    }, {
                        "n": "沽源县",
                        "code": "1393"
                    }, {
                        "n": "怀安县",
                        "code": "1397"
                    }, {
                        "n": "怀来县",
                        "code": "1399"
                    }, {
                        "n": "康保县",
                        "code": "1392"
                    }, {
                        "n": "尚义县",
                        "code": "1394"
                    }, {
                        "n": "万全县",
                        "code": "1398"
                    }, {
                        "n": "蔚县",
                        "code": "1395"
                    }, {
                        "n": "宣化县",
                        "code": "1381"
                    }, {
                        "n": "阳原县",
                        "code": "1396"
                    }, {
                        "n": "张北县",
                        "code": "1391"
                    }, {
                        "n": "张家口市",
                        "code": "1380"
                    }, {
                        "n": "涿鹿县",
                        "code": "1401"
                    }
                ]
            }
        ]
    }, {
        "p" : "浙江省",
        "code" : "25",
        "c" : [
            {
                "n": "杭州市",
                "code": "127",
                "a": [
                    {
                        "n": "杭州市",
                        "code": "3310"
                    }, {
                        "n": "淳安县",
                        "code": "3311"
                    }, {
                        "n": "富阳市",
                        "code": "3312"
                    },  {
                        "n": "建德市",
                        "code": "3313"
                    }, {
                        "n": "临安市",
                        "code": "3314"
                    }, {
                        "n": "桐庐县",
                        "code": "3315"
                    }
                ]
            }, {
                "n": "湖州市",
                "code": "142",
                "a": [
                    {
                        "n": "安吉县",
                        "code": "3363"
                    }, {
                        "n": "长兴县",
                        "code": "3362"
                    }, {
                        "n": "德清县",
                        "code": "3361"
                    }, {
                        "n": "湖州市",
                        "code": "3360"
                    }
                ]
            }, {
                "n": "嘉兴市",
                "code": "160",
                "a": [
                    {
                        "n": "海宁市",
                        "code": "3355"
                    }, {
                        "n": "海盐县",
                        "code": "3353"
                    }, {
                        "n": "嘉善县",
                        "code": "3351"
                    }, {
                        "n": "嘉兴市",
                        "code": "3350"
                    }, {
                        "n": "平湖市",
                        "code": "3352"
                    }, {
                        "n": "桐乡市",
                        "code": "3354"
                    }
                ]
            }, {
                "n": "金华市",
                "code": "166",
                "a": [
                    {
                        "n": "东阳市",
                        "code": "3388"
                    }, {
                        "n": "金华市",
                        "code": "3380"
                    }, {
                        "n": "兰溪市",
                        "code": "3386"
                    }, {
                        "n": "磐安县",
                        "code": "3385"
                    }, {
                        "n": "浦江县",
                        "code": "3384"
                    }, {
                        "n": "武义县",
                        "code": "3383"
                    }, {
                        "n": "义乌市",
                        "code": "3387"
                    }, {
                        "n": "永康市",
                        "code": "3382"
                    }
                ]
            }, {
                "n": "丽水市",
                "code": "187",
                "a": [
                    {
                        "n": "缙云县",
                        "code": "3435"
                    }, {
                        "n": "景宁县",
                        "code": "3438"
                    }, {
                        "n": "丽水市",
                        "code": "3430"
                    }, {
                        "n": "龙泉市",
                        "code": "3439"
                    }, {
                        "n": "青田县",
                        "code": "3432"
                    }, {
                        "n": "庆元县",
                        "code": "3434"
                    }, {
                        "n": "松阳县",
                        "code": "3437"
                    }, {
                        "n": "遂昌县",
                        "code": "3436"
                    }, {
                        "n": "云和县",
                        "code": "3433"
                    }
                ]
            }, {
                "n": "宁波市",
                "code": "225",
                "a": [
                    {
                        "n": "慈溪市",
                        "code": "3325"
                    }, {
                        "n": "奉化市",
                        "code": "3326"
                    }, {
                        "n": "宁波市",
                        "code": "3320"
                    }, {
                        "n": "宁海县",
                        "code": "3322"
                    }, {
                        "n": "象山县",
                        "code": "3321"
                    }, {
                        "n": "余姚市",
                        "code": "3324"
                    }
                ]
            }, {
                "n": "衢州市",
                "code": "247",
                "a": [
                    {
                        "n": "常山县",
                        "code": "3412"
                    }, {
                        "n": "江山市",
                        "code": "3415"
                    }, {
                        "n": "开化县",
                        "code": "3413"
                    }, {
                        "n": "龙游县",
                        "code": "3414"
                    }, {
                        "n": "衢州市",
                        "code": "3410"
                    }
                ]
            }, {
                "n": "绍兴市",
                "code": "265",
                "a": [
                    {
                        "n": "上虞市",
                        "code": "3372"
                    }, {
                        "n": "绍兴市",
                        "code": "3370"
                    }, {
                        "n": "绍兴县",
                        "code": "3371"
                    }, {
                        "n": "嵊州市",
                        "code": "3373"
                    }, {
                        "n": "新昌县",
                        "code": "3374"
                    }, {
                        "n": "诸暨市",
                        "code": "3375"
                    }
                ]
            }, {
                "n": "台州市",
                "code": "284",
                "a": [
                    {
                        "n": "临海市",
                        "code": "3452"
                    }, {
                        "n": "三门县",
                        "code": "3457"
                    }, {
                        "n": "台州市",
                        "code": "3450"
                    }, {
                        "n": "天台县",
                        "code": "3456"
                    }, {
                        "n": "温岭市",
                        "code": "3454"
                    }, {
                        "n": "仙居县",
                        "code": "3455"
                    }, {
                        "n": "玉环县",
                        "code": "3458"
                    }
                ]
            }, {
                "n": "温州市",
                "code": "302",
                "a": [
                    {
                        "n": "苍南县",
                        "code": "3336"
                    }, {
                        "n": "洞头县",
                        "code": "3332"
                    }, {
                        "n": "乐清市",
                        "code": "3333"
                    }, {
                        "n": "平阳县",
                        "code": "3335"
                    }, {
                        "n": "瑞安市",
                        "code": "3339"
                    }, {
                        "n": "泰顺县",
                        "code": "3338"
                    }, {
                        "n": "温州市",
                        "code": "3330"
                    }, {
                        "n": "文成县",
                        "code": "3337"
                    }, {
                        "n": "永嘉县",
                        "code": "3334"
                    }
                ]
            }, {
                "n": "舟山市",
                "code": "371",
                "a": [
                    {
                        "n": "岱山县",
                        "code": "3421"
                    }, {
                        "n": "嵊泗县",
                        "code": "3422"
                    }, {
                        "n": "舟山市",
                        "code": "3420"
                    }
                ]
            }
        ]
    }, {
        "p" : "甘肃省",
        "code" : "26",
        "c" : [
            {
                "n": "白银市",
                "code": "48",
                "a": [
                    {
                        "n": "白银市",
                        "code": "8240"
                    }, {
                        "n": "会宁县",
                        "code": "8242"
                    }, {
                        "n": "景泰县",
                        "code": "8243"
                    }, {
                        "n": "靖远县",
                        "code": "8241"
                    }, {
                        "n": "平川区",
                        "code": "8244"
                    }
                ]
            }, {
                "n": "定西市",
                "code": "93",
                "a": [
                    {
                        "n": "定西市",
                        "code": "8290"
                    }, {
                        "n": "临洮县",
                        "code": "8295"
                    }, {
                        "n": "陇西县",
                        "code": "8293"
                    }, {
                        "n": "岷县",
                        "code": "8297"
                    }, {
                        "n": "通渭县",
                        "code": "8292"
                    }, {
                        "n": "渭源县",
                        "code": "8294"
                    }, {
                        "n": "漳县",
                        "code": "8296"
                    }
                ]
            }, {
                "n": "甘南州",
                "code": "107",
                "a": [
                    {
                        "n": "迭部县",
                        "code": "8384"
                    }, {
                        "n": "甘南州",
                        "code": "8380"
                    }, {
                        "n": "临潭县",
                        "code": "8381"
                    }, {
                        "n": "碌曲县",
                        "code": "8386"
                    }, {
                        "n": "玛曲县",
                        "code": "8385"
                    }, {
                        "n": "夏河县",
                        "code": "8387"
                    }, {
                        "n": "舟曲县",
                        "code": "8383"
                    }, {
                        "n": "卓尼县",
                        "code": "8382"
                    }
                ]
            }, {
                "n": "嘉峪关市",
                "code": "161",
                "a": [
                    {
                        "n": "嘉峪关市",
                        "code": "8220"
                    }
                ]
            }, {
                "n": "金昌市",
                "code": "165",
                "a": [
                    {
                        "n": "金昌市",
                        "code": "8230"
                    }, {
                        "n": "永昌县",
                        "code": "8231"
                    }
                ]
            }, {
                "n": "酒泉市",
                "code": "174",
                "a": [
                    {
                        "n": "阿克塞县",
                        "code": "8266"
                    }, {
                        "n": "安西县",
                        "code": "8267"
                    }, {
                        "n": "敦煌市",
                        "code": "8263"
                    }, {
                        "n": "金塔县",
                        "code": "8264"
                    }, {
                        "n": "酒泉市",
                        "code": "8260"
                    }, {
                        "n": "肃北县",
                        "code": "8265"
                    }, {
                        "n": "玉门市",
                        "code": "8261"
                    }
                ]
            }, {
                "n": "兰州市",
                "code": "183",
                "a": [
                    {
                        "n": "皋兰县",
                        "code": "8210"
                    }, {
                        "n": "红古区",
                        "code": "8210"
                    }, {
                        "n": "兰州市",
                        "code": "8210"
                    }, {
                        "n": "永登县",
                        "code": "8210"
                    }, {
                        "n": "榆中县",
                        "code": "8210"
                    }
                ]
            }, {
                "n": "临夏州",
                "code": "197",
                "a": [
                    {
                        "n": "东乡县",
                        "code": "8367"
                    }, {
                        "n": "广河县",
                        "code": "8365"
                    }, {
                        "n": "和政县",
                        "code": "8366"
                    }, {
                        "n": "积石山县",
                        "code": "8368"
                    }, {
                        "n": "康乐县",
                        "code": "8363"
                    }, {
                        "n": "临夏州",
                        "code": "8360"
                    }, {
                        "n": "永靖县",
                        "code": "8364"
                    }
                ]
            }, {
                "n": "陇南市",
                "code": "203",
                "a": [
                    {
                        "n": "成县",
                        "code": "8313"
                    }, {
                        "n": "宕昌县",
                        "code": "8312"
                    }, {
                        "n": "徽县",
                        "code": "8319"
                    }, {
                        "n": "康县",
                        "code": "8314"
                    }, {
                        "n": "礼县",
                        "code": "8317"
                    }, {
                        "n": "两当县",
                        "code": "8318"
                    }, {
                        "n": "陇南市",
                        "code": "8310"
                    }, {
                        "n": "文县",
                        "code": "8315"
                    }, {
                        "n": "西和县",
                        "code": "8316"
                    }
                ]
            }, {
                "n": "平凉市",
                "code": "231",
                "a": [
                    {
                        "n": "崇信县",
                        "code": "8334"
                    }, {
                        "n": "华亭县",
                        "code": "8335"
                    }, {
                        "n": "泾川县",
                        "code": "8332"
                    }, {
                        "n": "静宁县",
                        "code": "8337"
                    }, {
                        "n": "灵台县",
                        "code": "8333"
                    }, {
                        "n": "平凉市",
                        "code": "8330"
                    }, {
                        "n": "庄浪县",
                        "code": "8336"
                    }
                ]
            }, {
                "n": "庆阳市",
                "code": "245",
                "a": [
                    {
                        "n": "合水县",
                        "code": "8345"
                    }, {
                        "n": "华池县",
                        "code": "8344"
                    }, {
                        "n": "环县",
                        "code": "8343"
                    }, {
                        "n": "宁县",
                        "code": "8347"
                    }, {
                        "n": "庆城县",
                        "code": "8342"
                    }, {
                        "n": "庆阳市",
                        "code": "8340"
                    }, {
                        "n": "镇原县",
                        "code": "8348"
                    }, {
                        "n": "正宁县",
                        "code": "8346"
                    }
                ]
            }, {
                "n": "天水市",
                "code": "290",
                "a": [
                    {
                        "n": "甘谷县",
                        "code": "8253"
                    }, {
                        "n": "秦安县",
                        "code": "8252"
                    }, {
                        "n": "清水县",
                        "code": "8251"
                    }, {
                        "n": "天水市",
                        "code": "8250"
                    }, {
                        "n": "武山县",
                        "code": "8254"
                    }, {
                        "n": "张家川县",
                        "code": "8255"
                    }
                ]
            }, {
                "n": "武威市",
                "code": "312",
                "a": [
                    {
                        "n": "古浪县",
                        "code": "8283"
                    }, {
                        "n": "民勤县",
                        "code": "8282"
                    }, {
                        "n": "天祝县",
                        "code": "8284"
                    }, {
                        "n": "武威市",
                        "code": "8280"
                    }
                ]
            }, {
                "n": "张掖市",
                "code": "361",
                "a": [
                    {
                        "n": "高台县",
                        "code": "8275"
                    }, {
                        "n": "临泽县",
                        "code": "8274"
                    }, {
                        "n": "民乐县",
                        "code": "8273"
                    }, {
                        "n": "山丹县",
                        "code": "8276"
                    }, {
                        "n": "肃南县",
                        "code": "8272"
                    }, {
                        "n": "张掖市",
                        "code": "8270"
                    }
                ]
            }
        ]
    }, {
        "p" : "重庆市",
        "code" : "27",
        "c" : [
            {
                "n": "涪陵市",
                "code": "101",
                "a": [
                    {
                        "n": "垫江县",
                        "code": "6692"
                    }, {
                        "n": "丰都县",
                        "code": "6694"
                    }, {
                        "n": "涪陵区",
                        "code": "6690"
                    }, {
                        "n": "南川市",
                        "code": "6693"
                    }, {
                        "n": "武隆县",
                        "code": "6695"
                    }
                ]
            }, {
                "n": "黔江市",
                "code": "238",
                "a": [
                    {
                        "n": "彭水县",
                        "code": "6875"
                    }, {
                        "n": "黔江区",
                        "code": "6870"
                    }, {
                        "n": "石柱县",
                        "code": "6871"
                    }, {
                        "n": "秀山县",
                        "code": "6872"
                    }, {
                        "n": "酉阳县",
                        "code": "6874"
                    }
                ]
            }, {
                "n": "万州市",
                "code": "298",
                "a": [
                    {
                        "n": "城口县",
                        "code": "6681"
                    }, {
                        "n": "奉节县",
                        "code": "6677"
                    }, {
                        "n": "开县",
                        "code": "6673"
                    }, {
                        "n": "梁平县",
                        "code": "6675"
                    }, {
                        "n": "万州区",
                        "code": "6670"
                    }, {
                        "n": "巫山县",
                        "code": "6678"
                    }, {
                        "n": "巫溪县",
                        "code": "6679"
                    }, {
                        "n": "云阳县",
                        "code": "6676"
                    }, {
                        "n": "忠县",
                        "code": "6674"
                    }
                ]
            }, {
                "n": "重庆市",
                "code": "370",
                "a": [
                    {
                        "n": "巴南区",
                        "code": "6530"
                    }, {
                        "n": "璧山县",
                        "code": "6530"
                    }, {
                        "n": "长寿区",
                        "code": "6530"
                    }, {
                        "n": "大足县",
                        "code": "6530"
                    }, {
                        "n": "合川市",
                        "code": "6530"
                    }, {
                        "n": "江津市",
                        "code": "6530"
                    }, {
                        "n": "綦江县",
                        "code": "6530"
                    }, {
                        "n": "荣昌县",
                        "code": "6530"
                    }, {
                        "n": "双桥区",
                        "code": "6530"
                    }, {
                        "n": "铜梁县",
                        "code": "6530"
                    }, {
                        "n": "潼南县",
                        "code": "6530"
                    }, {
                        "n": "万盛区",
                        "code": "6530"
                    }, {
                        "n": "永川市",
                        "code": "6530"
                    }, {
                        "n": "渝北区",
                        "code": "6530"
                    }, {
                        "n": "重庆市",
                        "code": "6530"
                    }
                ]
            }
        ]
    }, {
        "p" : "福建省",
        "code" : "28",
        "c" : [
            {
                "n": "福州市",
                "code": "102",
                "a": [
                    {
                        "n": "长乐市",
                        "code": "3910"
                    }, {
                        "n": "福清市",
                        "code": "3910"
                    }, {
                        "n": "福州市",
                        "code": "3910"
                    }, {
                        "n": "连江县",
                        "code": "3910"
                    }, {
                        "n": "罗源县",
                        "code": "3910"
                    }, {
                        "n": "闽侯县",
                        "code": "3910"
                    }, {
                        "n": "闽清县",
                        "code": "3910"
                    }, {
                        "n": "平潭县",
                        "code": "3910"
                    }, {
                        "n": "永泰县",
                        "code": "3910"
                    }
                ]
            }, {
                "n": "龙岩市",
                "code": "202",
                "a": [
                    {
                        "n": "长汀县",
                        "code": "4052"
                    }, {
                        "n": "连城县",
                        "code": "4057"
                    }, {
                        "n": "龙岩市",
                        "code": "4050"
                    }, {
                        "n": "上杭县",
                        "code": "4054"
                    }, {
                        "n": "武平县",
                        "code": "4055"
                    }, {
                        "n": "永定县",
                        "code": "4053"
                    }, {
                        "n": "漳平市",
                        "code": "4056"
                    }
                ]
            }, {
                "n": "南平市",
                "code": "222",
                "a": [
                    {
                        "n": "光泽县",
                        "code": "4018"
                    }, {
                        "n": "建瓯市",
                        "code": "4015"
                    }, {
                        "n": "建阳市",
                        "code": "4014"
                    }, {
                        "n": "南平市",
                        "code": "4010"
                    }, {
                        "n": "浦城县",
                        "code": "4016"
                    }, {
                        "n": "邵武市",
                        "code": "4012"
                    }, {
                        "n": "顺昌县",
                        "code": "4013"
                    }, {
                        "n": "松溪县",
                        "code": "4019"
                    }, {
                        "n": "武夷山市",
                        "code": "4022"
                    }, {
                        "n": "政和县",
                        "code": "4021"
                    }
                ]
            }, {
                "n": "宁德市",
                "code": "226",
                "a": [
                    {
                        "n": "福安市",
                        "code": "4034"
                    }, {
                        "n": "福鼎市",
                        "code": "4032"
                    }, {
                        "n": "古田县",
                        "code": "4035"
                    }, {
                        "n": "宁德市",
                        "code": "4030"
                    }, {
                        "n": "屏南县",
                        "code": "4036"
                    }, {
                        "n": "寿宁县",
                        "code": "4037"
                    }, {
                        "n": "霞浦县",
                        "code": "4033"
                    }, {
                        "n": "柘荣县",
                        "code": "4039"
                    }, {
                        "n": "周宁县",
                        "code": "4038"
                    }
                ]
            }, {
                "n": "莆田市",
                "code": "233",
                "a": [
                    {
                        "n": "莆田市",
                        "code": "3940"
                    }, {
                        "n": "仙游县",
                        "code": "3942"
                    }
                ]
            }, {
                "n": "泉州市",
                "code": "248",
                "a": [
                    {
                        "n": "安溪县",
                        "code": "3974"
                    }, {
                        "n": "德化县",
                        "code": "3976"
                    }, {
                        "n": "惠安县",
                        "code": "3971"
                    }, {
                        "n": "晋江市",
                        "code": "3972"
                    }, {
                        "n": "南安市",
                        "code": "3973"
                    }, {
                        "n": "泉州市",
                        "code": "3970"
                    }, {
                        "n": "石狮市",
                        "code": "3978"
                    }, {
                        "n": "永春县",
                        "code": "3975"
                    }
                ]
            }, {
                "n": "三明市",
                "code": "253",
                "a": [
                    {
                        "n": "大田县",
                        "code": "3954"
                    }, {
                        "n": "建宁县",
                        "code": "3959"
                    }, {
                        "n": "将乐县",
                        "code": "3957"
                    }, {
                        "n": "明溪县",
                        "code": "3951"
                    }, {
                        "n": "宁化县",
                        "code": "3953"
                    }, {
                        "n": "清流县",
                        "code": "3952"
                    }, {
                        "n": "三明市",
                        "code": "3950"
                    }, {
                        "n": "沙县",
                        "code": "3956"
                    }, {
                        "n": "泰宁县",
                        "code": "3958"
                    }, {
                        "n": "永安市",
                        "code": "3960"
                    }, {
                        "n": "尤溪县",
                        "code": "3955"
                    }
                ]
            }, {
                "n": "厦门市",
                "code": "317",
                "a": [
                    {
                        "n": "厦门市",
                        "code": "3930"
                    }
                ]
            }, {
                "n": "漳州市",
                "code": "362",
                "a": [
                    {
                        "n": "长泰县",
                        "code": "3995"
                    }, {
                        "n": "东山县",
                        "code": "3996"
                    }, {
                        "n": "华安县",
                        "code": "3999"
                    }, {
                        "n": "龙海市",
                        "code": "3991"
                    }, {
                        "n": "南靖县",
                        "code": "3997"
                    }, {
                        "n": "平和县",
                        "code": "3998"
                    }, {
                        "n": "云霄县",
                        "code": "3992"
                    }, {
                        "n": "漳浦县",
                        "code": "3993"
                    }, {
                        "n": "漳州市",
                        "code": "3990"
                    }, {
                        "n": "诏安县",
                        "code": "3994"
                    }
                ]
            }
        ]
    }, {
        "p" : "青海省",
        "code" : "29",
        "c" : [
            {
                "n": "果洛藏族自治州",
                "code": "117",
                "a": [
                    {
                        "n": "班玛县",
                        "code": "8572"
                    }, {
                        "n": "达日县",
                        "code": "8574"
                    }, {
                        "n": "甘德县",
                        "code": "8573"
                    }, {
                        "n": "果洛藏族自治州",
                        "code": "8570"
                    }, {
                        "n": "久治县",
                        "code": "8575"
                    }, {
                        "n": "玛多县",
                        "code": "8576"
                    }, {
                        "n": "玛沁县",
                        "code": "8571"
                    }
                ]
            }, {
                "n": "海北藏族自治州",
                "code": "120",
                "a": [
                    {
                        "n": "刚察县",
                        "code": "8544"
                    }, {
                        "n": "海北藏族自治州",
                        "code": "8540"
                    }, {
                        "n": "海晏县",
                        "code": "8543"
                    }, {
                        "n": "门源回族自治县",
                        "code": "8541"
                    }, {
                        "n": "祁连县",
                        "code": "8542"
                    }
                ]
            }, {
                "n": "海东地区",
                "code": "121",
                "a": [
                    {
                        "n": "海东地区",
                        "code": "8520"
                    }, {
                        "n": "互助土族自治县",
                        "code": "8526"
                    }, {
                        "n": "化隆回族自治县",
                        "code": "8527"
                    }, {
                        "n": "乐都县",
                        "code": "8523"
                    }, {
                        "n": "民和回族土族自治县",
                        "code": "8522"
                    }, {
                        "n": "平安县",
                        "code": "8521"
                    }, {
                        "n": "循化撒拉族自治县",
                        "code": "8528"
                    }
                ]
            }, {
                "n": "海南藏族自治州",
                "code": "123",
                "a": [
                    {
                        "n": "共和县",
                        "code": "8561"
                    }, {
                        "n": "贵德县",
                        "code": "8563"
                    }, {
                        "n": "贵南县",
                        "code": "8565"
                    }, {
                        "n": "海南藏族自治州",
                        "code": "8560"
                    }, {
                        "n": "同德县",
                        "code": "8562"
                    }, {
                        "n": "兴海县",
                        "code": "8564"
                    }
                ]
            }, {
                "n": "海西蒙古族藏族自治州",
                "code": "124",
                "a": [
                    {
                        "n": "德令哈市",
                        "code": "8592"
                    }, {
                        "n": "都兰县",
                        "code": "8594"
                    }, {
                        "n": "格尔木市",
                        "code": "8591"
                    }, {
                        "n": "海西蒙古族藏族自治州",
                        "code": "8590"
                    }, {
                        "n": "天峻县",
                        "code": "8595"
                    }, {
                        "n": "乌兰县",
                        "code": "8593"
                    }
                ]
            }, {
                "n": "黄南藏族自治州",
                "code": "149",
                "a": [
                    {
                        "n": "河南蒙古族自治县",
                        "code": "8554"
                    }, {
                        "n": "黄南藏族自治州",
                        "code": "8550"
                    }, {
                        "n": "尖扎县",
                        "code": "8552"
                    }, {
                        "n": "同仁县",
                        "code": "8551"
                    }, {
                        "n": "泽库县",
                        "code": "8553"
                    }
                ]
            }, {
                "n": "西宁市",
                "code": "314",
                "a": [
                    {
                        "n": "大通回族土族自治县",
                        "code": "8510"
                    }, {
                        "n": "湟源县",
                        "code": "8510"
                    }, {
                        "n": "湟中县",
                        "code": "8510"
                    }, {
                        "n": "西宁市",
                        "code": "8510"
                    }
                ]
            }, {
                "n": "玉树藏族自治州",
                "code": "352",
                "a": [
                    {
                        "n": "称多县",
                        "code": "8583"
                    }, {
                        "n": "囊谦县",
                        "code": "8585"
                    }, {
                        "n": "曲麻莱县",
                        "code": "8586"
                    }, {
                        "n": "玉树藏族自治州",
                        "code": "8580"
                    }, {
                        "n": "玉树县",
                        "code": "8581"
                    }, {
                        "n": "杂多县",
                        "code": "8582"
                    }, {
                        "n": "治多县",
                        "code": "8584"
                    }
                ]
            }
        ]
    }, {
        "p" : "广东省",
        "code" : "30",
        "c" : [
            {
                "n": "潮州市",
                "code": "73",
                "a": [
                    {
                        "n": "潮安营业部",
                        "code": "5872"
                    }, {
                        "n": "潮州市",
                        "code": "5869"
                    }, {
                        "n": "饶平县",
                        "code": "5862"
                    }
                ]
            }, {
                "n": "东莞市",
                "code": "94",
                "a": [
                    {
                        "n": "东莞市",
                        "code": "6020"
                    }
                ]
            }, {
                "n": "佛山市",
                "code": "100",
                "a": [
                    {
                        "n": "佛山市",
                        "code": "5880"
                    }
                ]
            }, {
                "n": "广州市",
                "code": "113",
                "a": [
                    {
                        "n": "从化市",
                        "code": "5810"
                    }, {
                        "n": "广州市",
                        "code": "5810"
                    }, {
                        "n": "增城市",
                        "code": "5810"
                    }
                ]
            }, {
                "n": "河源市",
                "code": "131",
                "a": [
                    {
                        "n": "东源县",
                        "code": "5985"
                    }, {
                        "n": "和平县",
                        "code": "5984"
                    }, {
                        "n": "河源市",
                        "code": "5980"
                    }, {
                        "n": "连平县",
                        "code": "5983"
                    }, {
                        "n": "龙川县",
                        "code": "5982"
                    }, {
                        "n": "紫金县",
                        "code": "5981"
                    }
                ]
            }, {
                "n": "惠州市",
                "code": "152",
                "a": [
                    {
                        "n": "博罗县",
                        "code": "5952"
                    }, {
                        "n": "大亚湾营业部",
                        "code": "5956"
                    }, {
                        "n": "惠东县",
                        "code": "5953"
                    }, {
                        "n": "惠州市",
                        "code": "5950"
                    }, {
                        "n": "龙门县",
                        "code": "5954"
                    }
                ]
            }, {
                "n": "江门市",
                "code": "162",
                "a": [
                    {
                        "n": "恩平市",
                        "code": "5893"
                    }, {
                        "n": "鹤山市",
                        "code": "5895"
                    }, {
                        "n": "江门市",
                        "code": "5890"
                    }, {
                        "n": "开平市",
                        "code": "5894"
                    }, {
                        "n": "台山市",
                        "code": "5892"
                    }
                ]
            }, {
                "n": "揭阳市",
                "code": "164",
                "a": [
                    {
                        "n": "惠来县",
                        "code": "5868"
                    }, {
                        "n": "揭东县",
                        "code": "5871"
                    }, {
                        "n": "揭西县",
                        "code": "5866"
                    }, {
                        "n": "揭阳市",
                        "code": "5865"
                    }, {
                        "n": "普宁市",
                        "code": "5867"
                    }
                ]
            }, {
                "n": "茂名市",
                "code": "210",
                "a": [
                    {
                        "n": "电白县",
                        "code": "5923"
                    }, {
                        "n": "高州市",
                        "code": "5922"
                    }, {
                        "n": "化州市",
                        "code": "5924"
                    }, {
                        "n": "茂名市",
                        "code": "5920"
                    }, {
                        "n": "信宜市",
                        "code": "5921"
                    }
                ]
            }, {
                "n": "梅州市",
                "code": "212",
                "a": [
                    {
                        "n": "大埔县",
                        "code": "5962"
                    }, {
                        "n": "丰顺县",
                        "code": "5963"
                    }, {
                        "n": "蕉岭县",
                        "code": "5967"
                    }, {
                        "n": "梅州市",
                        "code": "5960"
                    }, {
                        "n": "平远县",
                        "code": "5966"
                    }, {
                        "n": "五华县",
                        "code": "5964"
                    }, {
                        "n": "兴宁市",
                        "code": "5965"
                    }
                ]
            }, {
                "n": "清远市",
                "code": "244",
                "a": [
                    {
                        "n": "佛冈县",
                        "code": "6011"
                    }, {
                        "n": "连南县",
                        "code": "6016"
                    }, {
                        "n": "连山县",
                        "code": "6015"
                    }, {
                        "n": "连州市",
                        "code": "6014"
                    }, {
                        "n": "清新县",
                        "code": "6017"
                    }, {
                        "n": "清远市",
                        "code": "6010"
                    }, {
                        "n": "阳山县",
                        "code": "6013"
                    }, {
                        "n": "英德市",
                        "code": "6012"
                    }
                ]
            }, {
                "n": "汕头市",
                "code": "257",
                "a": [
                    {
                        "n": "潮阳市",
                        "code": "5860"
                    }, {
                        "n": "澄海市",
                        "code": "5860"
                    }, {
                        "n": "南澳县",
                        "code": "5863"
                    }, {
                        "n": "汕头市",
                        "code": "5860"
                    }
                ]
            }, {
                "n": "汕尾市",
                "code": "258",
                "a": [
                    {
                        "n": "海丰县",
                        "code": "5971"
                    }, {
                        "n": "陆丰市",
                        "code": "5972"
                    }, {
                        "n": "陆河县",
                        "code": "5973"
                    }, {
                        "n": "汕尾市",
                        "code": "5970"
                    }
                ]
            }, {
                "n": "韶关市",
                "code": "263",
                "a": [
                    {
                        "n": "乐昌市",
                        "code": "5825"
                    }, {
                        "n": "南雄市",
                        "code": "5823"
                    }, {
                        "n": "曲江县",
                        "code": "5820"
                    }, {
                        "n": "仁化县",
                        "code": "5824"
                    }, {
                        "n": "乳源县",
                        "code": "5827"
                    }, {
                        "n": "韶关市",
                        "code": "5820"
                    }, {
                        "n": "始兴县",
                        "code": "5822"
                    }, {
                        "n": "翁源县",
                        "code": "5826"
                    }, {
                        "n": "新丰县",
                        "code": "5828"
                    }
                ]
            }, {
                "n": "深圳市",
                "code": "266",
                "a": [
                    {
                        "n": "深圳市",
                        "code": "5840"
                    }
                ]
            }, {
                "n": "阳江市",
                "code": "338",
                "a": [
                    {
                        "n": "阳春市",
                        "code": "5992"
                    }, {
                        "n": "阳东县",
                        "code": "5993"
                    }, {
                        "n": "阳江市",
                        "code": "5990"
                    }, {
                        "n": "阳西县",
                        "code": "5991"
                    }
                ]
            }, {
                "n": "云浮市",
                "code": "355",
                "a": [
                    {
                        "n": "罗定市",
                        "code": "5941"
                    }, {
                        "n": "新兴县",
                        "code": "5938"
                    }, {
                        "n": "郁南县",
                        "code": "5939"
                    }, {
                        "n": "云浮市",
                        "code": "5937"
                    }
                ]
            }, {
                "n": "湛江市",
                "code": "358",
                "a": [
                    {
                        "n": "雷州市",
                        "code": "5914"
                    }, {
                        "n": "廉江市",
                        "code": "5912"
                    }, {
                        "n": "遂溪县",
                        "code": "5913"
                    }, {
                        "n": "吴川市",
                        "code": "5911"
                    }, {
                        "n": "徐闻县",
                        "code": "5915"
                    }, {
                        "n": "湛江市",
                        "code": "5910"
                    }
                ]
            }, {
                "n": "肇庆市",
                "code": "365",
                "a": [
                    {
                        "n": "德庆县",
                        "code": "5936"
                    }, {
                        "n": "封开县",
                        "code": "5935"
                    }, {
                        "n": "高要市",
                        "code": "5931"
                    }, {
                        "n": "广宁县",
                        "code": "5933"
                    }, {
                        "n": "怀集县",
                        "code": "5934"
                    }, {
                        "n": "四会市",
                        "code": "5932"
                    }, {
                        "n": "肇庆市",
                        "code": "5930"
                    }
                ]
            }, {
                "n": "中山市",
                "code": "368",
                "a": [
                    {
                        "n": "中山市",
                        "code": "6030"
                    }
                ]
            }, {
                "n": "珠海市",
                "code": "374",
                "a": [
                    {
                        "n": "珠海市",
                        "code": "5850"
                    }
                ]
            }
        ]
    }, {
        "p" : "宁夏",
        "code" : "31",
        "c" : [
            {
                "n": "固原市",
                "code": "110",
                "a": [
                    {
                        "n": "固原市",
                        "code": "8741"
                    }, {
                        "n": "泾源县",
                        "code": "8745"
                    }, {
                        "n": "隆德县",
                        "code": "8744"
                    }, {
                        "n": "彭阳县",
                        "code": "8746"
                    }, {
                        "n": "西吉县",
                        "code": "8743"
                    }
                ]
            }, {
                "n": "石嘴山市",
                "code": "271",
                "a": [
                    {
                        "n": "平罗县",
                        "code": "8721"
                    }, {
                        "n": "石嘴山市",
                        "code": "8720"
                    }
                ]
            }, {
                "n": "吴忠市",
                "code": "308",
                "a": [
                    {
                        "n": "青铜峡市",
                        "code": "8732"
                    }, {
                        "n": "同心县",
                        "code": "8737"
                    }, {
                        "n": "吴忠市",
                        "code": "8731"
                    }, {
                        "n": "盐池县",
                        "code": "8736"
                    }
                ]
            }, {
                "n": "银川市",
                "code": "346",
                "a": [
                    {
                        "n": "贺兰县",
                        "code": "8710"
                    }, {
                        "n": "灵武市",
                        "code": "8710"
                    }, {
                        "n": "银川市",
                        "code": "8710"
                    }, {
                        "n": "永宁县",
                        "code": "8710"
                    }
                ]
            }, {
                "n": "中卫市",
                "code": "369",
                "a": [
                    {
                        "n": "海原县",
                        "code": "8742"
                    }, {
                        "n": "中宁县",
                        "code": "8734"
                    }, {
                        "n": "中卫市",
                        "code": "8733"
                    }
                ]
            }
        ]
    }
]